{"status":"ok","post":{"id":1101,"type":"post","slug":"morning-coffee-145","url":"http:\/\/devhawk.net\/2008\/02\/11\/morning-coffee-145\/","status":"publish","title":"Morning Coffee 145","title_plain":"Morning Coffee 145","content":"<ul>\n<li>Saturday, I participated in the Washington Democratic caucus, which was <a href=\"http:\/\/seattlepi.nwsource.com\/local\/350752_caucuses09.html\">handily won by Obama<\/a>. Much has been made of the record Democratic turnout in this race for the nomination, my local caucus location was no exception. It appeared that attendance outstripped expectation about 2-to-1. My precinct alone had 56 attendees, which went overwhelmingly for Obama.  <\/li>\n<li>I had never participated in a presidential caucus or primary before &#8211; the race has always been decided by the time it got to my state. I really enjoyed being a part of the process. So I&#8217;m going to play amateur pundit today, and we&#8217;ll be back to our regularly scheduled geek blogging tomorrow. If I insult your favorite party or candidate, please feel free to leave a scathing comment explaining that I&#8217;m an idiot and how you&#8217;re never going to read my blog again.  <\/li>\n<li>Obama not only won the WA caucus, he also won Louisiana, Nebraska and Maine over the weekend. And he didn&#8217;t just win, he won big. He won by 37% in WA, 36% in Nebraska, 21% in Louisiana and is leading by 15% in Maine with 70% of the vote counted. Momentum hasn&#8217;t meant much in this campaign, but five double-digit Obama wins in a row (with three more likely Obama wins tomorrow) can&#8217;t be good for the Clinton campain. Polling that shows <a href=\"http:\/\/www.time.com\/time\/nation\/article\/0,8599,1711123,00.html?xid=rss-nation\">Obama matches up against McCain better than Clinton<\/a> doesn&#8217;t help.  <\/li>\n<li>Speaking of McCain, he sure had a shitty day Saturday. He lost <a href=\"http:\/\/www.msnbc.msn.com\/id\/21229207\">Kansas<\/a> by a whopping 36%. <a href=\"http:\/\/www.msnbc.msn.com\/id\/21229209\">Louisiana<\/a> was close, but McCain still lost. And in Washington, it looks like the state Republican Party <a href=\"http:\/\/seattlepi.nwsource.com\/local\/350829_trail11.html\">simply stopped counting<\/a> with 1500 votes still left to be counted. I&#8217;m guessing the local GOP party leads were trying to keep McCain from going 0-3 on the day. Had they simply counted the votes and McCain lost, everyone would have forgotten by the time he got the nomination. However, this little helping hand makes McCain look weak and keeps Saturday&#8217;s butt-kicking in the news for several more days.  <\/li>\n<li>Of course, McCain is the presumed Republican nominee because Romney <strike>dropped out<\/strike><a href=\"http:\/\/www.msnbc.msn.com\/id\/23050678\/\">suspended his presidential campaign<\/a> last week. The Daily Show&#8217;s <a href=\"http:\/\/www.thedailyshow.com\/video\/index.jhtml?videoId=156317&amp;title=mitt-drops-out\">coverage Thursday night<\/a> was hilarious. Jason Jones is right, Romney&#8217;s a real <a href=\"http:\/\/www.thedailyshow.com\/video\/index.jhtml?videoId=156319&amp;title=the-douche-vote\">douche bag<\/a>.  <\/li>\n<li>Apparently, McCain is <a href=\"http:\/\/www.nytimes.com\/2008\/02\/10\/us\/politics\/10bush.html?ei=5088&amp;en=b4ace59c7d62fbe9&amp;ex=1360299600&amp;partner=rssnyt&amp;emc=rss&amp;pagewanted=print\">&#8220;eager&#8221;<\/a> for <a href=\"http:\/\/ap.google.com\/article\/ALeqM5jR80ylRipRFz_BSPltSUJ06-lMegD8UM1TRO0\">President 30% Approval Rating<\/a> to &#8220;embrace&#8221; him. Furthermore, the President <a href=\"http:\/\/thinkprogress.org\/2008\/02\/08\/bush-mccain-will-best-carry-out-my-agenda\/\">apparently thinks<\/a> McCain would be the best to carry forth his agenda. I gotta agree with Steve Benen on this &#8211; &#8220;<a href=\"http:\/\/www.thecarpetbaggerreport.com\/archives\/14537.html\">Could Dems really be this lucky?<\/a>&#8221;  <\/li>\n<li>In the wake of McCain&#8217;s Super Tuesday victory, Rush Limbaugh <a href=\"http:\/\/www.reuters.com\/article\/idUSN0628190220080206\">said<\/a> he and other right-wing talk show hosts are &#8220;trying to stop the wanton destruction of the [GOP] party&#8221;. Limbaugh and his cohorts aren&#8217;t going away, but certainly they&#8217;ve been reduced to irrelevant status, standing on the sidelines and stamping their feet while the Republican rank-and-file hand the nomination to McCain. Sure is hilarious to watch. Has anyone considered that Republicans are rooting for the wonton destruction of what their party has become?<\/li>\n<\/ul>\n","excerpt":"<p>Saturday, I participated in the Washington Democratic caucus, which was handily won by Obama. Much has been made of the record Democratic turnout in this race for the nomination, my local caucus location was no exception. It appeared that attendance outstripped expectation about 2-to-1. My precinct alone had 56 attendees, which went overwhelmingly for Obama. [&hellip;]<\/p>\n","date":"2008-02-11 10:41:53","modified":"2011-04-17 16:01:39","categories":[{"id":180,"slug":"morning-coffee","title":"Morning Coffee","description":"","parent":0,"post_count":184}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2027,"name":"Dave","url":"","date":"2008-02-11 16:12:27","content":"<p>As far as I&#8217;m concerned, posting about topics such as politics or religions on a blog that&#8217;s supposedly about technology is just looking for trouble.  I was willing to overlook this one post until the &#8220;douche bag&#8221; comment.  You&#8217;ve been dropped from my Google Reader subscriptions.  I&#8217;m sure I won&#8217;t be the only one dropping you.  <\/p>\n","parent":0},{"id":2028,"name":"Nick Malik","url":"http:\/\/blogs.msdn.com\/nickmalik","date":"2008-02-11 19:07:17","content":"<p>I was at the Obama political rally on Friday.  Here&#8217;s the thing:<br \/>\nHis campaign announces that there will be a rally at the Key Arena (where the Seattle Supersonics Pro Basketball team plays) on Wednesday.  Not a big announcement.  No advertising.  No radio and TV spots.  Free press only.<\/p>\n<p>By Friday morning, at 11am, there was a line around the block to get into Key Arena.  After filling the place to capacity (17,000 people), they had to close the doors.  Fire code.<\/p>\n<p>5,000 more people stood outside, in the cold, and waited for three hours.  When Barak came, we heard him on loud speakers.  <\/p>\n<p>Harry: I canvassed for Bill Clinton (twice) and John Kerry as well.  I knocked on doors and attended rallys and stood on street corners reminding voters to Get Out and Vote.  I placed signs and hung banners and, yes, attended rallys.<\/p>\n<p>Most rallys have about 100 people.  Really Big Rallys can draw 1,000 people.<\/p>\n<p>22,000 people is not a rally.  22,000 people, with no advertising, and two day&#8217;s notice, in a far-away corner of the country, not used to getting any political attention at all&#8230; that&#8217;s historic.<\/p>\n<p>Hillary drew 5,000 on the same day, a few hours earlier.<\/p>\n<p>The fact that she lost by ONLY 2-to-1 in the polls shows that her voters get to the polls far more than they get to the rallys.  <\/p>\n<p>But she lost.  Big.<\/p>\n<p>I like them both.  Either would make a fine president.  But I&#8217;m rooting for Barak.  <\/p>\n","parent":0},{"id":2029,"name":"Rick","url":"","date":"2008-02-13 09:03:16","content":"<p>Yes, you are an idiot and a bigot.<br \/>\nBye bye.<\/p>\n","parent":0},{"id":2030,"name":"Jeff Brown","url":"","date":"2008-02-14 13:59:29","content":"<p>You are another example of the truth:<br \/>\n&#8216;If democrats had any brains they&#8217;d be republicans&#8217;<\/p>\n<p>idiot<\/p>\n","parent":0},{"id":2031,"name":"Dale Churchward","url":"http:\/\/halfmybrain.spaces.live.com\/","date":"2008-02-19 11:27:07","content":"<p>Harry and I come from opposite sides of the political spectrum, but one thing I can say for sure, he is not an idiot. I find it interesting to discuss politics with Harry as he makes me think about why I support certain politicans and issues. While we often disagree I always respect the thought process that led him to the views he takes.<\/p>\n<p>Also, it is hard for me to accept calling him a bigot. No matter the reason, Harry will likely support either Hillary Clinton or Barak Obama. That in itself should point out that he is not a bigot. As far as him comments about Mitt Romney, they might of been a bit strong, although it was pretty well known that the other candidates for the Republican nomination couldn&#8217;t stand Mitt. I am LDS, just like Mitt, and I have never felt Harry has treated me any differently then any of his other co-workers. He has even asked me questions about the church, and has not treated me any different because of my religious beliefs.<\/p>\n<p>In any case, this is Harry&#8217;s blog. He writes about technology much of the time because he is passionate about it, but he also writes about other areas that interest him such as hockey, movies, and politics. We make the choice to read his thoughts or now, but I will say Harry does a good job tagging his blog entires so you can decide if you wish to read them or not.<\/p>\n","parent":0}],"attachments":[],"comment_count":5,"comment_status":"closed","custom_fields":{"dasblog_entryid":["d88e8506-d669-41c3-a246-6da1865f9a2e"],"dasblog_compressedtitle":["Morning+Coffee+145"],"dasblog_compressedtitleunique":["2008\/02\/11\/Morning+Coffee+145"]}},"previous_url":"http:\/\/devhawk.net\/2008\/02\/07\/morning-coffee-144\/","next_url":"http:\/\/devhawk.net\/2008\/02\/13\/morning-coffee-146\/"}