{"status":"ok","post":{"id":618,"type":"post","slug":"what-is-architecture","url":"http:\/\/devhawk.net\/2005\/08\/29\/what-is-architecture\/","status":"publish","title":"What is Architecture?","title_plain":"What is Architecture?","content":"<\/p>\n<p>So since one of my jobs is to change how we evangelize architecture, I thought it might be good to get some clarity around that term. I doubt there&#8217;s a word more varied in definition in this industry than architecture. I often joke is that we call both the person who sets strategic technology direction for the enterprise and the person who decides whether to use a linked list or an array an architect. Maybe it&#8217;s not that bad, but &#8220;architect&#8221; does appear to have a wide range of definitions. <\/p>\n<p>I once moderated a discussion at the Strategic Architect Forum that featured <a href=\"http:\/\/www.martinfowler.com\/\">Martin Fowler<\/a> and this topic came up. Fowler&#8217;s definition of architecture was something along the lines of &#8220;The activities on a project that you do first because you think they&#8217;ll be hard to change&#8221;. He suggested that asking someone to show you their architecture was a sure way to find out the parts of the project they thought most important or were most worried about. While that&#8217;s interesting, I think it&#8217;s harmful to not have a consistent definition of the term across the industry. Everyone knows what a developer does. Nobody knows what an architect does. Well, it seems that way anyway.<\/p>\n<p>Maybe it&#8217;s because my degree is in engineering, but much of what we call architecture in the computer industry feels more like engineering than architecture. One of the <a href=\"http:\/\/dictionary.reference.com\/search?q=architecture\">dictionary definitions of architecture<\/a> is the &#8220;art and science of designing and erecting buildings.&#8221; <a href=\"http:\/\/dictionary.reference.com\/search?q=engineering\">Engineering is defined<\/a> as &#8220;The application of scientific and mathematical principles to practical ends such as the design, manufacture, and operation of efficient and economical structures, machines, processes, and systems.&#8221; <\/p>\n<p>IMO, building a system that has a set of functional requirements (track customers, process orders, etc) and non-functional constraints (sub-second response time, support 10,000 concurrent users, use Microsoft Windows platform, etc) is an engineering problem. Coming up with the lists of functional requirements and non-functional constraints is the architecture problem.<\/p>\n<p>More on this tomorrow&#8230;<\/p>\n","excerpt":"<p>So since one of my jobs is to change how we evangelize architecture, I thought it might be good to get some clarity around that term. I doubt there&#8217;s a word more varied in definition in this industry than architecture. I often joke is that we call both the person who sets strategic technology direction [&hellip;]<\/p>\n","date":"2005-08-29 15:24:40","modified":"2005-08-29 15:24:40","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2827,"name":"Arnon Rotem-Gal-Oz","url":"http:\/\/www.rgoarchitects.com\/","date":"2005-08-29 22:53:45","content":"<p>Hello Harry,<br \/>\nI can&#8217;t say I totally agree that it is the software architect&#8217;s role to come up with the list of functional requirements. That&#8217;s what business analysts or requirement engineers do.<br \/>\nThe role of the architect is to identify which requirements are important and to surface the significant quality attributes (non-functional requirements) of the system (again, the architect is not the source of the quality attributes but his role is to determine which the most important ones are).<br \/>\nThe main point, however, is that I think this is just a small part of the architect’s role. You still need to identify major component, the way they interact and demonstrate how the various quality attributes and main use cases are taken care of by suggested solution. Additional roles includes documenting the architectural decisions,  the responsibility for technology mapping, evaluation of the architecture and making sure that the architecture both followed and correct during the development of the project<br \/>\n I posted my definition of software architecture  a while ago on my blog (<a href=\"http:\/\/www.rgoarchitects.com\/blog\/PermaLink,guid,6c1fc5b2-5c07-4675-b29d-eb8882cd8715.aspx\" rel=\"nofollow\">http:\/\/www.rgoarchitects.com\/blog\/PermaLink,guid,6c1fc5b2-5c07-4675-b29d-eb8882cd8715.aspx<\/a>) which details this further. <\/p>\n<p>Arnon<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["1629f5d2-1504-436c-aa43-91419955fb5d"],"dasblog_compressedtitle":["What+Is+Architecture"],"dasblog_compressedtitleunique":["2005\/08\/29\/What+Is+Architecture"]}},"previous_url":"http:\/\/devhawk.net\/2005\/08\/29\/i-said-id-be-back\/","next_url":"http:\/\/devhawk.net\/2005\/08\/29\/scott-charney-on-critical-infrastructure-protection\/"}