{"status":"ok","post":{"id":280,"type":"post","slug":"thinking-about-spsynd","url":"http:\/\/devhawk.net\/2004\/01\/15\/thinking-about-spsynd\/","status":"publish","title":"Thinking about SPSynd","title_plain":"Thinking about SPSynd","content":"<p>I&#8217;m kicking around <a href=\"unsaved:\/\/\/prj_SharePointSynd.aspx\">SharePoint Syndication<\/a> again. There are a variety of reasons. I got email from someone @ the <a href=\"http:\/\/www.microsoft.com\/sharepoint\/downloads\/components\/default.asp\">SP Web Component Directory<\/a> about it. According to Scoble, the Front Page team is <a href=\"http:\/\/radio.weblogs.com\/0001011\/2004\/01\/15.html#a6193\">interested in RSS<\/a>. And the primary kicker, there&#8217;s a project going on in my group internally that is using WSS and wants to expose RSS feeds. <\/p>\n<p>Glad to know it&#8217;s popular. Too bad it&#8217;s not done and I&#8217;m not sure how to finish it.<\/p>\n<p>Generic feed generation works just fine. The problem is customization. I need a user-friendly way (i.e. not hacking XML in the config file) to configure the feeds. Currently, the config file specifies which lists and webs expose feeds as well as the format of the feed for different list templates. I want to move that config so that it can be managed by the administrator using a simple UI, not the XML file. But that leads to questions: Do I try and stash my config data into the existing web and list configuration via the standard object model or do I bite the bullet and store it somewhere else (i.e. another DB)? What&#8217;s the best way to add admin of the feed to the existing admin pages? Frankly, I don&#8217;t know the answer to these questions.<\/p>\n<p>One way to solve this problem would be to completely refactor the solution. Instead of relying on the <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/spptsdk\/html\/SPPTWSSClassLibrary.asp\">WSS object model<\/a>, I would leverage the <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/spptsdk\/html\/soapnsMicrosoftSharePointSoapServer2.asp\">WSS web services<\/a>. This would let me run the feed generator outside of the confines of WSS. Basically, I&#8217;d just be translating formats &#8211; the output of the web services into RSS and OPML. This would be really great for <a href=\"http:\/\/www.microsoft.com\/windowsserver2003\/techinfo\/sharepoint\/trial.mspx\">hosted WSS<\/a> since it wouldn&#8217;t require any change to the WSS site itself. However, doing the security right for this scenario would be a pain in the ass. WSS web services use transport level authentication which means it&#8217;s difficult to &#8220;hop&#8221; credentials across servers. <\/p>\n<p>I don&#8217;t know if the answers to these dilemmas are out there in the blogosphere, but I figured I might as well put the questions out there.<\/p>\n","excerpt":"<p>I&#8217;m kicking around SharePoint Syndication again. There are a variety of reasons. I got email from someone @ the SP Web Component Directory about it. According to Scoble, the Front Page team is interested in RSS. And the primary kicker, there&#8217;s a project going on in my group internally that is using WSS and wants to [&hellip;]<\/p>\n","date":"2004-01-15 14:05:44","modified":"2004-01-15 14:05:44","categories":[{"id":204,"slug":"development","title":"Development","description":"","parent":0,"post_count":165}],"tags":[{"id":302,"slug":"sharepoint","title":"SharePoint","description":"","post_count":8}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2959,"name":"Mike Walsh","url":"","date":"2004-01-16 01:34:04","content":"<p>>there&#8217;s a project going on in my >group internally that is using WSS >and wants to expose RSS feeds. <\/p>\n<p>I presume they know that there is already a free web part available for RSS feeds that works fine in WSS.<\/p>\n<p><a href=\"http:\/\/www.timheuer.com\/stuff.htm\" rel=\"nofollow\">http:\/\/www.timheuer.com\/stuff.htm<\/a><\/p>\n<p>(I am not Tim Heuer just a user)<\/p>\n","parent":0},{"id":2960,"name":"Harry","url":"http:\/\/devhawk.net","date":"2004-01-16 07:23:10","content":"<p>I&#8217;ve seen that component in the SP Web Component Directory. However, that web part is for reading RSS feeds while my SPSynd project is for creating RSS feeds from WSS lists.<\/p>\n","parent":0},{"id":2961,"name":"Travis Illig","url":"http:\/\/www.paraesthesia.com","date":"2004-01-21 07:47:23","content":"<p>We&#8217;re actually going to be configuring and using SPSynd internally, in conjunction with a custom RSS reader part I wrote (which does audience targeting of feeds, individual feed caching, and has configurable options for display format), and I&#8217;ve been thinking about the same thing &#8211; an easier way to configure SPSynd.  I&#8217;ve toyed with the idea of getting the schema for the configuration file, making a typed Dataset out of it, and doing up some sort of MMC-style admin console (which is part of the reason I joined the GotDotNet workspace for the project), but got sidetracked on other projects.<\/p>\n<p>The use of the web services might be an interesting idea &#8211; if you could set up a domain service account, then grant access to the appropriate lists to that user within WSS, you wouldn&#8217;t even really need to say &#8220;this list is OK to see, this one isn&#8217;t&#8221;; you just authenticate as your service account (which is easy enough &#8211; rather than using pass-through authentication, you specifically create a crendential set with the service account info) and if that user has permissions to the list, it displays.  If not, no display.  Done.  That would alleviate the need for the &#8220;sites&#8221; element in the spsynd.config file.<\/p>\n<p>That said, you&#8217;re still going to have the rest of the config file to deal with, so it doesn&#8217;t get you out of making a nicer admin interface. <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_sad.gif\" alt=\":(\" class=\"wp-smiley\" \/> <\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["e51fbcc1-eb84-47a4-8211-60e4ab60452f"],"dasblog_compressedtitle":["Thinking+About+SPSynd"],"dasblog_compressedtitleunique":["2004\/01\/15\/Thinking+About+SPSynd"]}},"previous_url":"http:\/\/devhawk.net\/2004\/01\/14\/a-friend-returns\/","next_url":"http:\/\/devhawk.net\/2004\/01\/16\/more-old-teammate-news\/"}