{"status":"ok","post":{"id":368,"type":"post","slug":"teched-days-0-1","url":"http:\/\/devhawk.net\/2004\/05\/24\/teched-days-0-1\/","status":"publish","title":"TechEd Days 0 &#038; 1","title_plain":"TechEd Days 0 &#038; 1","content":"<p>I wasn&#8217;t kidding about the calm before TechEd &#8211; I&#8217;ve been slammed for the last 36 hours &#8211; hence the lack of posts. Between 11,000+ attendees, our Road Rally and having to fill in for Pat, I&#8217;m only just now getting a chance to blog, 36 hours after TechEd started.<\/p>\n<p>I had some free time during the day Sunday, but there wasn&#8217;t anything going on yet, so there wasn&#8217;t much to post. Then, Sunday night, we had our Architect Road Rally, which I think was a success. There were some issues &#8211; registration was a real problem in the beginning. The first three buses brought 50 people each, most of whom we had to register on site so it created a reg backlog. Even though we made some changes on site &#8211; primarily not printing event-specific badges for on-site registered attendees &#8211; I realize that registration really stunk for about 30-45 minutes after the event started. I think that, once we got past that issue, most people had a good time. Our event staff found a great venue and hired a great company to provide entertainment in the form of RC racing. <a href=\"http:\/\/johnporcaro.typepad.com\/blog\/\">John<\/a> introduced me to the <a href=\"http:\/\/www.xbox.com\/en-us\/rallisportchallenge2\">Rallisport Challenge 2<\/a> people, so we had Xboxes featuring RSC2. The raffles were very popular as were the event shirts &#8211; I saw around a dozen people wearing the event shirts today. So, other than the reg issues, I&#8217;d say the event worked out as well as I had hoped. TechEd 2004 is our team&#8217;s first large scale event to be formally involved in &#8211; our events typically run 250 attendees total. To compare, we drew almost 300 for the Road Rally. Marketing an event like this is really tough. The venue could support 300-400 people,  but there are 11,000+ TechEd attendees. Even if we only invited architects, there are still somewhere around 1500 attendees who consider themselves architects @ TechEd this year. In the end, while we could have done much better on registration, I really enjoyed the party and think most attendees did too. We certainly had a large number of people on the last couple of busses back to the convention center. <\/p>\n<p>Today started with SteveB&#8217;s keynote and the announcements of <a href=\"http:\/\/msdn.microsoft.com\/webservices\/building\/wse\/\">WSE2<\/a> availability, the <a href=\"http:\/\/msdn.microsoft.com\/ibframework\/\">Information Bridge Framework<\/a>, and the <a href=\"http:\/\/msdn.microsoft.com\/vstudio\/teamsystem\">VS Team System<\/a>. <a href=\"http:\/\/blogs.gotdotnet.com\/rdias\/\">Becky<\/a> demoed WSE2 + IBF and Prashant demoed VS Team System. The website was live before the keynote started, a fact I pointed out to <a href=\"http:\/\/peterprovost.org\/\">Peter<\/a> who <a href=\"http:\/\/www.peterprovost.org\/archive\/2004\/05\/24\/1292.aspx\">blogged<\/a> it as Steve was announcing it. Lots of people have been waiting for WSE2 RTM, but I&#8217;m really excited to see the response to Team System. I&#8217;m working with <i><a href=\"http:\/\/www.microsoft.com\/resources\/practices\">p&amp;p<\/a><\/i> on some community efforts that will plug into the <a href=\"http:\/\/msdn.microsoft.com\/vstudio\/teamsystem\/architect\">Architect edition of Team System<\/a> &#8211; watch for that in the coming months.<\/p>\n<p>After the keynote, I delivered ARC300 and 302 &#8211; <a href=\"http:\/\/blogs.msdn.com\/pathelland\">Pat&#8217;s<\/a> sessions. They both went well, though I was pretty nervous during the ARC300 &#8211; the Metropolis Overview. Funny, since I&#8217;ve delivered that session many times before. Of course, I hadn&#8217;t ever delivered it to this large an audience (300 or so &#8211; standing room only) or on tape. ARC 302 wasn&#8217;t well attended, but those who showed got a preview of Pat&#8217;s drilldown on the parallels between the evolution of buildings and applications as well as a good half hour discussion about the metaphor. Maybe since I didn&#8217;t have high hopes for that session, I was less nervous. Once Pat finished those new sessions, we&#8217;ll tape him presenting them and get them up on the <a href=\"http:\/\/msdn.microsoft.com\/architecture\/overview\/series\">Architecture Strategy Series<\/a> site as soon as we can. <\/p>\n<p>After the day finished, I ran around getting some track-owner stuff done for tomorrow and then had a HUGE margarita with my team. Now, I need sleep very badly! <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/>  <\/p>\n","excerpt":"<p>I wasn&#8217;t kidding about the calm before TechEd &#8211; I&#8217;ve been slammed for the last 36 hours &#8211; hence the lack of posts. Between 11,000+ attendees, our Road Rally and having to fill in for Pat, I&#8217;m only just now getting a chance to blog, 36 hours after TechEd started. I had some free time [&hellip;]<\/p>\n","date":"2004-05-24 23:21:08","modified":"2004-05-24 23:21:08","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":213,"slug":"community","title":"Community","description":"","post_count":81}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2614,"name":"Matevz Gacnik","url":"http:\/\/www.request-response.com","date":"2004-05-25 09:53:08","content":"<p>Harry, I liked your ARC300 session very much. I have heard Pat presenting the same slide deck. You were on par. Congrats!<\/p>\n","parent":0},{"id":2615,"name":"Ganesh babu","url":"","date":"2004-05-25 12:37:19","content":"<p>Great job on the ARC300. It made me think a lot. Great Session!<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["40a26f60-2238-405d-98fc-19898299f031"],"dasblog_compressedtitle":["TechEd+Days+0+1"],"dasblog_compressedtitleunique":["2004\/05\/25\/TechEd+Days+0+1"]}},"previous_url":"http:\/\/devhawk.net\/2004\/05\/20\/the-calm-before-the-teched\/","next_url":"http:\/\/devhawk.net\/2004\/05\/25\/apparently-nagging-works\/"}