{"status":"ok","post":{"id":483,"type":"post","slug":"the-plain-folks-elected-a-downright-moron","url":"http:\/\/devhawk.net\/2004\/11\/17\/the-plain-folks-elected-a-downright-moron\/","status":"publish","title":"The Plain Folks Elected a Downright Moron?","title_plain":"The Plain Folks Elected a Downright Moron?","content":"<p>I&#8217;ve gotten very familiar with the <a href=\"http:\/\/www.snopes.com\/snopes.asp\">Urban Legend Reference Pages<\/a>. I often get emails from close friends or family of supposed news stories and quotes that a quick search on the site demonstrate are false. Today, I hit one of the rarer &#8220;true&#8221; pages on the site. I received a quote in email by <a href=\"http:\/\/www.pratt.lib.md.us\/slrc\/hum\/mencken.html\">H. L. Mencken<\/a> that has apparently been making the rounds on the political blogs that I am not currently reading due to my personal media blackout. The quote making the rounds is:<\/p>\n<blockquote><p>As democracy is perfected, the office of president represents, more and more closely, the inner soul of the people. On some great and glorious day the plain folks of the land will reach their heart&#8217;s desire at last and the White House will be adorned by a downright moron<\/p>\n<\/blockquote>\n<p>Mencken actually did say this, though the above quote is cut down and taken slightly out of context. Here&#8217;s a larger version of the quote:<\/p>\n<blockquote><p>The larger the mob, the harder the test. In small areas, before small electorates, a first-rate man occasionally fights his way through, carrying even the mob with him by force of his personality. But when the field is nationwide, and the fight must be waged chiefly at second and third hand, and the force of personality cannot so readily make itself felt, then all the odds are on the man who is, intrinsically, the most devious and mediocre — the man who can most easily adeptly disperse the notion that his mind is a virtual vacuum. <\/p>\n<p>The Presidency tends, year by year, to go to such men. As democracy is perfected, the office represents, more and more closely, the inner soul of the people. We move toward a lofty ideal. On some great and glorious day the plain folks of the land will reach their heart&#8217;s desire at last, and the White House will be adorned by a downright moron. <\/p>\n<p>[Henry Louis Mencken, &#8220;Bayard vs. Lionheart&#8221;, Baltimore Evening Sun, 26 July 1920. Quoted from <a href=\"http:\/\/www.snopes.com\/politics\/quotes\/mencken.asp\">Snopes.com<\/a>]<\/p>\n<\/blockquote>\n<p>I like the longer version much better. The cutdown quote reads like an indictment of &#8220;the plain folks of the land&#8221;. The longer quote is more a cynical commentary on the process itself. He still predicts (accurately IMO) the election of a moron to the White House, but Mencken seems to lay the blame more on having to campaign &#8220;second and third hand&#8221; than on the people who elect said moron. Either way, you still have a moron, but the longer quote gives much more insight on how to deal with the issue going forward.<\/p>\n<p> I wonder what Mencklen would have thought of the modern media?<\/p>\n","excerpt":"<p>I&#8217;ve gotten very familiar with the Urban Legend Reference Pages. I often get emails from close friends or family of supposed news stories and quotes that a quick search on the site demonstrate are false. Today, I hit one of the rarer &#8220;true&#8221; pages on the site. I received a quote in email by H. [&hellip;]<\/p>\n","date":"2004-11-17 10:36:39","modified":"2004-11-17 10:36:39","categories":[{"id":219,"slug":"politics","title":"Politics","description":"","parent":0,"post_count":41}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2721,"name":"Baldrick Jameson","url":"","date":"2004-11-17 15:06:22","content":"<p>Candidates don&#8217;t come to us &#8220;second and third hand&#8221; anymore because of TV, so Mencken&#8217;s analysis doesn&#8217;t apply. So how did we get this &#8220;downright moron&#8221;? The same old culprit; the elephant in the room; &#8230; religion.<\/p>\n","parent":0},{"id":2722,"name":"Greg Baker","url":"","date":"2004-11-18 07:11:15","content":"<p>Just wondering what the solution to all this is? Is socialism really a better alternative? Because these religious nuts are messing things up, should we, as Garrison Kellior suggested, prevent christians from voting since &#8220;Heaven&#8221; is their real home? How do we deprogram religious peoople? Then again, how do we explain the tens of millions of people killed under the banner of atheism in WWII? Was religion the elephant in the room there? I&#8217;m sooo confused by all this&#8230;<\/p>\n","parent":0},{"id":2723,"name":"Steve Hiner","url":"","date":"2004-11-18 09:15:24","content":"<p>This &#8220;downright moron&#8221; as you call him scored higher on his SATs and IQ tests that the guy that lost.  How do you explain that?  Were this premise true the country would have elected the lesser intellect but we didn&#8217;t.  A persons ability to speak elequently is not always an indicator of their intelligence.<\/p>\n<p>Besides that, being smart isn&#8217;t the only requirement for being a good President.  It might not even be the primary requirement.  Jimmy Carter was arguably the smartest President we&#8217;ve ever had but it would be very hard to argue that he was the best one.<\/p>\n<p>Religion is not the elephant in the room.  People aren&#8217;t supposed to talk about the proverbial &#8220;elephant in the room&#8221; but they certainly talked a lot about religion at the end of the Presidential race.  Even Kerry started pretending that it was important to him.  Despite what you might think, a very large percentage of this country still considers themselves religious and will likely keep voting Presidents that respect religious people.  The Dems as a party seem to think religion is for weak minded people then they wonder why these people they pity don&#8217;t vote for them.  Hmmmmmm.<\/p>\n","parent":0},{"id":2724,"name":"DevHawk","url":"","date":"2004-11-18 10:35:32","content":"<p>I disagree with your point Baldrick about the TV eliminating the second or third had problem &#8211; I think it makes it much much worse. We elect a president based much more on what the candidates surrogates say &#8211; esp. in the case of the Repulicans since so much of the mass media today is conservative. Other than the debates, all we hear from the candidates directly are stump speechs and sound bites. <\/p>\n<p>As for solutions, I don&#8217;t know. I certainly don&#8217;t think socialism or denying anyone the right to vote is the right choice. Remember, I&#8217;m for election reform &#8211; I want EVERYONE to vote, even if they vote against the candidate I support.<\/p>\n","parent":0}],"attachments":[],"comment_count":4,"comment_status":"closed","custom_fields":{"dasblog_entryid":["9f7d2e7c-2fd4-46bc-be18-521d275a6501"],"dasblog_compressedtitle":["The+Plain+Folks+Elected+A+Downright+Moron"],"dasblog_compressedtitleunique":["2004\/11\/17\/The+Plain+Folks+Elected+A+Downright+Moron"]}},"previous_url":"http:\/\/devhawk.net\/2004\/11\/17\/two-thumbs-up-on-new-comcast-service\/","next_url":"http:\/\/devhawk.net\/2004\/11\/19\/one-photostory-gripe\/"}