{"status":"ok","post":{"id":288,"type":"post","slug":"intergrate-vs-interoperate","url":"http:\/\/devhawk.net\/2004\/01\/22\/intergrate-vs-interoperate\/","status":"publish","title":"Intergrate vs. Interoperate","title_plain":"Intergrate vs. Interoperate","content":"<p align=\"left\">I found this <a href=\"http:\/\/www.itnews.com.au\/storycontent.asp?ID=8&amp;Art_ID=17952\">interview<\/a> with the BEA deputy CTO Benjamin Renaud via a <a href=\"http:\/\/www.theserverside.net\/news\/thread.aspx?thread_id=23432\">news post<\/a> on <a href=\"http:\/\/www.theserverside.net\/\">TSS.NET<\/a>. BEA&#8217;s position is summed up in the following quote:<\/p>\n<blockquote><p align=\"left\">&#8220;Microsoft will standardise at the protocol level, but they won&#8217;t standardise at the API level,&#8221; he said. &#8220;Customers are not that gullible. The real level where integration happens is at the programming level.&#8221;<\/p>\n<\/blockquote>\n<p align=\"left\">I like <a href=\"http:\/\/www.theserverside.net\/articles\/article.aspx?l=Welcome\">Ted&#8217;s<\/a> response to this:<\/p>\n<blockquote><p align=\"left\">We&#8217;re sorry, Mr. Renaud, but integration isn&#8217;t necessarily what web services are after&#8211;interoperability, in the form of loosely coupled components that know how to exchange messages of data, are the key to truly powerful web services. If you want programmatic integration, you have to standabrdize on programming platform and language, and that&#8217;s not what web services were supposed to be for. <\/p>\n<p>As to his complaint that Microsoft is engaged in a huge bait-and-switch, we believe he&#8217;s either not putting enough faith in the development community to see this conspiracy, or else he&#8217;s trying to cry foul over the fact that BEA has to compete with others in the Java space for the web services dollar, where Microsoft stands relatively alone. <\/p>\n<\/blockquote>\n<p align=\"left\">However, I&#8217;m not sure what Ted&#8217;s driving at with his interop vs. integration argument. To me, they seem to go hand in hand &#8211; two great tastes that taste great together. Web services are important for both. If I&#8217;m not integrating disparate systems, I probably don&#8217;t care about interop that much. <\/p>\n<p align=\"left\">Personally, I care much more about integration than interop. Even if I was going to build a system-of-systems all using only .NET technology, I would still use a service-oriented approach and implement those services using web service technology. The service-oriented approach allows me to be more flexible in the way I stitch my services together. Using web service technology allows me to leverage platform technology (ASMX, WSE, Indigo, etc) so I don&#8217;t have to roll the whole stack myself. The fact that I get interop &#8220;for free&#8221; by using this approach is an extra bonus that I don&#8217;t really care much about &#8211; at first. That built-in interop, even in this single-platform-which-never-happens-in-the-real-world scenario, helps make my systems future-resistant (nothing is future-proof). New customers, new partners, mergers &#8211; come what may, I have a better-than-average chance of being able to integrate it into my system. That gives me an real advantage ($$$) in the marketplace.<\/p>\n<p align=\"left\">Of course, back in the real-world where you&#8217;re creating a system-of-systems from a series of stand-alone systems that are all built with different platforms, interop is much more important. But that doesn&#8217;t mean integration is any less important.<\/p>\n","excerpt":"<p>I found this interview with the BEA deputy CTO Benjamin Renaud via a news post on TSS.NET. BEA&#8217;s position is summed up in the following quote: &#8220;Microsoft will standardise at the protocol level, but they won&#8217;t standardise at the API level,&#8221; he said. &#8220;Customers are not that gullible. The real level where integration happens is [&hellip;]<\/p>\n","date":"2004-01-22 14:05:17","modified":"2004-01-22 14:05:17","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["55924b25-2011-41ab-91a9-5374c92d5706"],"dasblog_compressedtitle":["Intergrate+Vs+Interoperate"],"dasblog_compressedtitleunique":["2004\/01\/22\/Intergrate+Vs+Interoperate"]}},"previous_url":"http:\/\/devhawk.net\/2004\/01\/22\/type-of-architects\/","next_url":"http:\/\/devhawk.net\/2004\/01\/27\/shaking-off-the-ice\/"}