{"status":"ok","post":{"id":657,"type":"post","slug":"javascript-utilities","url":"http:\/\/devhawk.net\/2005\/11\/23\/javascript-utilities\/","status":"publish","title":"JavaScript Utilities","title_plain":"JavaScript Utilities","content":"<p>Can you tell it&#8217;s a slow day in the office? <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n<p>Speaking of raising the level of abstraction as well as browser based applications, check out Nikhil&#8217;s <a href=\"http:\/\/www.nikhilk.net\/Project.JSUtils.aspx\">JavaScript Utilities project<\/a>:<\/p>\n<blockquote dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"><p>The project introduces the notion of .jsx (extended JavaScript) and .jsa (JavaScript assembly) files. JSX files provide the ability to include conditional code via familiar preprocessor directives such as #if, #else, #endif and so on&#8230;The tool processes these directives in order to produce a standard .js file. JSA files build on top of .jsx files. While they can include normal JavaScript and preprocessor directives, they are primarily there for including individual .jsx and .js files via #include directives. This allows you to split your script into more manageable individual chunks.<\/p>\n<\/blockquote>\n<p>Now, that&#8217;s not raising the level of abstraction much, but here&#8217;s another example of working in a higher abstracted environment (jsx and jsa) and then compiling down to something the underlying platform can execute (js). Nikhil provides three ways of doing this compliation:<\/p>\n<ol>\n<ol>\n<li>A set of standalone tools that output standard .js files that you can then deploy to your web site. Command line parameters are used to control the behavior of the tools.\n<\/li>\n<li>A couple of IHttpHandler implementations that allow you to dynamically convert your code into standard .js files. This is the mode where you can benefit from implementing per-browser code in a conditional manner. AppSetting values in configuration are used to control the conversion behavior.\n<\/li>\n<li>As a script project in VS using an msbuild project along with an msbuild task that comes along with the project. MSBuild project properties are used to control the conversion behavior. <\/li>\n<\/ol>\n<\/ol>\n<p>If you&#8217;re going to raise the level of abstraction to do implement a preprocessor, you could also go all the way and implement an entirely new language that gets compiled down to JavaScript for execution in the browser. For example, I&#8217;m not as familiar or comfortable with JavaScript&#8217;s <a href=\"http:\/\/en.wikipedia.org\/wiki\/Prototype-based_programming\">prototype based approach<\/a>. But I could imagine a more class based language that compiles to JavaScript. That&#8217;s the same way early C++ compilers worked &#8211; they were a preprocessor pass that converted the C++ into C, which could then be compiled with traditional C compilers. <\/p>\n<p>I wonder what JavaScript++ would look like<\/p>\n","excerpt":"<p>Can you tell it&#8217;s a slow day in the office? Speaking of raising the level of abstraction as well as browser based applications, check out Nikhil&#8217;s JavaScript Utilities project: The project introduces the notion of .jsx (extended JavaScript) and .jsa (JavaScript assembly) files. JSX files provide the ability to include conditional code via familiar preprocessor [&hellip;]<\/p>\n","date":"2005-11-23 12:03:42","modified":"2005-11-23 12:03:42","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["1c6578cc-02cd-497f-86e7-58392de25eb0"],"dasblog_compressedtitle":["JavaScript+Utilities"],"dasblog_compressedtitleunique":["2005\/11\/23\/JavaScript+Utilities"]}},"previous_url":"http:\/\/devhawk.net\/2005\/11\/23\/as-simple-as-possible-but-no-simpler\/","next_url":"http:\/\/devhawk.net\/2005\/12\/15\/back-in-business-2\/"}