[
  {
    "id": 2111,
    "author-name": "Dan Ciruli",
    "author-email": "danciruli@hotmail.com",
    "author-url": "",
    "date": "2008-08-08T14:54:10-07:00",
    "content": "When I saw your comment, I bought a second subscription!  ;-)",
    "parent-id": 1168,
    "RowKey": "20080808-145410"
  },
  {
    "id": 2112,
    "author-name": "gabe anzelini",
    "author-email": "devhawk@anzelini.org",
    "author-url": "",
    "date": "2008-08-08T15:17:05-07:00",
    "content": "why be upset, if liberals want to call their own names, who am i to stop them?",
    "parent-id": 1168,
    "RowKey": "20080808-151705"
  },
  {
    "id": 2113,
    "author-name": "BigJ",
    "author-email": "",
    "author-url": "",
    "date": "2008-08-08T15:52:04-07:00",
    "content": "Ok, we can have some fun with this!  You're right, \"powerful, influential, big money contributor\" doesn't really sound right without the proper inflection.  Dittoheads would understand.  Reading long responses can be arduous so I was trying to be short and cute.\n\nAs for the post analysis, there is an additional possible reason for the lack of responses that you failed to mention.  No one cares what an Obama supporter thinks about politics, it’s likely to change when his handlers write the next speech anyway ;) haha.\n",
    "parent-id": 1168,
    "RowKey": "20080808-155204"
  },
  {
    "id": 2114,
    "author-name": "wcy",
    "author-email": "wcyeee@gmail.com",
    "author-url": "",
    "date": "2008-08-08T19:14:49-07:00",
    "content": "I wasn't as outraged as you by that clip. But, to your question, it's because everyone knows just how much of a dick he really can be:\n\nPostmodern John McCain: the presidential candidate some Arizonans know — and loathe\nhttp://www.phoenixnewtimes.com/content/printVersion/848709\n\nSeriously, he made a tasteless joke about Chelsea Clinton who was a teen at the time? Wow, a bunch of old men laughing over that. Dick. Definitely.\n\nOn a lighter note, it's only deserving to laugh at the old coot and his early onset moments:\n\nhttp://www.youtube.com/watch?v=iWX5u69hmzY\n\n",
    "parent-id": 1168,
    "RowKey": "20080808-191449"
  },
  {
    "id": 2115,
    "author-name": "Dale Churchward",
    "author-email": "dale.churchward@microsoft.com",
    "author-url": "http://halfmybrain.live.spaces.com",
    "date": "2008-08-11T13:46:33-07:00",
    "content": "I wouldn't call McCain's whole campaign an embarrassment, simply agreeing that the commercial in question was in poor taste. In any case, I haven't decided for sure who I am voting for since neither candidate is close to what I would call a conservative. I will never unsubscribe just because you write something political. It is your blog after all, and I find your arguments well thought out even when I disagree with them.",
    "parent-id": 1168,
    "RowKey": "20080811-134633"
  },
  {
    "id": 2116,
    "author-name": "Dan Ciruli",
    "author-email": "danciruli@hotmail.com",
    "author-url": "",
    "date": "2008-08-13T12:36:48-07:00",
    "content": "I have to agree with Dale Churchward -- one commercial doesn't make the whole campaign an embarrassment.\n\nBut since EVERY commercial exhibits the same qualities, I think it's safe to say.",
    "parent-id": 1168,
    "RowKey": "20080813-123648"
  },
  {
    "id": 2117,
    "author-name": "Tim",
    "author-email": "tboland@gmail.com",
    "author-url": "http://www.techtoolblog.com",
    "date": "2008-10-07T06:44:50-07:00",
    "content": "Ok,you asked for it :)  You are a dick & I'm not following your blog anymore",
    "parent-id": 1168,
    "RowKey": "20081007-064450"
  }
]