{"status":"ok","post":{"id":1013,"type":"post","slug":"the-durable-messaging-debate-continues","url":"http:\/\/devhawk.net\/2007\/07\/26\/the-durable-messaging-debate-continues\/","status":"publish","title":"The Durable Messaging Debate Continues","title_plain":"The Durable Messaging Debate Continues","content":"<p>Last week, Nick Malik <a href=\"http:\/\/blogs.msdn.com\/nickmalik\/archive\/2007\/07\/19\/is-durability-in-messaging-bad-libor-thinks-so.aspx\">responded<\/a> to Libor Soucek&#8217;s <a href=\"http:\/\/lsblog.wordpress.com\/2007\/07\/05\/avoid-durable-messages-in-enterprise-services\/\">advice<\/a> to avoid durable messaging. Nick points out that while both durable and non-durable messaging requires some type of compensation logic (nothing is 100% foolproof because fools are so ingenious), the durable messaging compensation logic is significantly simpler. <\/p>\n<p>This led to a <a href=\"http:\/\/lsblog.wordpress.com\/2007\/07\/21\/durable-messages-still-losing-over-redundancy-and-eda\/\">very long conversation<\/a> over on Libor&#8217;s blog. Libor started by clarifying his original point, and then the two of them went back and forth chatting in the comments. It&#8217;s been very respectful, Libor calls both Nick and I &#8220;clever and influential&#8221; though he also thinks we&#8217;re wrong on this durable messaging thing. In my private emails with Libor, he&#8217;s been equally respectful and his opinion is very well thought out, though obviously I think <em>he&#8217;s<\/em> the one who&#8217;s wrong. <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" class=\"grouped_elements\" rel=\"tc-fancybox-group1013\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n<p>I&#8217;m not sure how much is clear from Libor&#8217;s public posts, but it looks like most of his recent experience comes from building trading exchanges. According to his <a href=\"http:\/\/lsblog.wordpress.com\/about\/\">about page<\/a>, he&#8217;s been building electronic trading systems since 2002. While I have very little experience in that domain, I can see very clearly how the highly redundant, reliable multicast approach that he describes would be a very good if not the best solution.<\/p>\n<p>But there is no system inside Microsoft IT that looks even remotely like a trading exchange. Furthermore, I don&#8217;t think approaches for building a trading exchange generalize well. So that means Nick and I have very different priorities than Libor, something that seems to materialize as a significant amount of talking past each other. As much as I respect Libor, I can&#8217;t shake the feeling that he doesn&#8217;t &#8220;get&#8221; my priorities and I wouldn&#8217;t be at all surprised if he felt the same way about me.<\/p>\n<p>The biggest problem with his highly redundant approach is the sheer cost when you consider the large number of systems involved. <a href=\"http:\/\/lsblog.wordpress.com\/2007\/07\/21\/durable-messages-still-losing-over-redundancy-and-eda\/#comment-830\">According to Nick<\/a>, MSIT has &#8220;over 2700 applications in 82 solution domains&#8221;. When you consider the cost for taking a highly redundant approach across that many applications, the cost gets out of control very quickly. Nick estimates that the support staff cost alone for tripling our hardware infrastructure to make it highly redundant would be around half a billion dollars a year. And that doesn&#8217;t include hardware acquisition costs, electricity costs, real-estate costs (gotta put all those servers somewhere) or any other costs. The impact to Microsoft&#8217;s bottom line would be enormous, for what Nick calls &#8220;negligible or invisible&#8221; benefit.<\/p>\n<p>There&#8217;s no question that high availability costs big money. I just asked <a href=\"http:\/\/halfmybrain.spaces.live.com\/\">Dale<\/a> about it, and he said that in his opinion going above 99.9% availability increases costs &#8220;nearly exponentially&#8221;. He estimates just going from 99% to 99.9% doubles the cost. 99% availability is almost 15 minutes of downtime per day (on average). 99.9% is about 90 seconds downtime per day (again, on average).  <\/p>\n<p>How much is that 13 extra minutes of uptime per day worth? I would say &#8220;depends on the application&#8221;. How many of the 2700 applications Nick mentions need even 99% availability? Certainly some do, but I would guess that less than 10% of those systems need better than 99% <em>availability<\/em>. What pretty much all of them actually need is high <em>reliability<\/em>, which is to say they need to work even in the face of &#8220;<a href=\"http:\/\/en.wikipedia.org\/wiki\/Reliability\">hostile or unexpected circumstances<\/a>&#8221; (like system failures and downtime).<\/p>\n<p>High availability implies high reliability. However, the reverse is not true. You can build systems to gracefully handle failures without the cost overhead of highly redundant infrastructure intended to avoid failures. Personally, I think the best way to build such highly reliable yet not highly available systems is to use durable messaging, though I&#8217;m sure there are other ways. <\/p>\n<p>This is probably the biggest difference between Libor and me. I am actively looking to trade away availability (not reliability) in return for lowering the cost of building and running a system. To someone who builds electronic trading systems like Libor, that probably sounds completely wrongheaded. But an electronic trading system would fall into the minority of systems that need high availability (ultra high five nines of availability in this case). For the systems that actually do need high availability, you have to invest in redundancy to get it. But for the rest of the systems, there&#8217;s a less costly way to get the reliability you need: Durable Messaging. <\/p>\n","excerpt":"<p>Last week, Nick Malik responded to Libor Soucek&#8217;s advice to avoid durable messaging. Nick points out that while both durable and non-durable messaging requires some type of compensation logic (nothing is 100% foolproof because fools are so ingenious), the durable messaging compensation logic is significantly simpler. This led to a very long conversation over on [&hellip;]<\/p>\n","date":"2007-07-26 13:48:34","modified":"2007-07-26 13:48:34","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":201,"slug":"durable-messaging","title":"Durable Messaging","description":"","post_count":5}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["9534eca8-3c7f-40bd-b06f-a49de1b57425"],"dasblog_compressedtitle":["The+Durable+Messaging+Debate+Continues"],"dasblog_compressedtitleunique":["2007\/07\/26\/The+Durable+Messaging+Debate+Continues"]}},"previous_url":"http:\/\/devhawk.net\/2007\/07\/25\/now-how-much-would-you-pay-for-this-code\/","next_url":"http:\/\/devhawk.net\/2007\/07\/27\/afternoon-coffee-106\/"}