{"status":"ok","post":{"id":867,"type":"post","slug":"hawkeye-on-web-service-software-factory","url":"http:\/\/devhawk.net\/2007\/01\/30\/hawkeye-on-web-service-software-factory\/","status":"publish","title":"Hawkeye on Web Service Software Factory","title_plain":"Hawkeye on Web Service Software Factory","content":"<p>As I wrote the other day, I&#8217;ve been investigating the <a href=\"http:\/\/msdn2.microsoft.com\/en-us\/library\/aa480534.aspx\">Web Service Software Factory<\/a>. The WSSF includes four guidance packages: Data Access, ASMX, WCF and WCF Security. The Data Access isn&#8217;t service specific (I&#8217;m guessing it&#8217;s also included in p&amp;p&#8217;s <a href=\"http:\/\/msdn2.microsoft.com\/en-us\/library\/aa137950.aspx\">other factories<\/a>) so I didn&#8217;t focus on it much. I also didn&#8217;t investigate the ASMX package at all. <\/p>\n<p>For the WCF and WCF Security packages, I walked through the tutorial in the documentation. The tutorial contains the usual WCF suspects such as creating a data contract, creating a service contract and implementing a service contract. While you can do these things manually, the WSSF provides wizards for most if not all these operations. This seems like overkill for some of these operations. For example, filling out the grid of data contract members was more cumbersome (for me) then just typing the values in the code file. <\/p>\n<p>Also on the subject of somewhat more complex than necessary, WSSF provides wizards for building type translators. This is pretty standard stuff: given an instance of a given type, the translator returns an instance of a different type. Again, I find it faster to write the code for this directly than to individually select the matching fields in the wizard UI. Somewhere on the complexity scale between CRUD stored procedures and service data contracts is the tipping point where it&#8217;s faster and easier to just write the code than it is to manipulate the wizard UI which generates the code.<\/p>\n<p>On the plus side, the WSSF includes snippets which are very convenient to use. For example, WSSF includes the WCFDataMember snippet (short name: wcfDM). It&#8217;s a lot like the standard prop snippet, but with the automatic addition of the DataMember attribute.<\/p>\n<p>I had much more success with the main WCF package than I did with the WCF Security package. I wasn&#8217;t interested in the anonymous or direct authentication mechanisms, which left only two security recipes that I cared about: kerberos and x.509 certificates. Unfortunately, I couldn&#8217;t make either of these tutorials work. For kerberos, the baseline configuration works (i.e. standard wsHttpBinding with no additional configuration), but after running the &#8220;Secure a Service Using Kerberos&#8221; recipe, I get an exception that &#8220;The token provider cannot get tokens for target&#8221;. It wasn&#8217;t in me to debug the sample to figure out what that meant. For x.509 certificates, I can&#8217;t even complete the wizard &#8211; I click OK in the certificate selection dialog, but the wizard doesn&#8217;t get updated and won&#8217;t let me continue. <\/p>\n<p>I really dig the new <a href=\"http:\/\/blogs.msdn.com\/tomholl\/archive\/2006\/06\/07\/GuidanceNavigator.aspx\">Guidance Navigator<\/a> window, especially the history window, but I do have one problem with it. Is there a way to mark a recipe so it doesn&#8217;t show up in the history view? The WSSF includes some recipes like &#8220;View Service in Browser&#8221; and &#8220;Run Client&#8221; that don&#8217;t change the project state and quickly clutter up the history view. It would be great if they didn&#8217;t show up there in the first place.<\/p>\n<p>I&#8217;m guessing the WSSF is designed primarily new WCF developers, so I&#8217;m not exactly in the target demographic. Many of my issues above stem from my deeper than average experience with it (though nowhere near the depth of experience some members of the community have already). But it&#8217;s a good start and I&#8217;m sure it will get better with successive releases.<\/p>\n","excerpt":"<p>As I wrote the other day, I&#8217;ve been investigating the Web Service Software Factory. The WSSF includes four guidance packages: Data Access, ASMX, WCF and WCF Security. The Data Access isn&#8217;t service specific (I&#8217;m guessing it&#8217;s also included in p&amp;p&#8217;s other factories) so I didn&#8217;t focus on it much. I also didn&#8217;t investigate the ASMX [&hellip;]<\/p>\n","date":"2007-01-30 14:53:20","modified":"2007-01-30 14:53:20","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":245,"slug":"guidance","title":"Guidance","description":"","post_count":6},{"id":313,"slug":"wcf","title":"WCF","description":"","post_count":31}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2448,"name":"Don Smith","url":"http:\/\/blogs.msdn.com\/donsmith","date":"2007-01-31 11:39:42","content":"<p>It&#8217;s interesting that you took the developer perspective Harry. I can see how a real proficient dev who has memorized all the necessary WCF attributes and config sections might just choose to write the code instead of invoke wizards. Most of these recipes certainly aren&#8217;t generating mind-bending code &#8230; actually they are generating mind-numbing code. It isn&#8217;t interesting code to write and certainly not fun. The exception might be the code generated by the data access guidance package &#8211; this stuff is more interesting, but there sure can be a lot of it &#8230; but is data access the problem we want to go solve &#8230; again? <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n<p>I&#8217;m surprised you didn&#8217;t take the architect perspective. What about the ability to modify the guidance packages to include the architectural or policy decisions of the solutions? I know it isn&#8217;t super easy, but it&#8217;s more interesting than writing property assessors <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/>  I would think the ability to define new code analysis rules interesting to architects too.<\/p>\n<p>I&#8217;ll check into disabling recipes from being shown in the guidance navigator window. I&#8217;m almost positive there is a way to do this. I&#8217;ll ping you offline. <\/p>\n<p>I&#8217;ll also have someone ping you about the x.509 and kerb issues you ran into. We don&#8217;t have any known issues around these recipes so I&#8217;m interested in what caused them.<\/p>\n<p>As always, thanks for the feedback and insight!<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["a8ceccf6-df2a-4213-9b87-ef1d46e31516"],"dasblog_compressedtitle":["Hawkeye+On+Web+Service+Software+Factory"],"dasblog_compressedtitleunique":["2007\/01\/30\/Hawkeye+On+Web+Service+Software+Factory"]}},"previous_url":"http:\/\/devhawk.net\/2007\/01\/30\/morning-coffee-20\/","next_url":"http:\/\/devhawk.net\/2007\/01\/31\/morning-coffee-21\/"}