{"status":"ok","post":{"id":1259,"type":"post","slug":"checkin-comments-for-ironpython-source","url":"http:\/\/devhawk.net\/2009\/05\/07\/checkin-comments-for-ironpython-source\/","status":"publish","title":"Checkin Comments for IronPython Source","title_plain":"Checkin Comments for IronPython Source","content":"<p>We’ve been slowly but surely increasing the frequency of IronPython source drops. When I joined the team last April, we we only pushing the source about twice a month (sometimes only once a month). By last July, we were pushing source about once a week. Since mid-January, we’ve pushed out the latest source 131 times, which comes to about once a day on average since the start of the year. Big kudos to <a href=\"http:\/\/knowbody.livejournal.com\/\">Dave Fugate<\/a>, who’s primarily responsible for improving the frequency of our source code drops.<\/p>\n<p>However, while we’ve been good about source code drop frequency, we haven’t been good about transparency. All those source drops have the same less-than-useful checkin comment “Latest IP sources migrated to CodePlex TFS”. If you wanted to know what was changed in a given changeset, you had to do the diff yourself.<\/p>\n<p>But all that opaque code changes is a thing of the past now. Dave upgraded out source push script so that it emails a list of changes as well as the checkin comments whenever we update the source on CodePlex. For example, check out the <a href=\"http:\/\/lists.ironpython.com\/pipermail\/users-ironpython.com\/2009-May\/010275.html\">source push announcement<\/a> for our <a href=\"http:\/\/ironpython.codeplex.com\/SourceControl\/changeset\/view\/49849\">latest source drop<\/a>.  Now we publish added, deleted and modified sources as well as the comments for any checkins included in the source drop. <\/p>\n<p>As Dave <a href=\"http:\/\/lists.ironpython.com\/pipermail\/users-ironpython.com\/2009-May\/010245.html\">said on the mailing list<\/a>, please let us know if you have any feedback on these source update emails. I think they’re awesome (though I did have <a href=\"http:\/\/lists.ironpython.com\/pipermail\/users-ironpython.com\/2009-May\/010277.html\">one small suggestion<\/a>) but we want to know what you think. <\/p>\n","excerpt":"<p>We’ve been slowly but surely increasing the frequency of IronPython source drops. When I joined the team last April, we we only pushing the source about twice a month (sometimes only once a month). By last July, we were pushing source about once a week. Since mid-January, we’ve pushed out the latest source 131 times, [&hellip;]<\/p>\n","date":"2009-05-07 11:19:38","modified":"2009-05-07 11:19:38","categories":[{"id":252,"slug":"ironpython","title":"IronPython","description":"","parent":0,"post_count":99}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["9d828751-7047-4ba0-96dd-7caba92eb59f"],"dasblog_compressedtitle":["Checkin+Comments+For+IronPython+Source"],"dasblog_compressedtitleunique":["2009\/05\/07\/Checkin+Comments+For+IronPython+Source"]}},"previous_url":"http:\/\/devhawk.net\/2009\/05\/05\/happy-birthday-riley\/","next_url":"http:\/\/devhawk.net\/2009\/05\/18\/microsoft-and-open-source\/"}