{"status":"ok","post":{"id":1305,"type":"post","slug":"variadic-powershell-functions-with-optional-named-params","url":"http:\/\/devhawk.net\/2011\/02\/02\/variadic-powershell-functions-with-optional-named-params\/","status":"publish","title":"Variadic Powershell Functions With Optional Named Params","title_plain":"Variadic Powershell Functions With Optional Named Params","content":"<p>I’ve been doing a little CPython coding lately. Even though I <a href=\"http:\/\/devhawk.net\/2009\/10\/27\/Joining+Windows.aspx\">left the IronPython team<\/a> a while ago (and IronPython is now <a href=\"http:\/\/blogs.msdn.com\/b\/jasonz\/archive\/2010\/10\/21\/new-components-and-contributors-for-ironpython-and-ironruby.aspx\">under new management<\/a>) I’m still still a big fan of the Python language and it’s great for prototyping. <\/p>\n<p>However, one thing I don’t like about Python is how it uses the <a href=\"http:\/\/docs.python.org\/using\/cmdline.html#envvar-PYTHONPATH\">PYTHONPATH environment variable<\/a>. I like to keep any non-standard library dependencies in my project folder, but then you have to set the PYTHONPATH environment variable in order for the Python interpreter to resolve those packages. Personally, I wish there was a command line parameter for specifying PYTHONPATH – I hate having to modify the environment in order to execute my prototype. Yes, I realize I don’t have to modify the machine-wide environment – but I would much prefer a stateless approach to an approach that requires modification of local shell state.<\/p>\n<p>I decided to build a <a href=\"http:\/\/cid-0d9bc809858885a4.office.live.com\/self.aspx\/DevHawk%20Content\/Powershell\/cpy.ps1\">Powershell script<\/a> that takes allows the caller to invoke Python while specifying the PYTHONPATH as a parameter. The script saves off the current PYTHONPATH, sets it to the passed in value, invokes the Python interpreter with the remaining script parameters, then sets PYTHONPATH back to its original value. While I was at it, I added the ability to let the user optionally specify which version of Python to use (defaulting to the most recent) as well as a switch to let the caller chose between invoking <a href=\"http:\/\/docs.python.org\/using\/windows.html#executing-scripts\">python.exe or pythonw.exe<\/a>.<\/p>\n<p>The details of the script are fairly mundane. However, building a Powershell script that supported optional named parameters and collected all the unnamed arguments together in a single parameter took a little un-obvious Powershell voodoo that I thought was worth blogging about.<\/p>\n<p>I started with the following param declaration for my function<\/p>\n<pre class=\"brush: powershell\">\nparam (\n    [string] $LibPath=\"\", \n    [switch] $WinApp, \n    [string] $PyVersion=\"\"\n)\n<\/pre>\n<p>These three named parameters control the various features of my Python Powershell script. Powershell has an <a href=\"http:\/\/technet.microsoft.com\/en-us\/library\/dd347675.aspx\">automatic variable<\/a> named $args that holds the arguments that don’t get bound to a named argument. My plan was to pass the contents of the $args parameter to the Python interpreter. And that plan works fine…so long as none of the non-switch parameters are omitted. <\/p>\n<p>I mistakenly (and in retrospect, stupidly) thought that since I had provided default values for the named parameters, they would only bind to passed-in arguments by name. However, Powershell binds non-switch parameters by position if the names aren’t specified . For example, this is the command line I use to execute tests from the root of my prototype project:<\/p>\n<pre class=\"brush: text\">\ncpy -LibPath .Libsite-packages .Scriptsunit2.py discover -s .src\n<\/pre>\n<p>Obviously, the $LibPath parameter gets bound to the “.Libsite-package” argument. However, since $PyVersion isn’t specified by name, it gets bound by position and picks up the “.Scriptsunit2.py” argument. Clearly, that’s not what I intended – I want “.Scriptsunit2.py” along with the remaining arguments to be passed to the Python interpreter while the PyVersion parameter gets bound to its default value.<\/p>\n<p>What I needed was more control over how incoming arguments are bound to parameters. Luckily, Powershell 2 introduced <a href=\"http:\/\/technet.microsoft.com\/en-us\/library\/dd347600.aspx\">Advanced Function Parameters<\/a> which gives script authors exactly that kind of control over parameters binding. In particular, there are two custom attributes for parameters that allowed me to get the behavior I wanted:<\/p>\n<ul>\n<li>Position – allows the script author to specify what positional argument should be bound to the parameter. If this argument isn’t specified, parameters are bound in the order they appear in the param declaration<\/li>\n<li>ValueFromRemainingArguments – allows the script author to specify that all remaining arguments that haven’t been bound should be bound to this parameter. This is kind of like the Powershell equivalent of <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/w5zay9db.aspx\">params in C#<\/a> or the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Stdarg.h#Declaring_variadic_functions\">ellipsis in C\/C++<\/a>. <\/li>\n<\/ul>\n<p>A little experimentation with these attributes yielded the following solution:<\/p>\n<pre class=\"brush: powershell\">\nparam (\n    [string] $LibPath=\"\", \n    [switch] $WinApp, \n    [string] $PyVersion=\"\",\n    [parameter(Position=0, ValueFromRemainingArguments=$true)] $args\n)\n<\/pre>\n<p>Note, the first three parameters are unchanged. However, I added an explicit $args parameter (I could have named it anything, but I had already written the rest of my script against $args) with the Position=0 and ValueFromRemainingArguments=$true parameter attribute values.The combination of these two attribute values means that the $args parameter is bound to an array of all the positional (aka unnamed) incoming arguments, starting with the first position. In other words – exactly the behavior I wanted.<\/p>\n<p>Not sure how many people need a Powershell script that sets PYTHONPATH and auto-selects the latest version of Python, but maybe someone will find it useful. Also, I would think this approach to variadic functions with optional named parameters could be useful in other scenarios where you are wrapping an existing tool or utility in PowerShell, but need the ability to pass arbitrary parameters thru to the tool\/utility being wrapped.<\/p>\n","excerpt":"<p>I’ve been doing a little CPython coding lately. Even though I left the IronPython team a while ago (and IronPython is now under new management) I’m still still a big fan of the Python language and it’s great for prototyping. However, one thing I don’t like about Python is how it uses the PYTHONPATH environment [&hellip;]<\/p>\n","date":"2011-02-02 21:38:51","modified":"2011-04-17 20:10:14","categories":[{"id":204,"slug":"development","title":"Development","description":"","parent":0,"post_count":165}],"tags":[{"id":230,"slug":"powershell","title":"PowerShell","description":"","post_count":41},{"id":259,"slug":"python","title":"Python","description":"","post_count":7}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2321,"name":"Barry Kelly","url":"http:\/\/blog.barrkel.com\/","date":"2011-02-02 23:14:38","content":"<p>&#8220;I wish there was a command line parameter for specifying PYTHONPATH – I hate having to modify the environment in order to execute my prototype.&#8221;<\/p>\n<p>There is, in bash:<\/p>\n<p>PYTHONPATH=\/whatever\/you\/like your-program<\/p>\n<p>I use this feature all the time; the compiler I work on (Delphi) uses an envvar to specify logging options in the debug build. I&#8217;m a little bit surprised it&#8217;s not a feature in PowerShell.<\/p>\n<p>foo=x bar=y your-app<\/p>\n<p>etc.<\/p>\n","parent":0},{"id":2322,"name":"Barry Kelly","url":"http:\/\/blog.barrkel.com\/","date":"2011-02-02 23:19:15","content":"<p>I should add that these environment variables are applied by bash after it has forked, and before the exec &#8211; so it doesn&#8217;t affect the ambient shell&#8217;s environment.<\/p>\n<p>I use Cygwin bash. Works very well.<\/p>\n","parent":0},{"id":2323,"name":"Michael Foord","url":"http:\/\/voidspace.org.uk\/","date":"2011-02-03 02:57:54","content":"<p>You can also add custom .pth files (text files containing paths) to site-packages to add directories to sys.path.<\/p>\n","parent":0},{"id":2324,"name":"DevHawk","url":"","date":"2011-02-03 10:17:42","content":"<p>@Barry &#8211; you can set the ambient shell environment in powershell ($env:PYTHONPATH = \/whatever\/you\/like) but I&#8217;m not aware of way to apply the environment changes to a forked process w\/o affecting the current one. I would suspect it&#8217;s possible, but it&#8217;s not out of the box AFAIK.<\/p>\n<p>@Michael &#8211; I didn&#8217;t know about .pth files &#8211; I&#8217;ll take a look at that!<\/p>\n","parent":0}],"attachments":[],"comment_count":4,"comment_status":"closed","custom_fields":{"dasblog_entryid":["41f3e3dd-5165-4025-b4dc-8d216fb63d4e"],"dasblog_compressedtitle":["Variadic+Powershell+Functions+With+Optional+Named+Params"],"dasblog_compressedtitleunique":["2011\/02\/03\/Variadic+Powershell+Functions+With+Optional+Named+Params"]}},"previous_url":"http:\/\/devhawk.net\/2010\/10\/07\/testing-the-untestable-with-delegate-injection\/","next_url":"http:\/\/devhawk.net\/2011\/04\/16\/devhawk-has-a-brand-new-blog-engine\/"}