{"status":"ok","post":{"id":1116,"type":"post","slug":"experience-vs-change","url":"http:\/\/devhawk.net\/2008\/03\/05\/experience-vs-change\/","status":"publish","title":"Experience vs. Change","title_plain":"Experience vs. Change","content":"<p>My wife and I usually watch <a href=\"http:\/\/www.thedailyshow.com\">The Daily Show<\/a> a day late and yesterday was no exception. Hillary Clinton was the guest Monday night in advance of yesterday&#8217;s big primaries in Ohio and Texas which Jon Stewart called the &#8220;Ultimate Last Final Showdown (Unless Hillary Wins One or Both of the Larger States)&#8221;. If you missed it, you can watch the interview online (<a href=\"http:\/\/www.thedailyshow.com\/video\/index.jhtml?videoId=163165&amp;title=sen.-hillary-clinton-pt.-1\">part 1<\/a>, <a href=\"http:\/\/www.thedailyshow.com\/video\/index.jhtml?videoId=163166&amp;title=sen.-hillary-clinton-pt.-2\">part 2<\/a>). <\/p>\n<p>I haven&#8217;t seen much &#8216;raw footage&#8217; from either Democratic candidate in quite some time, and through most of the interview all I could think was &#8220;I may have an Obama flair on my website, but I&#8217;d be happy with Hillary&#8221;. However, there was a section of the interview where she was trying to draw a distinction between her and Obama that didn&#8217;t sit well with me. She&#8217;s been on this whole &#8220;action not words&#8221; kick of late, trying to take the wind out of Obama&#8217;s sails. For example, in her <a href=\"http:\/\/www.hillaryclinton.com\/news\/speech\/view\/?id=6353\">speech last night<\/a> in Ohio, she said this:<\/p>\n<blockquote><p>Americans don&#8217;t need more promises. They’ve heard plenty of speeches. They deserve solutions and they deserve them now.  <\/p>\n<p>America needs a president who’s ready to lead, ready to stand up for what&#8217;s right even when it&#8217;s hard. And after seven long years of George W. Bush, we sure are ready for a president who will be a fighter, a doer and a champion for the American people again. <\/p>\n<\/blockquote>\n<p>To be clear, this kind of talk doesn&#8217;t bother me on it merits. <a href=\"http:\/\/www.balloon-juice.com\/?p=9834\">Some folks<\/a> aren&#8217;t happy with Clinton because she&#8217;s &#8220;dumpster diving&#8221; or they think that she&#8217;s ripping the party apart. I think she&#8217;s fighting for her political career and I would hope any Democratic candidate would go down swinging as it were. Besides, as Howard Dean said, the negative campaigning we&#8217;ve seen so far is a &#8220;<a href=\"http:\/\/www.boston.com\/news\/politics\/politicalintelligence\/2008\/03\/dean_says_no_wo.html\">tea party<\/a>&#8221; compared to what the Republicans will throw at the eventual nominee. I&#8217;d also make the argument that it&#8217;s better to get as much of this stuff &#8220;out there&#8221; now so that it&#8217;s old news by November. That that doesn&#8217;t kill you makes you stronger, right?<\/p>\n<p>However, I do think Clinton is painting herself into a general election corner with this experience vs. change strategy. <\/p>\n<p>I get why Clinton played the experience card &#8211; she had to do something to take the wind out of Obama&#8217;s sails after 11 straight victories. If the <a href=\"http:\/\/www.msnbc.msn.com\/id\/23463159\/\">popular primary vote results from Tuesday<\/a> are any indication, the experience message is working for her. So I would expect we&#8217;ll hear a lot more about how we &#8220;don&#8217;t need more promises&#8221; but that we need a president &#8220;who&#8217;s ready to lead&#8221; in the next seven weeks ahead before the Pennsylvania primary.<\/p>\n<p>However, if she does win the nomination, she&#8217;ll have to to argue the exact opposite position in the general election. I&#8217;m certainly no fan of McCain, but there&#8217;s no question his 25 years in Washington will cast him as the &#8220;experience&#8221; candidate (even though <a href=\"http:\/\/www.thecarpetbaggerreport.com\/archives\/14582.html\">he hasn&#8217;t accomplished much<\/a> in that quarter century). Plus, with the Howard Dean already <a href=\"http:\/\/www.democrats.org\/a\/2008\/03\/dean_mccain_has.php\">framing McCain<\/a> as &#8220;four more years of George Bush&#8221;, it&#8217;s pretty obvious either Democratic candidate will be cast as the &#8220;change&#8221; candidate. <\/p>\n<p>Will Clinton have credibility running as the candidate for change when she&#8217;s spent the spring arguing that experience matters most? I don&#8217;t know. Combined with the rabid anti-Clinton (both her and her husband) emotions her candidacy is assuredly going invoke among conservatives, I&#8217;m much more concerned about her ability to win in November than Obama&#8217;s.<\/p>\n<p>In the end, I doubt it will matter. Obama&#8217;s roughly 160 pledged delegate lead seems pretty insurmountable. Even with Clinton&#8217;s impressive victories yesterday, <a href=\"http:\/\/tpmelectioncentral.talkingpointsmemo.com\/2008\/03\/so_how_many_delegates_did.php\">estimates<\/a> are that she&#8217;s going to only net around ten delegates total, meaning the delegate math is largely unchanged. With only 561 delegates left in the remaining twelve contests, she would need to win almost 65% of the remaining delegates just to draw even. Frankly, that&#8217;s not possible given proportional delegate allocation method that Democrats use. At this point, her only hope is to cut the margin as much as possible and hope the undeclared superdelegates break her way. Hope isn&#8217;t a strategy, but I don&#8217;t see how she has any other option.<\/p>\n","excerpt":"<p>My wife and I usually watch The Daily Show a day late and yesterday was no exception. Hillary Clinton was the guest Monday night in advance of yesterday&#8217;s big primaries in Ohio and Texas which Jon Stewart called the &#8220;Ultimate Last Final Showdown (Unless Hillary Wins One or Both of the Larger States)&#8221;. If you [&hellip;]<\/p>\n","date":"2008-03-05 09:24:41","modified":"2008-03-05 09:24:41","categories":[{"id":219,"slug":"politics","title":"Politics","description":"","parent":0,"post_count":41}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["bea219e7-31dc-45dd-a13b-c5faed5b04cf"],"dasblog_compressedtitle":["Experience+Vs+Change"],"dasblog_compressedtitleunique":["2008\/03\/05\/Experience+Vs+Change"]}},"previous_url":"http:\/\/devhawk.net\/2008\/03\/04\/kitchen-sink-variability\/","next_url":"http:\/\/devhawk.net\/2008\/03\/05\/morning-coffee-154\/"}