{"status":"ok","post":{"id":348,"type":"post","slug":"da-vinci-code","url":"http:\/\/devhawk.net\/2004\/04\/11\/da-vinci-code\/","status":"publish","title":"Da Vinci Code","title_plain":"Da Vinci Code","content":"<p>Like the rest of the known universe, I recently read <a href=\"http:\/\/www.danbrown.com\/novels\/davinci_code\/\">The Da Vinci Code<\/a> by <a href=\"http:\/\/www.danbrown.com\/meet_dan\/index.html\">Dan Brown<\/a>. I had read <a href=\"http:\/\/www.danbrown.com\/novels\/angels_demons\">Angels &amp; Demons<\/a> on a plane trip back from Alaska when my laptop battery had died. A&amp;D was good, esp. considering the low bar of killing several hours flying back from Anchorage. I tried to read <a href=\"http:\/\/www.danbrown.com\/novels\/digital_fortress\">Digital Fortress<\/a> but just couldn&#8217;t stand it. I liked the crypto part of it, but the characters were blown so out of proportion that I just could never get into it. Also, who starts a thriller with that much backstory? So I approached Da Vinci Code with some trepidation, but also hope. <\/p>\n<p>Of course, it hooked me instantly and before I knew it I was 100 pages in. This was much much better than Fortress or A&amp;D. In addition to the great plot and characters, this book does an amazing job of obfuscating the line between reality and fiction. While I don&#8217;t believe the events actually occurred or that Robert Langdon exists, the background history of Da Vinci, the Holy Grail, Christianity and the incorporation of pagan traditions was fascinating. Given the success of Passion of the Christ &#8211; by all accounts a hyper-literal interpretation of the Bible &#8211; I think it&#8217;s interesting that the equally-successful Da Vinci Code essentially refutes that the Bible is <i>THE<\/i> word of God. Of course, the Da Vinci Code is a novel so I&#8217;m not really sure where the facts ends and the fiction begins. I haven&#8217;t read a book that blurred that line so well since <a href=\"http:\/\/www.crichton-official.com\/jp\/index.html\">Jurassic Park<\/a>.<\/p>\n<p>Unfortunately, while Dan Brown may be a brilliant researcher and steadily improving as a writer, it all comes apart in the end. The true identity of the Da Vinci Code&#8217;s primary nemesis left me (and subsequently my wife) very disappointed. I kept wondering how he was going to pull it all together in the end. For all the finely detailed logic and history of this story, it felt to me as if the author essentially picked the least likely character to be the bad guy for the sole purpose of minimizing the chances the reader would guess it. It&#8217;s fine to be surprised at the end, but it&#8217;s got to make some sense. What&#8217;s the point of building to a climax only to pull it out of your ass when you get there?<\/p>\n","excerpt":"<p>Like the rest of the known universe, I recently read The Da Vinci Code by Dan Brown. I had read Angels &amp; Demons on a plane trip back from Alaska when my laptop battery had died. A&amp;D was good, esp. considering the low bar of killing several hours flying back from Anchorage. I tried to [&hellip;]<\/p>\n","date":"2004-04-11 13:43:12","modified":"2004-04-11 13:43:12","categories":[],"tags":[{"id":349,"slug":"books","title":"Books","description":"","post_count":1}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["941ee6e9-d300-45c1-acc0-52237dd67728"],"dasblog_compressedtitle":["Da+Vinci+Code"],"dasblog_compressedtitleunique":["2004\/04\/11\/Da+Vinci+Code"]}},"previous_url":"http:\/\/devhawk.net\/2004\/04\/08\/its-all-a-platform\/","next_url":"http:\/\/devhawk.net\/2004\/04\/12\/is-the-middle-tier-endangered\/"}