{"status":"ok","post":{"id":72,"type":"post","slug":"rss-questions","url":"http:\/\/devhawk.net\/2003\/04\/17\/rss-questions\/","status":"publish","title":"RSS Questions","title_plain":"RSS Questions","content":"<p>I&#8217;m working on adding individual list support to my SharePoint RSS Feed Generator. This allows me to pass the name or ID for a specific list on the query string and return that list as a channel. However, it is possible to pass invalid data on the query string. For example, I could subscribe to the RSS feed for a list only to have that list be deleted. The next time my news aggregator updates, the requested list will be invalid. I&#8217;ve decided to return HTTP 404 if this happen. Is this the right behavior?<\/p>\n<p align=\"left\">Second question: can an RSS feed have multiple channels? In SharePoint, a web is a collection of lists and a list is a collection of list items. If the user requests the RSS feed for a web, they get back a channel with the title\/link\/description of the web and an item element for each list item in every list in the web. That means that when the user requests a web&#8217;s RSS feed, the list grouping is being flattened out (though I do put the list&#8217;s name as the category of any list item). Wouldn&#8217;t it make more sense to return multiple channels? According to the <a href=\"http:\/\/backend.userland.com\/rss\">spec<\/a>, there can only be a single channel element under the rss element. If that&#8217;s the case, why even have a channel element? Why not just put all of channel&#8217;s children directly under the rss element? <\/p>\n<p align=\"left\">I&#8217;d like to see a revision to the RSS spec to add optional support for multiple channels and for optional title\/link\/description elements as direct children of the rss element. Of course, if we <a href=\"http:\/\/www.intertwingly.net\/blog\/1283.html#c1048031206\">can&#8217;t<\/a><a href=\"http:\/\/objective.mine.nu\/archive\/2003\/3\/22.aspx#when:12:06:06.3531952\"> agree<\/a> on a <a href=\"http:\/\/www.snellspace.com\/blog\/archives\/000340.html\"> namespace<\/a>, I assume we&#8217;ll never get my suggestions added.<\/p>\n","excerpt":"<p>I&#8217;m working on adding individual list support to my SharePoint RSS Feed Generator. This allows me to pass the name or ID for a specific list on the query string and return that list as a channel. However, it is possible to pass invalid data on the query string. For example, I could subscribe to [&hellip;]<\/p>\n","date":"2003-04-17 17:57:42","modified":"2003-04-17 17:57:42","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["8f35b62e-1fb3-4d05-b588-1544ff8fd1bb"],"dasblog_compressedtitle":["RSS+Questions"],"dasblog_compressedtitleunique":["2003\/04\/18\/RSS+Questions"]}},"previous_url":"http:\/\/devhawk.net\/2003\/04\/17\/sharepoint-rss-feed-generator\/","next_url":"http:\/\/devhawk.net\/2003\/04\/19\/talking-trash-about-tony\/"}