{"status":"ok","post":{"id":1297,"type":"post","slug":"ironpython-2-0-3-and-2-6-rc2","url":"http:\/\/devhawk.net\/2009\/10\/27\/ironpython-2-0-3-and-2-6-rc2\/","status":"publish","title":"IronPython 2.0.3 and 2.6 RC2","title_plain":"IronPython 2.0.3 and 2.6 RC2","content":"<p>It has been a very busy week for the IronPython team. Just under a week ago, we shipped a <a href=\"http:\/\/devhawk.net\/2009\/10\/21\/IronPython+And+IronRuby+CTPs+For+NET+40+Beta+2.aspx\">CTP for .NET Framework 4.0<\/a>. Since then, we’ve shipped two – yes, two! – more versions of IronPython. Three releases in one week! If we could keep up that pace, we’d be shipping like 27 more releases of IronPython by the end of the year!<\/p>\n<p>FYI, we’re not going to keep up the pace of shipping three releases a week for the next two months. We may be a little crazy on the IronPython team, but we’re not THAT crazy!<\/p>\n<p>Actually, all three of these releases represent fairly small changes in the IronPython source tree. The .NET 4.0 beta was a CTP, so it’s basically whatever we had in our main trunk when they forked .NET Framework for the beta. <\/p>\n<p><a href=\"http:\/\/ironpython.codeplex.com\/Release\/ProjectReleases.aspx?ReleaseId=30416\">IronPython 2.0.3<\/a> is a minor point release in the 2.0 branch (duh). In addition to backporting some fixes from 2.6, we had to fix an CLR breaking change in partial trust on Windows 7. If you’re using IronPython 2.0.x in partial trust on Windows 7 you *MUST* upgrade to 2.0.3 (or 2.6 when it’s released). Sorry about that – but it was out of our hands. <\/p>\n<p><a href=\"http:\/\/ironpython.codeplex.com\/Release\/ProjectReleases.aspx?ReleaseId=34451\">IronPython 2.6 RC2<\/a> is – as you would expect &#8211; a minor update over the first release candidate. There was a memory leak discovered in the hosting APIs which forced us to do a second release candidate. Since we had to fix that, we took in a few of other fixes including some standard library changes (we left out json by accident in RC1 and Michael Foord got logging updated to work better with IronPython so we took the latest version of it). As per the release notes, we expect this to be the final RC and will re-ship it as RTM in about a month. Please start using this latest release and let us know if you find anything.<\/p>\n","excerpt":"<p>It has been a very busy week for the IronPython team. Just under a week ago, we shipped a CTP for .NET Framework 4.0. Since then, we’ve shipped two – yes, two! – more versions of IronPython. Three releases in one week! If we could keep up that pace, we’d be shipping like 27 more [&hellip;]<\/p>\n","date":"2009-10-27 14:29:29","modified":"2009-10-27 14:29:29","categories":[{"id":252,"slug":"ironpython","title":"IronPython","description":"","parent":0,"post_count":99}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["a105b675-f06a-4548-a8f3-3525a5b96654"],"dasblog_compressedtitle":["IronPython+203+And+26+RC2"],"dasblog_compressedtitleunique":["2009\/10\/27\/IronPython+203+And+26+RC2"]}},"previous_url":"http:\/\/devhawk.net\/2009\/10\/26\/joining-windows\/","next_url":"http:\/\/devhawk.net\/2009\/10\/27\/the-soa-manifesto-pointlessness-manifested\/"}