{"status":"ok","post":{"id":241,"type":"post","slug":"minor-dasblog-bugfix","url":"http:\/\/devhawk.net\/2003\/12\/08\/minor-dasblog-bugfix\/","status":"publish","title":"Minor DasBlog Bugfix","title_plain":"Minor DasBlog Bugfix","content":"<p>A few months ago, one of my first enhancements I made to dasBlog was to change the way the CommentView page is rendered. Previously, it was rendered using the item template. However, I don&#8217;t include the entry post date in the item template, since it&#8217;s in big bold letters on the day template. So I changed the CommentView to render the single entry being displayed using the day template. This makes the CommentView page consistent with the Permalink page, which also renders the single entry using the day template. <\/p>\n<p>However, when I made the change, I introduced a bug that shipped as part of the v1.4 release. When I called ProcessDayTemplate, I passed in the entry&#8217;s CreatedUtc time as the day to render parameter. This caused an issue where the CommentView would not render the entry when the day of the CreatedUtc did not equal the time-zone adjusted created date. For example, if I posted a new entry at 8pm PST, that is 4am UTC the following day. So if I ask to render the UTC based date, the time-zone adjusted entry does not fall on that day, and thus doesn&#8217;t render. So I changed the call to ProcessDayTemplate to use the entry&#8217;s CreatedLocalTime property instead of the CreatedUtc. I tested, all seemed good, so I submitted the fix, which made it into the v1.5 release.<\/p>\n<p>Today, I noticed a <a href=\"http:\/\/www.gotdotnet.com\/Community\/MessageBoard\/Thread.aspx?id=170130\">thread<\/a> on the dasBlog <a href=\"http:\/\/www.gotdotnet.com\/Community\/Workspaces\/workspace.aspx?id=77a29128-4746-4473-b676-e4f1517a1907\">GDN workspace<\/a> indicating the bug was still there. A little bit of tracking down and I discovered that what the server thinks is the local time does not always match what dasBlog thinks the local time is. CreatedLocalTime is based on the server local time. If you run your server in a different time zone than dasBlog is configured for, you run into basically the same issue as before. Of course, since I run my dev server in the same timezone as dasBlog, I never noticed it. However, since my production server is on the east coast and I&#8217;m on the west coast, the issue showed up on my production machine.<\/p>\n<p>I posted a code fix over on the <a href=\"http:\/\/www.gotdotnet.com\/Community\/MessageBoard\/Thread.aspx?id=170130\">GDN Message Board Thread<\/a>. Basically, I calculate the correct time based off the dasBlog configured time zone. Seems to have fixed the problem on my dev and production machines. (I&#8217;m running my dev machine in a different time zone now). Let me know if you run into any more issues.<\/p>\n","excerpt":"<p>A few months ago, one of my first enhancements I made to dasBlog was to change the way the CommentView page is rendered. Previously, it was rendered using the item template. However, I don&#8217;t include the entry post date in the item template, since it&#8217;s in big bold letters on the day template. So I [&hellip;]<\/p>\n","date":"2003-12-08 15:38:38","modified":"2003-12-08 15:38:38","categories":[],"tags":[{"id":184,"slug":"blogging","title":"Blogging","description":"","post_count":122},{"id":303,"slug":"dasblog","title":"dasBlog","description":"","post_count":12}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2922,"name":"Scott Hanselman","url":"http:\/\/www.computerzen.com","date":"2003-12-09 11:14:31","content":"<p>And I thank you for it! <\/p>\n<p>Scott &#8220;Glucose&#8221; Hanselman<\/p>\n","parent":0},{"id":2923,"name":"Richard Tallent","url":"http:\/\/www.tallent.us\/","date":"2003-12-10 11:00:17","content":"<p>Grr&#8230; I&#8217;ve been bitten hard by that bug, or another one very much like it in v1.2. A good number of my old BlogX items and comments just won&#8217;t render in dasBlog. Omar Shahine has been helping me out, but if you have any other suggestions (such as how to re-generate the dayextra files with the correct comments in each, renaming won&#8217;t work since I post at all hours of the day and night), I&#8217;m all ears&#8230;<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["3e585d35-7570-4538-b7e9-ea04df02df10"],"dasblog_compressedtitle":["Minor+DasBlog+Bugfix"],"dasblog_compressedtitleunique":["2003\/12\/08\/Minor+DasBlog+Bugfix"]}},"previous_url":"http:\/\/devhawk.net\/2003\/12\/07\/now-with-more-power\/","next_url":"http:\/\/devhawk.net\/2003\/12\/08\/my-techie-wife\/"}