{"status":"ok","post":{"id":322,"type":"post","slug":"in-support-of-gay-marriage","url":"http:\/\/devhawk.net\/2004\/02\/26\/in-support-of-gay-marriage\/","status":"publish","title":"In Support of Gay Marriage","title_plain":"In Support of Gay Marriage","content":"<p><a href=\"http:\/\/radio.weblogs.com\/0001011\/2004\/02\/25.html#a6667\">Scoble<\/a> and <a href=\"http:\/\/www.sellsbrothers.com\/news\/showTopic.aspx?ixTopic=1154\">Chris<\/a> have blogged their support for homosexual marriage, so here&#8217;s my +1. Unlike Chris, I&#8217;ve known quite a few homosexuals in my life. Several of my best friends (as in, would seriously consider donating a kidney to kind of friends) are gay. I grew up hanging around the theater world where homosexuality is much more pervasive (and accepted) than &#8220;mainstream&#8221; society. I used to have a bunch of friends on a gay hockey team (it sounds cliché, but they were called the Gay Blades). And this past summer, my wife, our then-six-month-old son and I went to Victoria, Canada to see my two uncles get married after a lifetime of commitment to each other.<\/p>\n<p>As part of the ceremony, my uncle told me how much my involvement in his life has meant to him and husband. I wasn&#8217;t told that he was gay until I was going to college at USC, which was about an hour drive from my uncle&#8217;s home. For reasons they would have to explain, my parents didn&#8217;t tell me until then. When my mother finally told me my uncle was gay, she was in tears, so I naturally assumed he had AIDS and was dying. I mean, why else would she be crying? He wasn&#8217;t dying, she was just worried how I would react. As far as I was and still am concerned, being gay doesn&#8217;t change anything. Since I couldn&#8217;t fly back to the east coast for long weekends, I got to spend them with my uncles instead. I don&#8217;t get to see them as often as I did back then, though they have come up to see us twice since my son was born. But they will always be a major part of my life and I will be forever honored that they asked me and my family to be a part of their wedding.<\/p>\n<p>I&#8217;m a huge <a href=\"http:\/\/www.billmaher.com\/\">Bill Maher<\/a> fan and I only just recently discovered <a href=\"http:\/\/www.hbo.com\/billmaher\/\">Real Time<\/a>. He talked about gay marriage in the <a href=\"http:\/\/www.hbo.com\/billmaher\/new_rules\/20040213.html\">Valentine&#8217;s Day edition of his New Rules<\/a>. As a Democrat, it really struck a cord with me.<\/p>\n<blockquote><p>Republicans used to be the party that opposed social engineering. But now they push programs to outlaw marriage for some people and encourage it for others. If you&#8217;re straight, there&#8217;s a billion-five in the budget to promote marriage, but gay marriage is opposed because it threatens or mocks or does something to the &#8220;sanctity&#8221; of marriage, as if anything you can do in Vegas, drunk off your ass in front of an Elvis impersonator, could be considered sacred. <\/p>\n<p>But at least the right wing aren&#8217;t hypocrites on this issue. They really believe that homosexuality is an abomination and a dysfunction that&#8217;s curable&#8230;But I have to tell you, the greater shame in this story goes to the Democrats, because they don&#8217;t believe homosexuality is an abomination. And therefore, their refusal to endorse gay marriage is hypocrisy. Their position doesn&#8217;t come from the Bible. It&#8217;s ripped right from the latest poll, which says most Americans are against gay marriage. <\/p>\n<p>Well, you know what? Sometimes most Americans are just wrong. And where is the Democrat who will stand up and go beyond the half measures of &#8220;civil union&#8221; and &#8220;hate the sin, love the sinner&#8221; and say loud and clear, &#8220;There is no sin; it&#8217;s not an abomination and no one can control how cupid aims his arrows.&#8221; <\/p>\n<\/blockquote>\n<p>I&#8217;m not running for office, but I&#8217;ll say it: Homosexuality isn&#8217;t a sin, an abomination or wrong. Letting homosexuals get married isn&#8217;t going to weaken society, change the most fundamental institution of civilization, cause the sky to fall or any of the other things that <a href=\"http:\/\/www.cnn.com\/2004\/ALLPOLITICS\/02\/24\/elec04.prez.bush.transcript\/index.html\">Bush claims<\/a> it will cause. Legislating discrimination however, which is what Bush&#8217;s proposed amendment to the Constitution amounts to, actually will weaken society and change what is really the most fundamental institution of civilization: freedom. <\/p>\n<p>Bush certainly talks a lot about freedom when he&#8217;s trying to justify the <strike>invasion<\/strike> liberation of Iraq. However, in <a href=\"http:\/\/www.cnn.com\/2004\/ALLPOLITICS\/02\/24\/elec04.prez.bush.transcript\/index.html\">calling for a amendment to outlaw gay marriage<\/a>, the only reference to freedom was when he said that &#8220;commitment of freedom&#8230;does not require the redefinition of one of our most basic social institutions.&#8221; Actually, when these &#8220;basic social institutions&#8221; are inherently discriminatory &#8211; take slavery and women&#8217;s lack of right to vote as examples &#8211; it is absolutely required that we redefine them to eliminate the discrimination. Otherwise, we become the kind of a <a href=\"http:\/\/encarta.msn.com\/encyclopedia_761568245\/Fascism.html\">fascist society<\/a> that our founding fathers were trying to avoid when they wrote the <a href=\"http:\/\/encarta.msn.com\/encyclopedia_761569008_3\/Constitution_of_the_United_States.html#s69\">Constitution<\/a> in the first place. That&#8217;s what establishing Justice, insuring domestic Tranquility and securing the Blessings of Liberty is all about.<\/p>\n","excerpt":"<p>Scoble and Chris have blogged their support for homosexual marriage, so here&#8217;s my +1. Unlike Chris, I&#8217;ve known quite a few homosexuals in my life. Several of my best friends (as in, would seriously consider donating a kidney to kind of friends) are gay. I grew up hanging around the theater world where homosexuality is [&hellip;]<\/p>\n","date":"2004-02-26 17:46:25","modified":"2004-02-26 17:46:25","categories":[{"id":219,"slug":"politics","title":"Politics","description":"","parent":0,"post_count":41}],"tags":[{"id":348,"slug":"society","title":"Society","description":"","post_count":1}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":3002,"name":"Me","url":"","date":"2004-02-27 07:04:39","content":"<p>I think you need to see the bigger issue. Gay marriage isn&#8217;t about two consenting adults making a decisions and we should let them alone and do what they want. It is a societal issue. Those in favor of gay marriage say it is so they can enjoy the same benefits that heterosexual couples have. Where does it lead to? For example, if gay marriage is becomes accepted by society &#8220;made legal&#8221;, then if a gay couple decides to become married, are churches then required to perform the ceremony? No, then why are churches even needed anymore to perform a marriage. Why even is marriage needed? As I look at this issue I see this more being about one section of society looking for acceptance, and the removal of the guilt they feel about their act than benefits. No one wants to feel guilt, why is there guilt at all. Mainly because an individual feels there is a higher being or higher thing that holds them responsible for what they do. If you remove this from the equation, by slowly tearing down a person&#8217;s religious beliefs, you lose the guilt. Eventually remove the religion from the equation. Take out &#8220;In God we Trust&#8221;, take out anything that would be implied as sinful so people don&#8217;t have to feel guilt. Ask yourself, if gay marriage is ok (even though biblically it isn&#8217;t), then why isn&#8217;t poligamy ok? I hear people say &#8220;Why that would be immoral!&#8221;. Who or what then defines morality? How can morality say one thing is ok and another wrong. Eventually morality doesn&#8217;t matter anymore to a society. Whether or not you or anyone else likes it, we currently have a majority of the population who believe in a higher being, and being a western society they base this belief on the bible. Whether you&#8217;re Jewish, Islam, or Christian, they all hold a belief in the Old Testament, which is what is basing the moral belief on marriage being between a man and woman. You cannot pick and chose morality from what a society is based on. All great civilizations eventually fall from within, and the commonality of it is when the people of a society no longer have a common belief system. Whether this is due to a conquering force integrating different cultures and nothing cohesive holds the society together, or a new and upcoming religion makes the existing system fall. This is where the country is headed the eventual of a belief system and subsequently the society itself.<\/p>\n","parent":0},{"id":3003,"name":"anon","url":"","date":"2004-02-27 11:54:38","content":"<p>&#8220;are churches then required to perform the ceremony? No, then why are churches even needed anymore to perform a marriage.&#8221;<\/p>\n<p>Churches are not currently required to perform marriage ceremonies.  That will not change if\/when having 2 grooms is legal.  <\/p>\n<p>&#8220;How can morality say one thing is ok and another wrong. &#8221;<\/p>\n<p>That is *all* morality does.<\/p>\n<p>As for the fall of our society, my direct ancestors fought each other in the American Revolutionary War and in the American Civil War.  They also fought against the fall of &#8220;their society&#8221; during the civil rights movement.  I have relatives that never got over the fact that blacks could now go to the same schools as white people.  Even drink from the same water fountain!<\/p>\n<p>Sometimes things need to change, fall, be replaced.<\/p>\n","parent":0},{"id":3004,"name":"Shannon J Hager","url":"http:\/\/hdconsultants.us","date":"2004-02-27 11:55:31","content":"<p>Beautiful post Harry.  Well said.<\/p>\n","parent":0},{"id":3005,"name":"Pablo F Matute","url":"","date":"2004-02-29 10:35:33","content":"<p>We all should support gay marriage. Very well said Harry!<\/p>\n","parent":0},{"id":3006,"name":"Me","url":"","date":"2004-03-01 06:11:48","content":"<p>Anon:<br \/>\nAgain and again I see the left trying to compare homosexuality to the plight of blacks over the years. A black man can&#8217;t hide the fact that he is black. Since when does a homosexual get labeled a homosexual just by looking at them? For anyone to even compare the two has no argument at all, there is no comparisen. Until the day that a gay person has to wear some badge designating them as so, don&#8217;t compare blacks and gays.<\/p>\n<p>If we were to follow your blacks and gays, and about churches not being required to marry gays. What do you think would happen to a church that refused to hire an individual or marry a person if they were black?<\/p>\n","parent":0},{"id":3007,"name":"anon","url":"","date":"2004-03-02 00:01:03","content":"<p>&#8220;Since when does a homosexual get labeled a homosexual just by looking at them?&#8221;<\/p>\n<p>I must assume that you don&#8217;t know many gay people.  Or that, if you do, you haven&#8217;t been around when they are yelled at.  I am not a homosexual but I have had many people label me as one just by looking at me.<\/p>\n<p>Don&#8217;t make the mistake of thinking that I am comparing blacks to gays.  I am comparing the close-minded ignorance of certain ranks of our society in various points thoughout our history.<\/p>\n","parent":0},{"id":3008,"name":"mnrp","url":"","date":"2004-03-04 05:13:55","content":"<p>The best suggestion I&#8217;ve seen lately is to make *all* marriages civil unions in the eyes of the state.  Let churches decide whom they would marry themselves.  In essence, remove the religious question from the legal definition all together.<\/p>\n","parent":0},{"id":3009,"name":"DevHawk","url":"","date":"2004-03-04 22:49:22","content":"<p>I&#8217;m with you mnrp, as long as the government uses the term &#8220;civil union&#8221; uniformily across the entire population. You can&#8217;t call it marriage for heterosexuals and civil unions for homosexuals. <\/p>\n","parent":0},{"id":3010,"name":"LCP","url":"http:\/\/www.GayMarriageNOW.net","date":"2005-03-23 13:54:03","content":"<p>Well said!  I personally, don’t understand why there is such controversy with this issue.  Gay marriage advocates only want the gay community to have equal, LEGAL protection.  Why is that so bad?  No one can give a good rational answer without getting into religion.  Doesn&#8217;t that tell us something?<\/p>\n<p>LCP<br \/>\n<a href=\"http:\/\/www.GayMarriageNOW.net\" rel=\"nofollow\">http:\/\/www.GayMarriageNOW.net<\/a><\/p>\n","parent":0}],"attachments":[],"comment_count":9,"comment_status":"closed","custom_fields":{"dasblog_entryid":["bb2c85ad-794b-46c9-b969-4891333c0702"],"dasblog_compressedtitle":["In+Support+Of+Gay+Marriage"],"dasblog_compressedtitleunique":["2004\/02\/27\/In+Support+Of+Gay+Marriage"]}},"previous_url":"http:\/\/devhawk.net\/2004\/02\/25\/government-online-international-network\/","next_url":"http:\/\/devhawk.net\/2004\/02\/29\/finished-kotor\/"}