{"status":"ok","post":{"id":1108,"type":"post","slug":"my-first-point-in-ten-years","url":"http:\/\/devhawk.net\/2008\/02\/22\/my-first-point-in-ten-years\/","status":"publish","title":"My First Point in Ten Years","title_plain":"My First Point in Ten Years","content":"<p>Not only does this month mark <a href=\"http:\/\/techiewife.spaces.live.com\/Blog\/cns!3DAECC033B88329C!2065.entry\">my son&#8217;s fifth birthday<\/a>, it also marks the ten anniversary of my first date with my <a href=\"http:\/\/techiewife.spaces.live.com\/default.aspx\">awesome wife Julianne<\/a>. I met her online while I was laid up at home for six weeks after breaking my ankle at hockey practice. You see, I&#8217;m not just a hockey fan, but I also played several years of amateur league hockey in the mid-90&#8242;s. I&#8217;m not very good, but I really love playing, though it all came to a halt when I broke my ankle.  <\/p>\n<p>Last night, for the first time literally in a decade (shit, I&#8217;m getting old), I hit the ice for a <a href=\"http:\/\/groups.msn.com\/TechRecHockeyLeague\/home.msnw\">local TechRec league game<\/a> (&#8220;Home of the Thundering Nerd Herd&#8221;). And when I say &#8220;hit the ice&#8221;, I mean that fairly literally. Man, it&#8217;s been a long time and I am WAY out of shape. I hurt pretty much all over, but especially my right shoulder.<\/p>\n<p>We only had ten skaters, which means only two lines total. I probably skated around 20 minutes total &#8211; I spent three minutes in the penalty box (grabbed an opposing player as I fell down) and skipped the single power play we had. I still felt like I was gonna die by the end of the game. Hopefully, after I get a few more games under my belt, I&#8217;ll be able to skate more than once up and down the ice without looking to the bench for a change. On the plus side, we won 6-2, I had an assist and was +1 on the night. <\/p>\n<p>The TechRec league is very different from the league I played in down in SoCal. In SoCal, I played on the same team with the same players against the same players on the same other teams season after season. Naturally, animosity developed. In TechRec, they re-pick the teams every season, so it seems much more friendly and less competitive. I mean, we still want to win, but it takes on a different feel when you know some other player you don&#8217;t like may be your teammate next season. <\/p>\n<p>Major thanks to my neighbor Stephen Bury for getting me back on the ice. I&#8217;m looking forward to <strike>smashing him into the boards<\/strike><strike>grabbing him when I fall down<\/strike> facing off against his team a couple of weeks.<\/p>\n","excerpt":"<p>Not only does this month mark my son&#8217;s fifth birthday, it also marks the ten anniversary of my first date with my awesome wife Julianne. I met her online while I was laid up at home for six weeks after breaking my ankle at hockey practice. You see, I&#8217;m not just a hockey fan, but [&hellip;]<\/p>\n","date":"2008-02-22 10:20:20","modified":"2011-04-17 16:01:03","categories":[{"id":352,"slug":"personal","title":"Personal","description":"","parent":0,"post_count":22}],"tags":[{"id":215,"slug":"hockey","title":"Hockey","description":"","post_count":34},{"id":242,"slug":"techrec-league","title":"TechRec League","description":"","post_count":1}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["75c52011-3dae-4d88-8235-3f2eec5cecbb"],"dasblog_compressedtitle":["My+First+Point+In+Ten+Years"],"dasblog_compressedtitleunique":["2008\/02\/22\/My+First+Point+In+Ten+Years"]}},"previous_url":"http:\/\/devhawk.net\/2008\/02\/20\/delivering-the-xna-vision\/","next_url":"http:\/\/devhawk.net\/2008\/02\/22\/morning-coffee-149\/"}