{"status":"ok","post":{"id":332,"type":"post","slug":"spinning-the-unthinkable","url":"http:\/\/devhawk.net\/2004\/03\/14\/spinning-the-unthinkable\/","status":"publish","title":"Spinning the Unthinkable","title_plain":"Spinning the Unthinkable","content":"<p>My parents (avid Caps fans and season ticket holders &#8211; at least for now) pointed me to the &#8220;<a href=\"http:\/\/www.washingtoncaps.com\/news\/index.cfm?cont_id=234670\">Owner&#8217;s Corner<\/a>&#8221; on the official Washington Capitals <a href=\"http:\/\/www.washingtoncaps.com\/\">homepage<\/a> where the owner attempts to explain without &#8220;spin&#8221; the moves that he has taken over the past month. It may not be obvious from my <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=2af18ecb-e381-4f5c-bb51-f469920019a5\">original post<\/a> on the subject, but I agree with most of his deals. Jagr wasn&#8217;t worth the money, Lang and Nylander were recent free agents and I hear Gonchar wanted to leave. Most of all, they just weren&#8217;t getting it done. I agree with Ted when he writes that he&#8217;s &#8220;not committed to &#8230; a $50-million payroll for a team that is last in its division.&#8221; Especially when the division in question is the worst in the league. Tampa Bay might be good, but the reason are in the race for the President&#8217;s Trophy is because they get to play the other four teams in this wretched division the most. (Of the six teams under .500 in the Eastern Conference, four are from the Southwest Conference. That&#8217;s every team except Tampa Bay)<\/p>\n<p>However, he glosses over so many ugly details but I can&#8217;t help but see spin. <\/p>\n<ul>\n<li>He refers to Kolzig, Halpern, Witt and Zubrus as &#8220;a strong core of veteran leaders&#8221;. However, Kolzig and Halpern sat out the last game before the trading deadline &#8211; a pretty sure sign they were being shopped around as trade bait. Zubrus has been injured off-and-on. So they are more like &#8220;a strong core of veteran players we couldn&#8217;t trade&#8221;.\n<\/li>\n<li>He explains that Konowalchuk was traded since he would have been an unrestricted free agent at the end of the year. That&#8217;s a great reason to trade a player &#8211; even the captain. I can see trading the captain as part of a fire sale at the end of a losing season. However, that&#8217;s not what happened to Kono &#8211; he was traded back in October when the season wasn&#8217;t even a month old. He wasn&#8217;t traded because he was going to be a free agent. I&#8217;m not sure why he was traded, but the rumor mill is that he and then-coach Cassidy didn&#8217;t get along. Which brings me to&#8230;\n<\/li>\n<li>How come there&#8217;s no mention of the utter failure the Bruce Cassidy head coaching experiment was? Cassidy lasted all of a year and a half &#8211; getting fired in December of this year. Word is the players didn&#8217;t like him (see bullet above). Leonsis has thrown his support behind now-head-coach Hanlon, but he did that before firing Ron Wilson a few years ago (Ron&#8217;s now leading the San Jose Sharks to the Pacific Division championship). In the end, all of this talent wasting comes down to be the coach&#8217;s fault &#8211; and the hiring of that coach is the GM and owner&#8217;s fault.\n<\/li>\n<li>Finally, he totally glosses over any explanation of the Bondra trade. For all the other traded players, he detailed the hot young prospects or high draft picks we got in return. For Bondra, he writes of &#8220;ensuring&#8221; Bondra was &#8220;comfortable&#8221; on a team with &#8220;a legitimate opportunity to win the Cup this year&#8221;. The truth is that Bondra was &#8220;comfortable&#8221; where he was and had no interest in leaving, even for a &#8220;legitimate opportunity to win the Cup this year&#8221;. Also, while Leonsis is technically correct when he writes that Bondra was in the last year of his contract, the fact is that Bondra&#8217;s contract had a team option for another year. Given that his contract wasn&#8217;t really ending and that Leonsis acknowledged that they didn&#8217;t save a significant amount by trading him (the Caps had paid 70% of his salary already), why would you trade &#8220;Mr. Capital&#8221;?\n<\/li>\n<li>Even if he couldn&#8217;t produce (which he could &#8211; he still leads the team in power play goals), Bondra was the perfect mentor for Alexander Semin. Semin is a gifted 19 year old Russian who the Caps picked up in last year&#8217;s draft. He&#8217;s a little undersized for the NHL at this point, but he sure can skate and shoot. He had a gorgeous rebound goal against Atlanta the other night. The announcer even said something to the effect of &#8220;I&#8217;ve called his name so much that I thought he&#8217;d had 10-15 minutes of ice time so far. Turns out he&#8217;s only had seven&#8221;. Semin&#8217;s story is very similar to Bondra&#8217;s, who came over from Slovakia as a 19 year old. Who better to learn about America and the NHL from than a five-time all-star who started out exactly like you did?<\/li>\n<\/ul>\n<p>Sorry Ted, we can all see you spin. The most depressing part of the Owner&#8217;s Corner for me is that you are still the owner and that doesn&#8217;t look like it&#8217;s changing anytime soon. <\/p>\n","excerpt":"<p>My parents (avid Caps fans and season ticket holders &#8211; at least for now) pointed me to the &#8220;Owner&#8217;s Corner&#8221; on the official Washington Capitals homepage where the owner attempts to explain without &#8220;spin&#8221; the moves that he has taken over the past month. It may not be obvious from my original post on the [&hellip;]<\/p>\n","date":"2004-03-14 22:09:27","modified":"2004-03-14 22:09:27","categories":[{"id":234,"slug":"sports","title":"Sports","description":"","parent":0,"post_count":50}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":3031,"name":"TJ","url":"","date":"2004-03-17 15:52:56","content":"<p>Ted sucks, nuff said.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["c130bf91-af43-4c93-8308-d45dc236dbc2"],"dasblog_compressedtitle":["Spinning+The+Unthinkable"],"dasblog_compressedtitleunique":["2004\/03\/15\/Spinning+The+Unthinkable"]}},"previous_url":"http:\/\/devhawk.net\/2004\/03\/11\/burning-desire\/","next_url":"http:\/\/devhawk.net\/2004\/03\/22\/custom-modeling-languages\/"}