{"status":"ok","post":{"id":414,"type":"post","slug":"done-in-australia","url":"http:\/\/devhawk.net\/2004\/08\/04\/done-in-australia\/","status":"publish","title":"Done in Australia","title_plain":"Done in Australia","content":"<p>My presentations are done. I have one more analyst meeting, and then I am officially on vacation down under for a week. I&#8217;m stoked (but don&#8217;t expect too much blog traffic around here).<\/p>\n<p>Doing both talks twice in the space of a week really helped improve my delivery. I still think the Data in SOA talk didn&#8217;t go quite as well as the Metropolis talk, but the gap narrowed this time. Also helped that they were on separate days this time. I got lots of great questions afterwards. A couple of gentlemen from the Australian government grabbed me for over an hour after my Metropolis talk yesterday &#8211; one from Dept of Defense, the other from Dept of Statistics. At the Federal Architect Forum earlier this year, I spent some time with an architect from the US DoD and I&#8217;m coming to the conclusion that compared to most government agencies, DoD seems to be ahead of the curve on architecture. Of course, when you measure failure in human life, it behooves you to stay ahead of the curve. We were discussing business process and the gentleman from Aus DoD pointed out that we &#8220;mangle business processes in order to fit them into technology implementations.&#8221; Very true. We even got into some social aspects. For example, the battlefield leaders of tomorrow are in their teens today, so they are looking at how teens communicate today. They want their battle systems of the future present information optimally for those future leaders. Each generation tends to communicate differently than previous generations. His 16 year old doesn&#8217;t read or write well, but he can IM chat 6 people, send phone text messages and talk on the phone all at the same time. How will future battle systems leverage that ability. Fascinating. <\/p>\n<p>We head back to Sydney tomorrow evening. This afternoon and tomorrow, we&#8217;re off to find a kangaroo petting zoo and take a tour of Canberra. There&#8217;s a <a href=\"http:\/\/www.rugby.com.au\/aus.rugby\/pages\/105\">big rugby match<\/a> on Saturday &#8211; the Qantas Wallabies vs. the New Zealand All Blacks competing for the <a href=\"http:\/\/www.rugby.com.au\/aus.rugby\/pages\/1285\/group\/9619\">Bledisloe Cup<\/a>. It&#8217;s sold out, but it will be on TV. There&#8217;s something about the passion of large scale sporting events like this. My parents and brother went to several matches of <a href=\"http:\/\/www.euro2004.com\/index.html\">Euro 04<\/a>, including the <a href=\"http:\/\/www.euro2004.com\/Tournament\/Matches\/Round=1582\/Match=1059188\/index.html\">England vs. Portugal game<\/a> that sent England home in penalty kicks. The parting after went on all night. World Cup 98 in France was the same way every time France won (though we had gone home by the final game that France won &#8211; I&#8217;ll bet that was quite the party). I know nothing about Rugby, but I&#8217;m keen to learn.<\/p>\n","excerpt":"<p>My presentations are done. I have one more analyst meeting, and then I am officially on vacation down under for a week. I&#8217;m stoked (but don&#8217;t expect too much blog traffic around here). Doing both talks twice in the space of a week really helped improve my delivery. I still think the Data in SOA [&hellip;]<\/p>\n","date":"2004-08-04 18:19:35","modified":"2004-08-04 18:19:35","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["38749d80-2660-43c0-8ef2-acf809a9b846"],"dasblog_compressedtitle":["Done+In+Australia"],"dasblog_compressedtitleunique":["2004\/08\/05\/Done+In+Australia"]}},"previous_url":"http:\/\/devhawk.net\/2004\/08\/03\/slight-nomad-issue-solved\/","next_url":"http:\/\/devhawk.net\/2004\/08\/04\/amazing-cheese\/"}