{"status":"ok","post":{"id":1137,"type":"post","slug":"wanna-work-on-ipy-vs","url":"http:\/\/devhawk.net\/2008\/04\/17\/wanna-work-on-ipy-vs\/","status":"publish","title":"Wanna Work on IPy + VS?","title_plain":"Wanna Work on IPy + VS?","content":"<p>We&#8217;ve hired a few people around here recently (including me obviously). However, if you have a burning desire to work on IronPython (or IronRuby) and Visual Studio, we&#8217;re <a href=\"http:\/\/members.microsoft.com\/careers\/search\/details.aspx?JobID=5CC7E752-B603-4E85-AE0D-8509EC6ECE70\">still hiring<\/a>:<\/p>\n<blockquote><p>An important aspect of developing these dynamic languages [aka IronPython and IronRuby] is providing support in the Visual Studio IDE. This includes editing features (color-coding of source code, intellisense, go-to-definition, refactoring, etc), debugging features (breakpoints, data tool tips, etc), ensuring a language-specific look-and-feel (interactive console, etc), and integration into the Visual Studio project system. It includes integration with the various designers like the WPF designer via CodeDOM, and development of project templates for various scenarios (Silverlight 2 app, WPF app, ASP.Net website, VSTT unit tests, etc). We also want to integrate with Visual Studio technologies like profiling and code coverage. Your job will be to ensure that developers using dynamic languages built on top of the Dynamic Language Runtime (DLR) have the best development environment in Visual Studio. <\/p>\n<p>We’re looking for a talented developer with exceptional programming ability and a passion for dynamic languages. Experience in these areas is a bonus though not strictly required: building developer tools like editors and debuggers, compiler implementation, reflection, dynamic languages, VM implementation, performance measurement and\/or optimization, C#. Applicants should have a BS\/MS in computer science or equivalent, and three or more years of industry experience.<\/p>\n<\/blockquote>\n","excerpt":"<p>We&#8217;ve hired a few people around here recently (including me obviously). However, if you have a burning desire to work on IronPython (or IronRuby) and Visual Studio, we&#8217;re still hiring: An important aspect of developing these dynamic languages [aka IronPython and IronRuby] is providing support in the Visual Studio IDE. This includes editing features (color-coding [&hellip;]<\/p>\n","date":"2008-04-17 15:52:41","modified":"2008-04-17 15:52:41","categories":[],"tags":[{"id":217,"slug":"dynamic-languages","title":"Dynamic Languages","description":"","post_count":12},{"id":250,"slug":"working-at-msft","title":"Working at MSFT","description":"","post_count":21}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["709f2c71-091b-425a-afe3-88c0f9093412"],"dasblog_compressedtitle":["Wanna+Work+On+IPy+VS"],"dasblog_compressedtitleunique":["2008\/04\/17\/Wanna+Work+On+IPy+VS"]}},"previous_url":"http:\/\/devhawk.net\/2008\/04\/14\/rents-rock-the-red\/","next_url":"http:\/\/devhawk.net\/2008\/04\/22\/morning-coffee-163\/"}