{"status":"ok","post":{"id":1064,"type":"post","slug":"studio-busting","url":"http:\/\/devhawk.net\/2007\/12\/03\/studio-busting\/","status":"publish","title":"Studio Busting","title_plain":"Studio Busting","content":"<p>A week ago, I <a href=\"http:\/\/devhawk.net\/2007\/11\/26\/Fans4Writers.aspx\" target=\"_blank\">wrote<\/a> that the ongoing writers strike might accelerate the transition to Media 2.0. Several other folks think the same way and explain why much better than I have. Marc Andreessen (aka <a href=\"http:\/\/en.wikipedia.org\/wiki\/Marc_Andreessen\" target=\"_blank\">creator of Mosaic<\/a>) has a <a href=\"http:\/\/blog.pmarca.com\/2007\/11\/rebuilding-holl.html\" target=\"_blank\">fantastic post<\/a> that not only explains this transition better than I can, it also helped me understand my views on unions in general.<\/p>\n<p>In the post, he describes two economic models &#8211; the Hollywood model and the Silicon Valley model. The Hollywood model is highly-centralized, with a small number of huge companies (aka &#8220;big media&#8221;) owning practically everything. In contrast, the Silicon Valley model is highly-decentralized, where pretty much anyone can create a company or bring a product to market. Marc believes that the entertainment industry at large is transitioning to the decentralized model. I agree 110% &#8211; the general decentralization trend is one I highlight in my &#8220;Moving Beyond Industrial Software&#8221; presentation that I&#8217;ve been delivering recently.<\/p>\n<p>Unions are a response to the dramatic power differential between an employer and individual employees. By pooling (aka centralizing) their bargaining power, the union provides a counter-balance to the power wielded by the employer(s). But in a decentralized model, unions aren&#8217;t really necessary. Marc describes the &#8220;alignment of interests between creators and financiers&#8221; as &#8220;near-perfect&#8221;. Near-perfect might be a bit on the rosy side, but it&#8217;s a model I&#8217;m much more comfortable with than mega-corporations &amp; unions. <\/p>\n<p>Some believe that the AMPTP (aka the studios) is trying to <a href=\"http:\/\/unitedhollywood.blogspot.com\/2007\/12\/amptp-union-busting-is-our-middle-name.html\" target=\"_blank\">break the entertainment unions<\/a>. But what if those unions decided to break the studios? I gotta think that while there are lots of quality writers out there, the best in the business are members of the writers guild. What if they just decided to stop writing for the studios and go into business for themselves? Patrick Goldstein of the LA Times <a href=\"http:\/\/www.latimes.com\/entertainment\/news\/movies\/la-et-gold20nov20,0,372891.story?coll=la-home-entertainment\" target=\"_blank\">wonders the exact same thing<\/a>. <\/p>\n","excerpt":"<p>A week ago, I wrote that the ongoing writers strike might accelerate the transition to Media 2.0. Several other folks think the same way and explain why much better than I have. Marc Andreessen (aka creator of Mosaic) has a fantastic post that not only explains this transition better than I can, it also helped [&hellip;]<\/p>\n","date":"2007-12-03 11:25:55","modified":"2007-12-03 11:25:55","categories":[],"tags":[{"id":196,"slug":"entertainment","title":"Entertainment","description":"","post_count":14},{"id":197,"slug":"media-2-0","title":"Media 2.0","description":"","post_count":6}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["054e8f9b-d398-4904-835e-b6586c8a087d"],"dasblog_compressedtitle":["Studio+Busting"],"dasblog_compressedtitleunique":["2007\/12\/03\/Studio+Busting"]}},"previous_url":"http:\/\/devhawk.net\/2007\/12\/03\/morning-coffee-127\/","next_url":"http:\/\/devhawk.net\/2007\/12\/04\/functional-understanding\/"}