{"status":"ok","post":{"id":45,"type":"post","slug":"quote-update","url":"http:\/\/devhawk.net\/2003\/03\/17\/quote-update\/","status":"publish","title":"Quote Update","title_plain":"Quote Update","content":"<p>I&#8217;ve had a chance to email back and forth with <a href=\"http:\/\/www.microsoft-watch.com\/author_bio\/0,4308,a=2274,00.asp\">Mary Jo Foley<\/a> regarding being quoted in <a href=\"http:\/\/www.microsoft-watch.com\/\"> Microsoft-Watch<\/a> newsletter. She sent me a copy of last week&#8217;s article where she links to Don&#8217;s opinion of InfoPath and directly quotes <a href=\"http:\/\/radio.weblogs.com\/0108971\/2003\/03\/06.html#a121\">Clemens<\/a>. So my comment about only quoting the guy with something negative to say was wrong, and thus I retract it and apologize. There was also some confusion regarding my opinion of InfoPath as a front-end blogging tool. I was <a href=\"PermaLink.aspx?guid=dfc79478-f78f-4c4c-b105-02efd3d5a058\">commenting<\/a> on InfoPath&#8217;s suitability (or lack thereof) as a general development tool, not as a weblog front end. I think that InfoPath would rock as a front-end blog tool &#8211; I&#8217;m just frustrated by the current lack of documentation. <\/p>\n<p>BTW, Scoble had this to say:<\/p>\n<blockquote><p>Ahh, Harry Pierson is quoted by Mary Jo Foley and asks what I think of all this. Definitely it&#8217;s the new world. I imagine there&#8217;ll be a day when I get quoted about something or another that NEC is doing. It sure would be nice, though, if journalists always include a link in their articles back to the source. That way we can always put it back in context for people who want more information. Main-stream press folks, though, rarely link to outside resources. Why is that? They don&#8217;t want their readers to leave. It&#8217;s yet another reminder, though, that what you say online is important and may be used against you at some time in a future. It&#8217;s a wacky new world, that&#8217;s for sure. Be careful out there. <br \/> [<a href=\"http:\/\/radio.weblogs.com\/0001011\/2003\/03\/17.html#a2523\">The Scobleizer Weblog<\/a>]<\/p>\n<\/blockquote>\n<p>I wanted to point out that while &#8220;main-stream press folks rarely link&#8221;, the same can&#8217;t be said of Mary Jo. The newsletter includes links to all of the relevant blog entries. They&#8217;re using a redirect server so the links in the newsletter are routed though them, but the user ends up on the blog entry in question. Also, Microsoft-Watch has an <a href=\"http:\/\/rssnewsapps.ziffdavis.com\/msw.xml\">RSS feed<\/a>, which I&#8217;ve now subscribed to. <\/p>\n<p>Robert, are you going to add &#8220;Let&#8217;s be careful out there&#8221; to your manifesto? I&#8217;ll hum the theme to Hill Street Blues&#8230;<\/p>\n","excerpt":"<p>I&#8217;ve had a chance to email back and forth with Mary Jo Foley regarding being quoted in Microsoft-Watch newsletter. She sent me a copy of last week&#8217;s article where she links to Don&#8217;s opinion of InfoPath and directly quotes Clemens. So my comment about only quoting the guy with something negative to say was wrong, [&hellip;]<\/p>\n","date":"2003-03-17 23:47:33","modified":"2003-03-17 23:47:33","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["5dbc986e-628a-4071-9bc5-b02e51497a1b"],"dasblog_compressedtitle":["Quote+Update"],"dasblog_compressedtitleunique":["2003\/03\/18\/Quote+Update"]}},"previous_url":"http:\/\/devhawk.net\/2003\/03\/16\/quoted-in-microsoft-watch\/","next_url":"http:\/\/devhawk.net\/2003\/03\/19\/feedster\/"}