[
  {
    "author-name": "Andreas &#214;hlund",
    "author-email": "andreas.ohlund@steria.se",
    "author-url": "http://andreasohlund.blogspot.com",
    "date": "2007-07-03T08:56:09-07:00",
    "content": "Hey you forgot to mention that the Capitals also signed Michael Nylander. With Nicklas Bäckström and Nylander on the team you can expect Capitals to win next years Stanley Cup for sure ;) Thx for a great blog, your dougnuts are great summaries of the blogosphere!\n\n/Andreas (obviously from Sweden)"
  },
  {
    "author-name": "DevHawk",
    "author-email": "devhawk@outlook.com",
    "author-url": "",
    "date": "2007-07-03T23:07:33-07:00",
    "content": "The Nylander deal wasn't done when I wrote this. In fact, the word was Nylander was going to the Oilers. Believe me, I'm happy he's a Cap!"
  },
  {
    "author-name": "John Gibson",
    "author-email": "john1000@hotmail.com",
    "author-url": "",
    "date": "2007-07-04T07:36:15-07:00",
    "content": "Wow....what a completely worthless post.\n\nPeople like you are what is wrong with this country. You are obviously very politically polarized. It's one thing to dislike Bush (you have plenty of reason!), but when you step forward and say the solace is the Democrats coming to power, then it's pretty clear that you are just another partisan who thinks their party can do no wrong and the opposing party can do no right.\n\nBut then to say that you have a hard time celebrating our country's independence...Geesh...Why? Just because it isn't your party's guy in the Oval House? So your love of your country is limited by the extent of your political party's power? Frightening. Very frightening.\n\nI love my country regardless who is in power. I vote my heart and speak my mind. This country isn't it's government. It's the people. Remember that from civics in grade school?\n\nUnsubscribed. Your blog isn't that interesting anyway and I can certainly do without people such as yourself.\n"
  },
  {
    "author-name": "Nick Malik",
    "author-email": "",
    "author-url": "http://blogs.msdn.com/nickmalik",
    "date": "2007-07-18T10:33:43-07:00",
    "content": "Hi Harry,\n\nSorry I was on vacation on Monday July 2nd, so if I was late for a meeting with you, it must have been because I forgot to tell you that my vacation had started.  \n\nTo be honest, at that time, I was cleaning out my garage.  ;-)\n\n--- Nick"
  }
]