{"status":"ok","post":{"id":307,"type":"post","slug":"pat-on-soa","url":"http:\/\/devhawk.net\/2004\/02\/09\/pat-on-soa\/","status":"publish","title":"Pat on SOA","title_plain":"Pat on SOA","content":"<p>I think it made the rounds in the blogsphere, but I&#8217;ll post it just the same: <a href=\"http:\/\/www.theserverside.net\/discussions\/thread.aspx\/thread.jsp?thread_id=23801\">Pat Helland&#8217;s TechTalk<\/a> on TheServerSide.NET was published late last week. You know it&#8217;s not your run-of-the mill interview when one of the questions is: &#8220;Why is Hooking Shit Together a more appropriate term?&#8221; and answers like &#8221; Sometimes I want to talk about cleavage a lot&#8221;. <\/p>\n<p>Seriously, one of the things I think was most important was Pat&#8217;s answer to the question on integration challenges:<\/p>\n<blockquote dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"><p>When you&#8217;ve had a couple apps that have been independently designed, they have different assumptions about the world. Different assumptions about inventory, different assumptions about customers; they probably don&#8217;t even have the same snail mail address format. It&#8217;s true that we can connect the bytes back and forth with IP and TCP today, but that doesn&#8217;t do me anymore good than if I can pick up the telephone and talk to China, and if I&#8217;m speaking only English, and they&#8217;re speaking only Mandarin, we still can&#8217;t communicate very effectively. I can hear some cool sounds, but it doesn&#8217;t help get work done. <\/p>\n<p>The same thing&#8217;s occurring when you bring applications together. The semantics of the interaction is a challenge. It&#8217;s very, very difficult across an enterprise to get a common understanding of what a customer is, is a great example. Because, this half has got these fields, and that half has got those fields, and maybe you can get some common fields of understanding, but there&#8217;s still all these differences that are in there. <\/p>\n<p>A huge advantage that we have is XML. XML and XML Schema have allowed for at least the expression of what the data formats look like, even though that hasn&#8217;t helped with all the semantics. But it&#8217;s a good start. We don&#8217;t have to worry about parsing, we don&#8217;t have to worry about a lot of those details. But we still have a huge road ahead of us in terms of rationalizing how we understand the data across differently and independently designed applications. <\/p>\n<\/blockquote>\n<p dir=\"ltr\">This leads back to the <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=d6be1655-f467-4718-9b80-ab1b311f2249\">SOA vs. SOP question<\/a>. Being able to send a message is one challenge. It&#8217;s an entirely different challege to get a consistent idea of &#8220;customer&#8221; or &#8220;order&#8221; across your enterprise systems. Both challenges are important but distinct and are important to different levels of architect. <\/p>\n<p dir=\"ltr\">I also thought his best practice comments were facinating:<\/p>\n<blockquote dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"><p dir=\"ltr\">I would argue that the biggest best practice is pragmatism. Don&#8217;t do anything unless it makes financial sense.<\/p>\n<p dir=\"ltr\">Service-oriented architectures allow you to make whatever business choice fits. Because it talks about these being independent things, that can then hook together with others, using messaging, and using the sequences of messages that flow. That then takes the decisions of about what you bulldoze and you don&#8217;t bulldoze and puts it back where it should be: in the pragmatic business guy&#8217;s hands. <\/p>\n<\/blockquote>\n<p dir=\"ltr\">This leans heavy to <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=1418b6c7-e148-4110-b6a2-a68af40b92b5\">towards Realist<\/a>, but that doesn&#8217;t make it any less true. <\/p>\n","excerpt":"<p>I think it made the rounds in the blogsphere, but I&#8217;ll post it just the same: Pat Helland&#8217;s TechTalk on TheServerSide.NET was published late last week. You know it&#8217;s not your run-of-the mill interview when one of the questions is: &#8220;Why is Hooking Shit Together a more appropriate term?&#8221; and answers like &#8221; Sometimes I want to [&hellip;]<\/p>\n","date":"2004-02-09 17:26:26","modified":"2004-02-09 17:26:26","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["6668b48c-b34f-4c7b-baa7-b01317e6e722"],"dasblog_compressedtitle":["Pat+On+SOA"],"dasblog_compressedtitleunique":["2004\/02\/10\/Pat+On+SOA"]}},"previous_url":"http:\/\/devhawk.net\/2004\/02\/09\/architect-behavior-patterns\/","next_url":"http:\/\/devhawk.net\/2004\/02\/10\/hacking-infopath\/"}