{"status":"ok","post":{"id":315,"type":"post","slug":"doing-the-unthinkable","url":"http:\/\/devhawk.net\/2004\/02\/19\/doing-the-unthinkable\/","status":"publish","title":"Doing the Unthinkable","title_plain":"Doing the Unthinkable","content":"<p>(Note &#8211; As usual, my normal <a href=\"http:\/\/devhawk.net\/default.aspx#disclaimer\">disclaimer<\/a> applies. However, let me add to that by saying: in this post, any negative comments regarding AOL executives has nothing to do with the competitive relationship between my employer (Microsoft) and AOL. For the purposes of this post, I&#8217;m a sports fan, not a b0rg. We will return to our regularly scheduled technical blogging shortly.) <\/p>\n<p>Ted Leonsis is an abomination to the sport of hockey. He has transformed a Washington Capitals team that had gone to the Stanley Cup finals the year before he bought them into little more than a minor league hockey team unable to escape the basement in the standings. And to top it off, he has somehow managed to alienate the fans and lose $30 million dollars a year doing it.<\/p>\n<p>His <a href=\"http:\/\/www.corp.aol.com\/whoweare\/leonsis.html\">AOL bio<\/a> claims that Leonsis &#8220;has employed state-of-the-art consumer and interactive initiatives to dramatically boost the Capitals&#8217; attendance and revenue.&#8221; Really? Then why is he losing $30 million a year? Note to Ted: the best way to dramatically boost attendance is to actually field a competitive team. <\/p>\n<p>His <a href=\"http:\/\/www.washingtoncaps.com\/team\/index.cfm?cont_id=89499\">WashingtonCaps.com bio<\/a> claims that Leonsis is &#8220;[k]nown for his fan-friendly approach as an owner&#8221;. At least, he was until he got into a <strike>fight<\/strike><a href=\"http:\/\/www.washingtonpost.com\/ac2\/wp-dyn\/A50620-2004Jan26\">physical altercation<\/a> with a fan who had the nerve to criticize Leonsis in the wake of the Jagr trade. Note to Ted: don&#8217;t include fisticuffs with fans who actually paid to come see your team in your &#8220;List of 125 Ways We Are New and Improved&#8221;.<\/p>\n<p>And now, he has traded Peter Bondra for a <strike>bag of old pucks<\/strike> minor leaguer and a draft pick. In the world of sports, trades aren&#8217;t usually a big deal. But this is not a normal trade. Bondra was &#8220;Mr. Capital&#8221;, having spent his entire 14 year career with the Caps. He is the Caps all-time leading scorer. He was on the verge of having played more games for the Caps than anyone in their history. And even though the team was in the cellar, he wanted to stay and help them rebuild. When he was talking to the press, <a href=\"http:\/\/www.washingtonpost.com\/wp-dyn\/articles\/A51172-2004Feb18.html\">he cried<\/a>. In this age of multi-million dollar athlete salaries with the rampant &#8220;me first&#8221; attitude, a five-time all-star cried because he wanted to stay with the team he loved rather than be traded to a legitimate Stanley Cup contender. Yet Leonsis even tried to spin this: &#8220;allowing [Bondra] the opportunity to win a Cup is important.&#8221; Of course, it&#8217;s important, but having a player who loves where he plays and fans that love him right back is much more important.<\/p>\n<p>Of course, if Bondra is expendable, then so is anyone else with any talent whatsoever. Only Kolzig, Gonchar and Witt remain from the &#8217;98 Stanley Cup Finals team. How long until they are <strike>dumped to reduce salary<\/strike> allowed the opportunity to win a Cup with some other team? (rumor mill has it Gonchar is next on the trade block, going to the Devils)  <\/p>\n<p>Suddenly, I am looking forward to an extended lockout in the wake of the <a href=\"http:\/\/sports.espn.go.com\/nhl\/feature\/story?page=nhlcba\">expiring Collective Bargaining Agreement<\/a>. Watching the pitiful product Leonsis has foisted on Washington area hockey fans is a disgrace.<\/p>\n<p>Since all my favorite players are on one way tickets out of town, I actually hope that the Capitals continue to suck until Leonsis has lost so much money that he has no choice but to sell the team. <\/p>\n","excerpt":"<p>(Note &#8211; As usual, my normal disclaimer applies. However, let me add to that by saying: in this post, any negative comments regarding AOL executives has nothing to do with the competitive relationship between my employer (Microsoft) and AOL. For the purposes of this post, I&#8217;m a sports fan, not a b0rg. We will return [&hellip;]<\/p>\n","date":"2004-02-19 00:18:50","modified":"2004-02-19 00:18:50","categories":[{"id":234,"slug":"sports","title":"Sports","description":"","parent":0,"post_count":50}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2997,"name":"Erik","url":"http:\/\/ehummel.net","date":"2004-02-19 04:49:28","content":"<p>I live in Baltimore and I had almost exactly the same thoughts about Bondra&#8230; the Caps owner is someone who shows everything that is wrong with owners in hockey currently, ALL ROLLED INTO ONE. If it was just the owners with problems, then maybe hockey could survive, but there are becoming more and more players with that &#8220;me first&#8221; attitude that every NBA player has and that is where they bump heads leading to this lockout. Hopefully after 6 months of no one making money, both sides will begin to change their way, but doubtful.<\/p>\n","parent":0},{"id":2998,"name":"Carol Pierson","url":"","date":"2004-02-19 08:48:47","content":"<p>Only an owner that is both financially and morally bankrupt could have traded Peter Bondra against his will!  Ted Leonsis is indeed financially and morally bankrupt!<\/p>\n","parent":0},{"id":2999,"name":"JohnE","url":"http:\/\/blogs.msdn.com\/jevdemon","date":"2004-06-11 15:33:37","content":"<p>Thanks for the links to the Leonsis &#8220;incident&#8221;.  I only wish I attended that game so could have seen the sign that goaded Ted into taking action: <\/p>\n<p>      &#8220;Caps Hockey; AOL Stock &#8212; See a Pattern?&#8221;<\/p>\n<p>Priceless.<\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["2af18ecb-e381-4f5c-bb51-f469920019a5"],"dasblog_compressedtitle":["Doing+The+Unthinkable"],"dasblog_compressedtitleunique":["2004\/02\/19\/Doing+The+Unthinkable"]}},"previous_url":"http:\/\/devhawk.net\/2004\/02\/16\/service-oriented-language\/","next_url":"http:\/\/devhawk.net\/2004\/02\/19\/the-architecture-strategy-series\/"}