{"status":"ok","post":{"id":166,"type":"post","slug":"reflections-on-a-bad-presentation","url":"http:\/\/devhawk.net\/2003\/08\/07\/reflections-on-a-bad-presentation\/","status":"publish","title":"Reflections on a Bad Presentation","title_plain":"Reflections on a Bad Presentation","content":"<p>Last week I did a presentation at the Executive Briefing Center. This is not unusual, I&#8217;ve done lots of CxO briefings in the past with typically high to very high scores (7-9 out of 9). However, this time, while I had some decent scores, I also had some awful ones (more than half under 5 including a 1 and a 2. Ouch!) and was the worst scored presenter of the session. While it would be easy to chalk it up to &#8220;you win some, you lose some&#8221; or to blame the customer (i.e. &#8220;they weren&#8217;t technical enough&#8221;) that&#8217;s not going to help me do better next time. I&#8217;ve given it a bunch of thought, and there are two key things I&#8217;ve learned from this experience.<\/p>\n<p>The first thing is that I wasn&#8217;t <i>utterly<\/i> prepared. This is <a href=\"http:\/\/radio.weblogs.com\/0106747\/stories\/2003\/01\/22\/scottHanselmansTipsForASuccessfulMsftPresentation.html\"> Scott Hanselman&#8217;s 2nd tip<\/a> and I blew it. I used to deliver the &#8220;.NET Vision&#8221; <a href=\"presentations.aspx\">presentation<\/a> three or four times a week. Doing that for a year is the definition of <i>utterly<\/i> prepared. However, in the past year, I&#8217;ve changed roles. I&#8217;m an architect evangelist now, and we have a dedicated role on the team &#8211; called the .NET Advisor &#8211; who is focused on delivering the high level vision of .NET and web services. I have an old friend who used to say &#8220;use it or lose it&#8221;. He was talking about programming skills, but the same goes for presentation skills. My ability to deliver the high-level .NET &amp; web services vision has waned from lack of use. This wouldn&#8217;t be a huge problem, except that I didn&#8217;t realize it. I chose to white board the session, in order to be more flexible. But since I was out of practice on the material, I ended up being inflexible and doing a poor job delivering the message. <\/p>\n<p>(BTW, speaking of .NET advisors, we have an <a href=\"http:\/\/www.microsoft.com\/careers\/search\/details.aspx?JobID=9dfbb093-40bd-4851-a65f-40149c2a2b75\"> opening<\/a> on our team for one in Charlotte, NC. <a href=\"http:\/\/www.microsoft.com\/careers\/resume\/\">Submit your resume<\/a> if you fit the bill.)<\/p>\n<p>While I understand what to do about preparation (i.e. do more), I&#8217;m sort of stumped on my other key learning. We had the customer present first, to tell us about their organization. Among other things, they told us their list of IT priorities. It looked something like this:<\/p>\n<ul>\n<li>Webify legacy applications<\/li>\n<li>&#8230;a bunch of other stuff&#8230;<\/li>\n<li>Build web services<\/li>\n<\/ul>\n<p>I imagine this priority list is pretty typical. However, it&#8217;s upside down. Building web services in front of legacy applications needs to be more important that webifying them. The IT world is getting faster and more complex by orders of magnitude. This requires a new way of thinking about how you put systems together &#8211; i.e. Service Oriented Architecture (SOA). Webifying old applications is lipstick on a pig. <\/p>\n<p>But how do you tell the customer they are wrong without being arrogant? I mean, webifying legacy apps was their #1 priority and I told them it should be struck from the list! Conventional wisdom for sales people is that the &#8220;customer is always right&#8221;, but I&#8217;m an engineer at heart where right and wrong usually can be technically quantified. Adopting SOA is, IMHO, a critical factor in the continued long-term success of any organization today. In many ways, it is even more important than choice of platform (though I remain confident that a customer who adopts in SOA is more likely to choose the Windows \/ .NET platform). <\/p>\n<p>I meant to challenge the customer&#8217;s assumptions. Instead I proceeded to alienate at least half of them. While it is tempting to blame them for being closed minded, the truth is I could have challenged them in a way that didn&#8217;t alienate them. The problem is, I don&#8217;t know what that way is.<\/p>\n","excerpt":"<p>Last week I did a presentation at the Executive Briefing Center. This is not unusual, I&#8217;ve done lots of CxO briefings in the past with typically high to very high scores (7-9 out of 9). However, this time, while I had some decent scores, I also had some awful ones (more than half under 5 [&hellip;]<\/p>\n","date":"2003-08-07 15:59:28","modified":"2003-08-07 15:59:28","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["2d6dd832-dcff-4a3e-903e-3786fe179552"],"dasblog_compressedtitle":["Reflections+On+A+Bad+Presentation"],"dasblog_compressedtitleunique":["2003\/08\/07\/Reflections+On+A+Bad+Presentation"]}},"previous_url":"http:\/\/devhawk.net\/2003\/08\/05\/pulling-out-the-petzold-to-use-the-p2p-sdk\/","next_url":"http:\/\/devhawk.net\/2003\/08\/07\/storytelling\/"}