[
  {
    "id": 2328,
    "author-name": "Brian",
    "author-email": "",
    "author-url": "",
    "date": "2006-03-30T20:30:59-08:00",
    "content": "Casting Words adds no value whatsoever if you happen to be a software developer who values their time at zero. For everyone else, it's a pretty good deal.\n\n42c per minute is so cheap for almost any customer that there's really no point in undercutting it.\n\nMechanical Turk isn't accessible for the general public to request tasks, even with Hit Builder. There is a complex process of signing up for a developer's key, prepaying into the MTurk account, constructing a HIT that complies with the TOS, etc.\n\nThen when your HIT is built, you're throwing the job out there to an arbitrary bunch of people that might do a good job of transcription, but might not. So you'd have to do quality control yourself and either correct errors or resubmit another HIT to have the job redone (at extra cost).\n\nCasting Words works like an agency: they put in the effort and take the risk to run some kind of system that gives work to people and guarantees quality to the end customer. \n\nThey create a customer-friendly interface on top of MTurk and PayPal.\n\nThey return the transcriptions in various useful formats.\n\nThat has value, and that's what they're charging for.\n\nTo do this, they take various risks and have various overheads and expenses.\n\nThis is frankly a classic business mistake: accounting for the direct costs of a service but not the startup costs, the overheads and the risk. The true margin on this service is much smaller than you realise. (I don't know exactly because it's not my service, but I can estimate.)\n\nIf you're still not sure, go the empirical method and try it. Submit a podcast for transcription through Casting Words, then the same one \"directly\" via MTurk. Value your time at a reasonable rate and see which comes out ahead.\n\nCasting Words could definitely be improved and competed against, but probably not on price.\n\nNow, does MTurk have a business model? Sure. Provide something of value and then charge for it. Sounds good to me. While it's very early days for this kind of service, being the middleman between a huge potential pool of work and a huge potential pool of workers has significant scope for profitability.\n\nWhen it takes off, as I'm sure it will, there will be competition. Being first to market doesn't necessarily confer a long-term advantage. While the concept is a simple one, the details of the implementation are complex. This means that there is scope for meaningful differentiation. I predict that Amazon and a few competitors in this market will be able to resist commodification and a race to the bottom and operate profitably.\n\nThere is a huge disincentive for companies trying to put work through a system like this to keep switching between services or use several simultaneously. It's a lot of hassle and the market prices will be constantly volatile.\n\nCompetition isn't the enemy, commodification is. I can see no natural monopoly in this kind of business. But I do see massive economies of scale, so the market will support several large players, but not just one, or none.\n\n",
    "parent-id": 711,
    "RowKey": "20060330-203059"
  }
]