{"status":"ok","post":{"id":964,"type":"post","slug":"rest-is-neither-crud-nor-crap","url":"http:\/\/devhawk.net\/2007\/05\/24\/rest-is-neither-crud-nor-crap\/","status":"publish","title":"REST is neither CRUD nor CRAP","title_plain":"REST is neither CRUD nor CRAP","content":"<p>In the wake of <a href=\"http:\/\/devhawk.net\/2007\/05\/16\/Morning+Coffee+78.aspx\">my praise for CRUD is CRAP<\/a>, <a href=\"http:\/\/www.from9till2.com\/\">David Ing<\/a><a href=\"http:\/\/devhawk.net\/CommentView,guid,81028fac-5cb1-4ce3-8e71-9d29ec3ce882.aspx#commentstart\">asked<\/a> “how do you reconcile something like REST (astoria etc) with being CRUD-adverse? Is there a happy place where the two can go for coffee?” Sure there is: I hear <a href=\"http:\/\/pluralsight.com\/blogs\/tewald\/\">Tim Ewald’s XML Nation<\/a> serves great coffee and the scones are pretty good. (*)\n<\/p>\n<p>Seriously, the key observation that Tim <a href=\"http:\/\/pluralsight.com\/blogs\/tewald\/archive\/2007\/04\/26\/46984.aspx\">recently made<\/a> is that REST != CRUD. Sure, it can be <a href=\"http:\/\/en.wikipedia.org\/wiki\/Atom_Publishing_Protocol\">used that way<\/a> and for simple scenarios it works fine. (I’ll define “simple scenarios” in a second.) But I don’t believe CRUD style REST works in the large. Tim said you can’t build with just CRUD because it’s “to simplistic to be useful”. I’ll go even more fundamental, using REST for CRUD means having giving up transactions entirely. I&#8217;ve already accepted that building loosely coupled services means giving up <em>distributed <\/em>transactions. But the idea of giving up transactions entirely is just crazy talk.\n<\/p>\n<p>So when I said &#8220;simple scenarios&#8221; above, I meant &#8220;scenarios that don&#8217;t need transactions&#8221;. (I take it as a given that RESTifarians aren&#8217;t hot for WS-AtomicTransaction.) ATOM Publishing is a simple scenario because the web resource authoring scenario doesn’t need transactions to protect updates to multiple resources at a time. If it did, I don&#8217;t believe the REST as CRUD approach they use would work.\n<\/p>\n<p>As you might guess then, I’m not a fan of <a href=\"http:\/\/astoria.mslivelabs.com\/\">Astoria<\/a>. I believe the sweet spot for so called “data services” will be read only (because they don&#8217;t need transactions, natch). I&#8217;m sure there are some read\/write scenarios Astoria will be useful for, but I think they will be limited &#8211; at least within the enterprise.\n<\/p>\n<p>If REST != CRUD, then what is it? Let&#8217;s go back to <a href=\"http:\/\/pluralsight.com\/blogs\/tewald\/archive\/2007\/04\/26\/46984.aspx\">Tim&#8217;s post<\/a>:\n<\/p>\n<blockquote><p>Every communication protocol has a state machine. For some protocols they are very simple, for others they are more complex. When you implement a protocol via RPC, you build methods that modify the state of the communication. That state is maintained as a black box at the endpoint. Because the protocol state is hidden, it is easy to get things wrong. For instance, you might call Process before calling Init. People have been looking for ways to avoid these problems by annotating interface type information for a long time, but I&#8217;m not aware of any mainstream solutions. The fact that the state of the protocol is encapsulated behind method invocations that modify that state in non-obvious ways also makes versioning interesting.\n<\/p>\n<p>The essence of REST is to make the states of the protocol explicit and addressable by URIs. The current state of the protocol state machine is represented by the URI you just operated on and the state representation you retrieved. You change state by operating on the URI of the state you&#8217;re moving to, making that your new state. A state&#8217;s representation includes the links (arcs in the graph) to the other states that you can move to from the current state. This is exactly how browser based apps work, and there is no reason that your app&#8217;s protocol can&#8217;t work that way too. (The <a href=\"http:\/\/www.ietf.org\/internet-drafts\/draft-ietf-atompub-protocol-14.txt\">ATOM Publishing protocol<\/a> is the canonical example, though its easy to think that its about entities, not a state machine.)<\/p>\n<\/blockquote>\n<p>While I disagree with Tim&#8217;s disagreement of ATOM (i.e. I believe APP <em>is<\/em> about entities, but it works because it doesn&#8217;t need transactions), I agree 100% that REST is about <u>protocol state<\/u>. Tim lays this very clear in his <a href=\"http:\/\/pluralsight.com\/blogs\/tewald\/archive\/2007\/04\/27\/47031.aspx\">airline reservation sample<\/a>. Thus, I can spurn CRUD and still embrace REST if I want to.\n<\/p>\n<p>Further, Tim&#8217;s points on the opaque nature of RPC style interactions (which web services appear to have fallen into despite the best of intentions) are spot on. If you&#8217;re doing simple request\/response services, the protocol state is trivial, so that works fine. However, in the scenarios I face, long running services are the norm and managing the protocol state is critical. I&#8217;ve got some ideas on how to do that, but that&#8217;s a future blog post.\n<\/p>\n<hr \/>\n<p>(*) Actually, I have no idea if Tim even likes coffee or scones. FYI, DevHawk Nation would not feature great coffee or pretty good scones. We would, however, have <a href=\"http:\/\/www.arrogantbastard.com\/index2.html\">Arrogant Bastard Ale<\/a> on tap. <\/p>\n","excerpt":"<p>In the wake of my praise for CRUD is CRAP, David Ingasked “how do you reconcile something like REST (astoria etc) with being CRUD-adverse? Is there a happy place where the two can go for coffee?” Sure there is: I hear Tim Ewald’s XML Nation serves great coffee and the scones are pretty good. (*) [&hellip;]<\/p>\n","date":"2007-05-24 11:09:32","modified":"2007-05-24 11:09:32","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":181,"slug":"rest","title":"REST","description":"","post_count":18},{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94},{"id":290,"slug":"web-services","title":"Web Services","description":"","post_count":12}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2507,"name":"Andres Aguiar","url":"http:\/\/weblogs.asp.net\/aaguiar","date":"2007-05-24 18:58:05","content":"<p>There are simple scenarios with transactions that can be supported with REST.<\/p>\n<p>For example, Astoria has a client side component that track changes in entities and sends them to the server. Those can be applied in a transaction (even if today implementation does not). So you could retrieve an order, delete a line, add another, change the header and invoke the service.<\/p>\n","parent":0},{"id":2508,"name":"David Ing","url":"http:\/\/www.from9till2.com","date":"2007-05-25 05:30:26","content":"<p>Hi Harry, I didn&#8217;t really respond here: <a href=\"http:\/\/www.from9till2.com\/PermaLink.aspx?guid=2dbee669-07fd-435e-a5f9-51f709ef183f\" rel=\"nofollow\">http:\/\/www.from9till2.com\/PermaLink.aspx?guid=2dbee669-07fd-435e-a5f9-51f709ef183f<\/a><\/p>\n<p>- David<\/p>\n","parent":0},{"id":2509,"name":"DevHawk","url":"","date":"2007-05-25 14:53:19","content":"<p>Anders, I never said REST can&#8217;t support transactions, I said REST as CRUD can&#8217;t support transactions. I would say that your scenario of submitting a collection of changes to be applied transactionally moves you out of REST as CRUD and into REST as Protocol. <\/p>\n","parent":0},{"id":2510,"name":"Alex James","url":"http:\/\/www.base4.net\/blog.aspx?ID=436","date":"2007-05-30 22:16:32","content":"<p>&#8230;To my way of thinking programming RESTfully is all about intent.<\/p>\n<p>A common catch cry of the anti-REST crowd or the grudging REST adopters is that it is not appropriate for Update. Essentially according to their arguments transactions are a nightmare&#8230;<\/p>\n","parent":0}],"attachments":[],"comment_count":4,"comment_status":"closed","custom_fields":{"dasblog_entryid":["8db9fdf7-636d-4bf0-bac0-c47cbe10664c"],"dasblog_compressedtitle":["REST+Is+Neither+CRUD+Nor+CRAP"],"dasblog_compressedtitleunique":["2007\/05\/24\/REST+Is+Neither+CRUD+Nor+CRAP"]}},"previous_url":"http:\/\/devhawk.net\/2007\/05\/23\/morning-coffee-82\/","next_url":"http:\/\/devhawk.net\/2007\/05\/24\/happy-birthday-dad\/"}