{"status":"ok","post":{"id":1283,"type":"post","slug":"codeplex-editor-role","url":"http:\/\/devhawk.net\/2009\/08\/16\/codeplex-editor-role\/","status":"publish","title":"CodePlex Editor Role","title_plain":"CodePlex Editor Role","content":"<p>Ask <a href=\"http:\/\/blogs.msdn.com\/SaraFord\/\">Sara<\/a>, I have been bugging her for a LONG time for <a href=\"http:\/\/blogs.msdn.com\/codeplex\/archive\/2009\/08\/14\/donate-ad-revenue-to-charity-and-new-editor-role.aspx\">this CodePlex feature<\/a>. Actually, my team has been bugging her team for longer than either of us have been in these jobs.<\/p>\n<p>Last week’s CodePlex release includes a feature known as “Editor Role”. If you look at the <a href=\"http:\/\/ironpython.codeplex.com\/People\/ProjectRoles.aspx\">Project Role Matrix<\/a>, you’ll notice two primary differences from what the standard logged-in user can do: they can create\/edit wiki pages and they <em>can’t <\/em>rate releases. Developers and Coordinators can’t rate releases either – I guess the idea is that they don’t want members of the team rating their own releases (5 Stars! Again! Wow, we’re awesome!).<\/p>\n<p>Until now, the only way to give members of the community the ability to edit the wiki also gave permission to edit work items, check in source code and make releases. We’re still working on getting Microsoft at large to understand the <a href=\"http:\/\/devhawk.net\/2009\/06\/03\/Strengthening+The+Microsoft+Ecosystem+With+Source+Code.aspx\">benefits of community collaboration aspect in open source<\/a>, but in the meantime we just can’t give those permissions to people off the team. However, we would love to have contributions to our documentation wiki. [1] With the new Editor Role, we’ll be able to grant wiki editor access without any of the other permissions.<\/p>\n<p>Of course, the whole idea of “wiki permissions” kinda flies in the face of the basic <a href=\"http:\/\/c2.com\/cgi\/wiki?WikiDesignPrinciples\">wiki design principles<\/a>. So we’re going to be pretty liberal about handing out editor permissions. If you’re interested in editing the wiki, <a href=\"mailto:harry.pierson@microsoft.com?subject=IronPython Wiki Editor Role\">drop me a line<\/a> and I’ll get you hooked up.  <\/p>\n<p>Big mega-thanks to the CodePlex team for making this feature happen. I guess I’ll have to find something new to bug Sara about!<\/p>\n<p>[1] You can tell we’re a real open source project because we’re begging for documentation help! <\/p>\n","excerpt":"<p>Ask Sara, I have been bugging her for a LONG time for this CodePlex feature. Actually, my team has been bugging her team for longer than either of us have been in these jobs. Last week’s CodePlex release includes a feature known as “Editor Role”. If you look at the Project Role Matrix, you’ll notice [&hellip;]<\/p>\n","date":"2009-08-16 08:17:05","modified":"2009-08-16 08:17:05","categories":[{"id":252,"slug":"ironpython","title":"IronPython","description":"","parent":0,"post_count":99}],"tags":[{"id":287,"slug":"codeplex","title":"CodePlex","description":"","post_count":1},{"id":247,"slug":"open-source","title":"Open Source","description":"","post_count":8}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["8abb1cb3-64ad-4d3d-b12b-a453a4ef5c1a"],"dasblog_compressedtitle":["CodePlex+Editor+Role"],"dasblog_compressedtitleunique":["2009\/08\/16\/CodePlex+Editor+Role"]}},"previous_url":"http:\/\/devhawk.net\/2009\/08\/13\/2009-space-elevator-conference\/","next_url":"http:\/\/devhawk.net\/2009\/08\/20\/hawkcodebox\/"}