{"status":"ok","post":{"id":500,"type":"post","slug":"spelunking-service-broker-dialogs","url":"http:\/\/devhawk.net\/2004\/12\/13\/spelunking-service-broker-dialogs\/","status":"publish","title":"Spelunking Service Broker &#8211; Dialogs","title_plain":"Spelunking Service Broker &#8211; Dialogs","content":"<p>The simplest way to describe SQL Service Broker is &#8220;message queues in the database.&#8221; If the queues are tables in the database then you can do your entire message processing using a local transaction. If you use a separate queuing technology like MSMQ, you can still pull items off the queue, update data in the database and send out messages in the scope of a transaction – it just has to be a distributed transaction. Being able to use a local tx gives us a big performance gain. But, while important, this perf gain isn’t the most compelling reason to use SSB. It turns out that SSB provides important semantic messaging benefits in addition to perf benefits. <\/p>\n<p>If you study at the semantic messaging model defined by message queuing systems such as MSMQ, MQ Series and <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/dnglobspec\/html\/ws-reliablemessaging.asp\">WS-RM<\/a> you’ll notice that it is inherently one way. Section 2 of the WS-RM spec defines the reliable messaging model to be between a source sending the messages and a destination receiving them. The problem with this model is that as message patterns between services gets richer, we’re going to want bi-directional reliable messaging. SSB calls this a dialog.<\/p>\n<p>Before you can send messages between services in SSB (assuming everything&#8217;s been configured), you first have to BEGIN DIALOG and provide the initiating and target service, plus the message contract (more on that in a later post). Note that it&#8217;s called initiator and target, not sender and receiver. Either side of the dialog can send messages to the other as part of the contract by using SEND ON CONVERSATION &#8211; the only requirement is that the initiator sends the first message (hence the name &#8220;initiator&#8221;). All messages are guaranteed to be delivered exactly once and in order, or both sides of the conversation are notified of the failure and the dialog is torn down. I&#8217;m not sure if it guarantees in-order delivery of messages in opposite directions. There are cases where this might be important &#8211; I send an order cancellation as I send you a shipping notification &#8211; but typically there&#8217;s a business reason for who &#8220;wins&#8221; such a conflict. In this shipping\/cancellation example, even if you sent me the cancellation before I sent shipment notification, it&#8217;s not like I can recall the shipment.<\/p>\n<p>My only issue with this bi-directional reliable messaging is that I&#8217;m so used to thinking in terms of one-way RM that it&#8217;s taking me a while to wrap my head around it. Many of the sample interactions I come up with are simple patterns where the target simply acknowledges the incoming message. Order processing is a good example where I may get meaningful messages (i.e. not simple acks) coming from both ends. What are some others?<\/p>\n","excerpt":"<p>The simplest way to describe SQL Service Broker is &#8220;message queues in the database.&#8221; If the queues are tables in the database then you can do your entire message processing using a local transaction. If you use a separate queuing technology like MSMQ, you can still pull items off the queue, update data in the [&hellip;]<\/p>\n","date":"2004-12-13 22:04:57","modified":"2004-12-13 22:04:57","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2747,"name":"武侠小说","url":"http:\/\/www.readnovel.com\/ch\/3.html","date":"2004-12-14 20:32:41","content":"<p>I don’t now what you had said, though I want to help you. I am sorry.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["0270eee1-d2f3-4ffd-86fa-03716654d00c"],"dasblog_compressedtitle":["Spelunking+Service+Broker+Dialogs"],"dasblog_compressedtitleunique":["2004\/12\/14\/Spelunking+Service+Broker+Dialogs"]}},"previous_url":"http:\/\/devhawk.net\/2004\/12\/13\/msn-toolbar-with-desktop-search\/","next_url":"http:\/\/devhawk.net\/2004\/12\/15\/msdn2s-hackable-urls-msn-toolbar\/"}