{"status":"ok","post":{"id":943,"type":"post","slug":"enterprise-service-bus-give-me-an-extra-special-bitter-instead","url":"http:\/\/devhawk.net\/2007\/04\/25\/enterprise-service-bus-give-me-an-extra-special-bitter-instead\/","status":"publish","title":"Enterprise Service Bus? Give Me an Extra Special Bitter Instead","title_plain":"Enterprise Service Bus? Give Me an Extra Special Bitter Instead","content":"<p>I went to a talk on BizTalk and ESB at lunch today that was sponsored by the <a href=\"http:\/\/www.nwconnectedsystems.org\/\">local connected systems user group<\/a>. Like many terms in this space (SOA and governance to name two others), ESB doesn&#8217;t seem to have a consistent definition. The industry seems to be inventing terms at a fair clip as vendors attempt to differentiate themselves on what to me seem like fairly minor solution aspects. <\/p>\n<p>Today&#8217;s speaker talked at length about a &#8220;large health care company in California&#8221; that he had personally worked with, building an ESB for them with BizTalk. He spoke in glowing terms of the size of the BizTalk environment and the number of messages passing through the bus every day. Then someone asked how many systems this unnamed company had hooked up to the bus. He paused, then admitted: &#8220;Six&#8221;. <\/p>\n<p>Six? Not six <em>whole <\/em>systems! That&#8217;s gotta be a record! <\/p>\n<p>Of course, I realize that there are deployed ESB&#8217;s out there that are integrating more than six systems. My group &#8211; the Integration Center of Excellence (ICoE for short) &#8211; runs a comparably sized BizTalk environment and we&#8217;re connecting around 50 internal systems and hundreds of external partners. But 50 is still a fairly small number. I can&#8217;t help but wonder how well will this ESB approach is going scale as the number of systems goes up a couple orders of magnitude. Frankly, I think the answer is &#8220;not well&#8221;. <\/p>\n<p>The problem I have with ESB is that it&#8217;s a centralized approach. Given that one of the overriding trends of society in general and IT in particular is decentralization, the ESB approach feels like it&#8217;s swimming against the current instead of with it. <\/p>\n<p>As an analogy, consider how well would the Internet work if every connection went thru a central hub? See what I mean? Centralized systems don&#8217;t scale like decentralized ones do. <\/p>\n<p>I admit that there are scenarios where ESB-esque technology solves a practical problem. Transport adaptation and content based routing leap to mind. Services that need those capabilities should leverage ESB-esque technology. But whenever I listen to ESB proponents, I feel that the need for these capabilities is exaggerated to the point that every message exchanged between every service inside your enterprise travels on a central bus, which doesn&#8217;t seem realistic to me.<\/p>\n<p>Am I wrong about this characterization? Do ESB proponents think that all messages must travel on the bus? How about <em>you<\/em>? What do you think? Inquiring minds (aka me) want to know&#8230;<\/p>\n","excerpt":"<p>I went to a talk on BizTalk and ESB at lunch today that was sponsored by the local connected systems user group. Like many terms in this space (SOA and governance to name two others), ESB doesn&#8217;t seem to have a consistent definition. The industry seems to be inventing terms at a fair clip as [&hellip;]<\/p>\n","date":"2007-04-25 16:19:33","modified":"2007-04-25 16:19:33","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2488,"name":"Udi Dahan - The Software Simplis","url":"http:\/\/udidahan.weblogs.us","date":"2007-04-25 21:47:39","content":"<p>Harry,<\/p>\n<p>The problems that you are attributing to ESB&#8217;s are really those of the Broker style that BizTalk supports. That central hub you talk about is not a part of message exchanges in the Bus style, although many ESB&#8217;s do have some sort of central location to jumpstart interactions.<\/p>\n<p>This is the main problem I have with Microsoft&#8217;s ESB message. BizTalk is a broker and will not be a bus until it is redesigned from the ground up. At least, that&#8217;s what I think <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n","parent":0},{"id":2489,"name":"Curt Peterson","url":"http:\/\/www.neudesic.com\/esb","date":"2007-04-26 13:28:07","content":"<p>Harry,<\/p>\n<p>I couldn&#8217;t agree more that a centralized approach to messaging has some less than desired side effects, as you mentioned.  However, consider an alternative, point to point.  If you go down this path, for example using WCF just like it is (any channel you choose), how do you deal with all of the management issues you guys are dealing with in ICOE, or deployment, or service reuse, or mediation, or versioning, etc.?  I&#8217;m confident you would agree there are a certain set of common capabilities required to have a decent messaging solution, as well as some nice to have&#8217;s you could throw in there.  If we did that, why not consider that a definition of an ESB?  What that collection of specific features is called isn&#8217;t as important, I&#8217;ll offer, as the fact that were abstracting common elements of an enterprise communications system into a reusable pattern, and delivering that as a real solution, reusable, and available today.  This saves, time, money, etc.<\/p>\n<p>We&#8217;ve crafted a solution, using all MSFT technologies that achieves exactly this <a href=\"http:\/\/www.neudesic.com\/esb\" rel=\"nofollow\">http:\/\/www.neudesic.com\/esb<\/a>, is available now, is super easy to use, dramatically reduces the cost of wiring together services, and provides features that enable many of the promises of distributed, loosely coupled architectures to be realized.  Our solution is not physically centralized, it is logically centralized, but physically decentralized.  This gives you the best of both worlds; the maintenance ease of a centralized system, with the flexibility, performance, etc. of a decentralized solution.  Check it out, I have implemented these kinds of solutions for nearly 20 years, and it&#8217;s great to finally have a complete MSFT solution, now we can introduce a product that is very easy to use, into an existing environment, with no impact on the current communications, and bring all of the power of CBR, CEP, BPM, BAM, QoS, security, mediation, reconfigurability, BRE, workflow, and many other fantastic tools, in a matter of minutes.  Shoot me an email, if you want to know more, I&#8217;m always happy to prove it, not just say it!!!  The correct communications tools (read good ESB) can and does do wonders for small, medium, and large projects.  Cheers!!!<\/p>\n","parent":0},{"id":2490,"name":"Hans Valcke","url":"http:\/\/www.linkedin.com\/myprofile?trk=tab_pro","date":"2007-04-29 05:41:38","content":"<p>Hi,Harry<\/p>\n<p>We had a fairly large Biztalk env. in our company and we already implemented 2 hub&#8217;s one in EU, one in US in 2004. Then we added the ESB concepts so we can deploy federated biztalk servers around the globe with central routing tables and central console. We can use messaging and services in the ESB design and can scale as large as you want, just add more hubs to the ESB.<\/p>\n<p>We also wrote ESB-switches which can also route the messages thoughout the ESB and we to dynamic routing so we can re-route if a hub is down -All hubs use services to check for new routing and give hartbeats to our main hub&#8217;s. We also implemeted enterprise dymensionnal routing so we can monitor and simulate the impact of changes in routing.<\/p>\n<p>Currently we&#8217;re implementing 15 federeted hub across the globe.<\/p>\n<p>Hans.<\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["a2e5c112-fcfc-40d0-8e6e-9923d5a9a6e0"],"dasblog_compressedtitle":["Enterprise+Service+Bus+Give+Me+An+Extra+Special+Bitter+Instead"],"dasblog_compressedtitleunique":["2007\/04\/25\/Enterprise+Service+Bus+Give+Me+An+Extra+Special+Bitter+Instead"]}},"previous_url":"http:\/\/devhawk.net\/2007\/04\/25\/morning-coffee-70\/","next_url":"http:\/\/devhawk.net\/2007\/04\/26\/morning-coffee-71\/"}