{"status":"ok","post":{"id":801,"type":"post","slug":"tonights-caps-game-live-on-the-web","url":"http:\/\/devhawk.net\/2006\/09\/26\/tonights-caps-game-live-on-the-web\/","status":"publish","title":"Tonight&#8217;s Caps Game Live on the Web","title_plain":"Tonight&#8217;s Caps Game Live on the Web","content":"<p>This just came across my news reader:<\/p>\n<blockquote><p>Washington Capitals will face the Philadelphia Flyers in preseason exhibition tonight. Bummed that the game is not being televised? Never fear, <a href=\"http:\/\/www.washingtoncaps.com\/news\/news.asp?story_id=4180\">WashingtonCaps.com is broadcasting the game<\/a> via broadband off their website. However it is restricted to the Washington area only.<br \/>[<a href=\"http:\/\/pheadsthoughts.blogspot.com\/2006\/09\/caps-live-via-web_26.html\">Caps Live Via Web<\/a> &#8211; <a href=\"http:\/\/pheadsthoughts.blogspot.com\">Puckhead&#8217;s Thoughts<\/a>]<\/p>\n<\/blockquote>\n<p>Wow! I mean, I still can&#8217;t watch the game &lt;grumble grumble&gt; and it is still pre-season, but this is pretty significant. More details in the press release:<\/p>\n<blockquote><p>The Washington Capitals exhibition game against the Philadelphia Flyers on Tuesday, Sept. 26 at 7 p.m. will be broadcast live on WashingtonCaps.com through the use of B2 Networks. This will mark the first time in NHL history that a game can be viewed exclusively via broadband.<\/p>\n<p>The game can be seen free of charge on the Capitals’ website, WashingtonCaps.com. Fans will need a high-speed internet connection and Windows Media Player 9 or higher. Capitals’ radio network play-by-play announcer Steve Kolbe will call the game with Mike Vogel, senior writer from WashingtonCaps.com, providing analysis. Due to NHL broadcast restrictions, the game can only be viewed by fans living within the Capitals broadcast area.<\/p>\n<p>B2 Networks is a provider of secure international television and video broadcasting systems, pay-per-view and billing systems. During the past 12 months, B2 has broadcast more than 3,000 hockey games from all levels including the championships from four leagues. B2 is the digital distribution rightsholder for the United Hockey League, American Hockey League, ECHL and USHL, along with baseball’s Northern League. B2 recently broadcast the National Lacrosse League championship to fans on four continents.<br \/>[<a href=\"http:\/\/www.washingtoncaps.com\/news\/news.asp?story_id=4180\">Capitals Preseason Game to be Broadcast on WashingtonCaps.com via B2Networks<\/a>]<\/p>\n<\/blockquote>\n<p>The Caps and <a href=\"http:\/\/ted.aol.com\/\">their owner<\/a> are aggressively pursing avenues outside of the main stream media (which for the most part ignores hockey). First, they come up with <a href=\"http:\/\/www.ericmcerlain.com\/offwingopinion\/archives\/006447.php\">Guidelines For Issuing Press Credentials To Bloggers<\/a> and now this. <\/p>\n<p>Of all the major sports, hockey seems to have the most to gain from both the HD revolution and media decentralization. Hockey is so fast and the puck is so small, you spend most of your time tracking the puck when watching in standard definition. In HD, you don&#8217;t have to watch the puck, you can watch the play. This isn&#8217;t to say that other sports aren&#8217;t gorgeous in HD, but the difference in the experience between SD and HD just isn&#8217;t as significant for other sports. As for media decentralization, the reason hockey has the most to gain is because it has the least coverage in the mainstream media today. So there&#8217;s no where to go but up. <\/p>\n<p>However, the NHL broadcast restrictions stuff has got to go. Come on <a href=\"http:\/\/ted.aol.com\/\">Ted<\/a>, you&#8217;re a &#8220;<a href=\"http:\/\/www.corp.aol.com\/whoweare\/whoswho\/leonsis.shtml\">pioneer of the Internet and new media<\/a>&#8220;. Get those guys at the NHL to wake up and embrace the new media! How come EVERY game isn&#8217;t available this way? <\/p>\n","excerpt":"<p>This just came across my news reader: Washington Capitals will face the Philadelphia Flyers in preseason exhibition tonight. Bummed that the game is not being televised? Never fear, WashingtonCaps.com is broadcasting the game via broadband off their website. However it is restricted to the Washington area only.[Caps Live Via Web &#8211; Puckhead&#8217;s Thoughts] Wow! I [&hellip;]<\/p>\n","date":"2006-09-26 11:13:13","modified":"2006-09-26 11:13:13","categories":[{"id":234,"slug":"sports","title":"Sports","description":"","parent":0,"post_count":50}],"tags":[{"id":215,"slug":"hockey","title":"Hockey","description":"","post_count":34},{"id":197,"slug":"media-2-0","title":"Media 2.0","description":"","post_count":6},{"id":192,"slug":"washington-capitals","title":"Washington Capitals","description":"","post_count":43}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["0ad58218-0661-4c34-9e45-aa8a0ece13b5"],"dasblog_compressedtitle":["Tonights+Caps+Game+Live+On+The+Web"],"dasblog_compressedtitleunique":["2006\/09\/26\/Tonights+Caps+Game+Live+On+The+Web"]}},"previous_url":"http:\/\/devhawk.net\/2006\/09\/21\/revisiting-the-ajax-ecosystem\/","next_url":"http:\/\/devhawk.net\/2006\/09\/26\/del-icio-us-buttons-and-ie7\/"}