{"status":"ok","post":{"id":580,"type":"post","slug":"great-support-from-napster-on-the-bleeding-edge","url":"http:\/\/devhawk.net\/2005\/03\/17\/great-support-from-napster-on-the-bleeding-edge\/","status":"publish","title":"Great Support from Napster on the Bleeding Edge","title_plain":"Great Support from Napster on the Bleeding Edge","content":"<p>As I have written several times on this blog, I am using <a href=\"http:\/\/www.napster.com\/ntg.html\">Napster 2 Go<\/a> with my Creative Nomad Zen Micro. Unfortunately, the N2G compatible firmware from Creative is still in beta. Everyone in a while&#8230;not sure what the repro steps are&#8230;the Zen Micro would lose all the N2G music licenses. They&#8217;ve released <a href=\"http:\/\/www.nomadworld.com\/downloads\/firmware\/wma-zenmicro.asp?nProdID=556&amp;sProd=Creative%20Zen%20Micro#wma_download_ZenMicroP4S_PCFW_LB_2_11_02.exe\">new firmware<\/a> (2.11.02) that is supposed to solve this problem. <\/p>\n<p>However, while the new firmware will eliminate this from happening in the future, it doesn&#8217;t help you with songs that have lost their license. So you have to delete them off the device and reload them. Simple enough to do w\/ WMP10. However, the music you download from N2G has a set of license restrictions, including a limit for the number of times you can transfer it to a portable device per month. I think the limit is three. I&#8217;ve reset my device a few times experimenting with it, so about half my N2G songs had reached their limit. Major bummer.<\/p>\n<p>However, I dropped a quick email to the folks at Napster and the next time I synced my device, suddenly all the songs had their transfer count reset. So I was able to resync even the songs that didn&#8217;t work before. I had figured I wouldn&#8217;t get those songs back until next month, so I decided to download some other stuff to tide me over. Having the older songs transfer was a very pleasant surprise.<\/p>\n<p>Bravo Napster Support!<\/p>\n","excerpt":"<p>As I have written several times on this blog, I am using Napster 2 Go with my Creative Nomad Zen Micro. Unfortunately, the N2G compatible firmware from Creative is still in beta. Everyone in a while&#8230;not sure what the repro steps are&#8230;the Zen Micro would lose all the N2G music licenses. They&#8217;ve released new firmware [&hellip;]<\/p>\n","date":"2005-03-17 14:15:25","modified":"2005-03-17 14:15:25","categories":[],"tags":[{"id":248,"slug":"music","title":"Music","description":"","post_count":20}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2810,"name":"mearls@hotmail.com (Michael Earls)","url":"http:\/\/www.cerkit.com\/","date":"2005-03-18 12:00:57","content":"<p>Wow, I wish the hour I spent on the phone with them working through a bug in their software would have had the same success.  They were telling me that it was Microsoft&#8217;s fault.  Then the guy proceeded to make up a bunch of technical nonsense to explain why.  When I called him on it, he admitted that he just made it up.  Thirty minutes later, he was telling me that I couldn&#8217;t be experiencing that problem because it works fine on his computers at home.  :S<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["3eea1fcc-0cb5-488a-9e63-81be9400b049"],"dasblog_compressedtitle":["Great+Support+From+Napster+On+The+Bleeding+Edge"],"dasblog_compressedtitleunique":["2005\/03\/17\/Great+Support+From+Napster+On+The+Bleeding+Edge"]}},"previous_url":"http:\/\/devhawk.net\/2005\/03\/15\/qotd-paul-preiss\/","next_url":"http:\/\/devhawk.net\/2005\/03\/18\/dsl-toolkit-team-roundup\/"}