[
  {
    "id": 2424,
    "author-name": "Charlie",
    "author-email": "charles.hinderliter@gmail.com",
    "author-url": "http://hagel2008.blogspot.com",
    "date": "2006-11-07T13:35:18-08:00",
    "content": "I'm looking forward to the 2008 primary races.  It could prove to be healthy (though perhaps ugly) as both parties try to find their way forward.",
    "parent-id": 828,
    "RowKey": "20061107-133518"
  },
  {
    "id": 2425,
    "author-name": "Dale Churchward",
    "author-email": "dale.churchward@microsoft.com",
    "author-url": "http://halfmybrain.spaces.live.com/",
    "date": "2006-11-07T15:06:38-08:00",
    "content": "Considering that Harry and I are on opposing ends of the political spectrum I find it interesting that I agree with this post. While one party or the other will end up with a slim majority I am not confident that it is enough to get much done in the next 2 years. Of course, the cynic in me doesn't think this is a real bad thing. I am definitely a proponent of a small, less intrusive government.\n\nI also agree that the 2008 Presidential race should be very interesting. An idea that we were discussing earlier would have Dick Cheney resigning following this election, and getting one of the leading candidates into the VP position to get some free campaigning over the next couple of years. I don't see that as likely, but at least it’s an intriguing possibility.\n\nSince I can't post without a small dig at Harry I will say that the DNC doesn't have to spend as much on negative ads since they have the mainstream press to do their dirty work for them. :-)\n",
    "parent-id": 828,
    "RowKey": "20061107-150638"
  },
  {
    "id": 2426,
    "author-name": "Robbie",
    "author-email": "krobbie67@yahoo.com",
    "author-url": "",
    "date": "2006-11-07T19:54:56-08:00",
    "content": "Sadly, I think this is the first posting of yours that I have fully understood since I am much more politically savvy than I am technically. Whassup!!! Kiss the kids, the meema, and the wife for me. :-)",
    "parent-id": 828,
    "RowKey": "20061107-195456"
  },
  {
    "id": 2427,
    "author-name": "DJ",
    "author-email": "",
    "author-url": "",
    "date": "2006-11-08T06:07:14-08:00",
    "content": "I totally agree with your sentiments. When the presidential race doesn't have a former VP who is hanging his hat on previous accomplishments, the only thing they will have is mud to sling. \n\nAnd Dale: \"Of course, the cynic in me doesn't think this is a real bad thing. I am definitely a proponent of a small, less intrusive government.\" \nYou said you are on the other political end of the spectrum, Republican I deduce, maybe a more than slim majority can reduce the Republican's changes the last 6+ years to create a larger, more intrusive government. :)",
    "parent-id": 828,
    "RowKey": "20061108-060714"
  },
  {
    "id": 2428,
    "author-name": "Dale Churchward",
    "author-email": "dale.churchward@microsoft.com",
    "author-url": "http://halfmybrain.spaces.live.com/",
    "date": "2006-11-08T09:42:18-08:00",
    "content": "Yes I am a Republican and notice I didn't say it was a bad thing that they were getting voted out. I totally agree that over the last 6 years they have spent money like it was nothiing, and grown the government. Personally a little gridlock in Washington D.C. is perfectly OK with me.",
    "parent-id": 828,
    "RowKey": "20061108-094218"
  },
  {
    "id": 2429,
    "author-name": "fioricet-online",
    "author-email": "fraushmidt@gawab.com",
    "author-url": "http://arbat.or.at/fioricet/",
    "date": "2006-12-11T16:19:59-08:00",
    "content": "Very nice site. Please keep updating it. Your site is exactly the kind of sites which make the net surfing so intresting",
    "parent-id": 828,
    "RowKey": "20061211-161959"
  }
]