[
  {
    "author-name": "orcmid",
    "author-email": "dennis.hamilton@acm.org",
    "author-url": "http://nfocentrale.net/orcmid/blog/",
    "date": "2006-02-17T14:21:21-08:00",
    "content": "No, actually it shows how popular your blog and RSS feed are [;<).  I got them in dark blue.  One is as a gift for a colleague.\n\nAnd I'm a firm believer that code is rarely the model.  Heh.  I'm much more aligned with your dad on \"What Is a Model?\""
  },
  {
    "author-name": "DevHawk",
    "author-email": "devhawk@outlook.com",
    "author-url": "",
    "date": "2006-02-17T18:20:24-08:00",
    "content": "Nice of you to say! Maybe something related to modeling should be my next shirt. :)"
  },
  {
    "author-name": "orcmid",
    "author-email": "dennis.hamilton@acm.org",
    "author-url": "http://nfocentrale.net/orcmid/blog/",
    "date": "2006-02-17T19:04:41-08:00",
    "content": "I like your new site design too.  Although when I come to the comments page I get a \"Caution: This website contains suspicious content\" banner from the Phishing Filter.\"  \n\nSo, I just retrieved an e-mail from DHL Express confirming that the shirts were shipped today with estimated delivery of Tuesday (assuming the Menlo Park pickup came off as planned).\n\nHmm, modeling on a T-shirt.  I suppose so.  I was given one like that as a going-away present (in 1992 on taking a transfer to another organization) that has a printing-system architecture printed on it.  \n\nModeling.  That would be interesting. Now you've got me wondering what T-shirt I would want to wear at OOPSLA this year.  Hmm.  I need to do one that bridges between \"What Computers Know\" and \"What Programmers Know,\" perhaps."
  },
  {
    "author-name": "orcmid",
    "author-email": "dennis.hamilton@acm.org",
    "author-url": "http://nfocentrale.net/orcmid/blog/",
    "date": "2006-02-21T07:47:57-08:00",
    "content": "Well, I found the T-Shirt delivery on my front porch as I was leaving to go to the SEASPIN meeting and David Anderson's presentation on the MSF Agile CMMI approach.  I was afraid of missing the bus, so I didn't wear it.  That would have been fun.\n\nThe cool thing is that the T-shirt shipped earlier than their promise and arrived a day earlier than the expected delivery as well.  It would be interesting to see how Zazzle works their just-in-time and delight the customer process so beautifully.\n\nI'm still thinking about the model case for a T-shirt, and David's talk reminded me that I already have a design that would make for an interesting T-shirt at http://nfocentrale.net/TROST/info/2005/06/i050601.htm"
  },
  {
    "author-name": "DevHawk",
    "author-email": "devhawk@outlook.com",
    "author-url": "",
    "date": "2006-02-21T08:14:51-08:00",
    "content": "That's a cool symbol. And it's a great use for Zazzle - to promote something. That and humorous comments."
  }
]