{"status":"ok","post":{"id":938,"type":"post","slug":"the-ramblings-of-a-mourning-hokie","url":"http:\/\/devhawk.net\/2007\/04\/17\/the-ramblings-of-a-mourning-hokie\/","status":"publish","title":"The Ramblings of a Mourning Hokie","title_plain":"The Ramblings of a Mourning Hokie","content":"<p>As I <a href=\"http:\/\/devhawk.net\/2007\/04\/17\/Morning+Coffee+65.aspx\">mentioned this morning<\/a>, my brother went to Virginia Tech. In trying to come to grips with what happened in Blacksburg yesterday, he wrote the following and asked me to post it here. <\/p>\n<hr \/>\n<p>My name is Ted Pierson and I am a Virginia Tech Alumni, member of the class of ’95. As I heard and watched the events that unfolded on Monday April 16<sup>th<\/sup>, my heart broke for the families, students and faculty at Virginia Tech. While I lost no one that I knew personally, I feel that I lost 32 of my fellow brethren. The community of Virginia Tech reaches well beyond the confines of the campus, and we all feel a deep sense of pride to wear our Hokie Colors to show support for our beloved home. We also now feel a deep sense of loss. In the coming months, there will be many political debates as to how this could have been prevented, gun control and proper security measures. Please remember, this is more then a political issue to be debated, it is a humanitarian issue. There can be, and never will be a rational explanation to the horrible tragedy the felled the VA Tech campus yesterday. We as a society need to learn a love of our fellow man\/woman. We need to look as a people, beyond the surface level issues that we deal with on a daily basis, and ask ourselves, is this the world we want to leave to our children, one that views the death of our fellow humans as trivial or platforms for political gain. The only lesson that we can learn from this is that we are all one race, one gender, one person, and that we need each other, regardless of race, creed, or other distinctions. I urge all readers of this to wear orange and maroon in a showing of support to the Hokie Nation. We are all Hokies today.<\/p>\n","excerpt":"<p>As I mentioned this morning, my brother went to Virginia Tech. In trying to come to grips with what happened in Blacksburg yesterday, he wrote the following and asked me to post it here. My name is Ted Pierson and I am a Virginia Tech Alumni, member of the class of ’95. As I heard [&hellip;]<\/p>\n","date":"2007-04-17 23:10:58","modified":"2007-04-17 23:10:58","categories":[],"tags":[{"id":179,"slug":"family","title":"Family","description":"","post_count":33}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["f2533d2c-345b-445c-ab3b-5c0dcde9fb32"],"dasblog_compressedtitle":["The+Ramblings+Of+A+Mourning+Hokie"],"dasblog_compressedtitleunique":["2007\/04\/18\/The+Ramblings+Of+A+Mourning+Hokie"]}},"previous_url":"http:\/\/devhawk.net\/2007\/04\/17\/morning-coffee-65\/","next_url":"http:\/\/devhawk.net\/2007\/04\/19\/morning-coffee-66\/"}