[
  {
    "id": 2103,
    "author-name": "Dale Churchward",
    "author-email": "dale.churchward@microsoft.com",
    "author-url": "http://halfmybrain.spaces.live.com/",
    "date": "2008-08-01T15:34:00-07:00",
    "content": "Yeah, McCain made a mistake there. Although the part about Obama being the biggest celebrity in the world, but not ready to rule is dead on. :-)\n\nOf course, it would be no fun if we all agreed.",
    "parent-id": 1164,
    "RowKey": "20080801-153400"
  },
  {
    "id": 2104,
    "author-name": "BigJ",
    "author-email": "",
    "author-url": "",
    "date": "2008-08-01T19:07:27-07:00",
    "content": "So, a politician who's not afraid to tick off a powerful, influential, big money contributor.  Yeah, a real d---.  Too bad there aren't more like him.\n\nBesides, this is tantamount to saying that comparing someone to Barry Obama is insulting.  Now I know.",
    "parent-id": 1164,
    "RowKey": "20080801-190727"
  },
  {
    "id": 2105,
    "author-name": "RandyG",
    "author-email": "",
    "author-url": "",
    "date": "2008-08-05T10:49:12-07:00",
    "content": "I was planning on voting for Obama, but he's proven himself to be such a pompous dick himself that I just can't bring myself to do it. He'll probably win anyway, but not with my help at least.",
    "parent-id": 1164,
    "RowKey": "20080805-104912"
  },
  {
    "id": 2106,
    "author-name": "Jonathan Birge",
    "author-email": "birge@mit.edu",
    "author-url": "http://scripts.mit.edu/~birge/blog",
    "date": "2008-09-02T13:45:18-07:00",
    "content": "The problem with the Daily Show is that John Stewart makes good points, but can't resist behind such a smart ass little dick himself that it ruins whatever point he had. He's like the kid in school who would win arguments by repeating everything you said so that you lost your cool. You look stupid, but he hasn't actually said anything intelligent. Same with his critique of McCain. Sure, McCain was wrong with those spots, but Stewarts entire tirade against him was only made possible by cheap shots on out of context footage and a sycophantic audience of the kind of douchebag zealots who expect to find in Manhattan in the middle of the day without somewhere to be. That's pretty much the daily show right there. Steward wouldn't do so good without home studio advantage...",
    "parent-id": 1164,
    "RowKey": "20080902-134518"
  }
]