{"status":"ok","post":{"id":1012,"type":"post","slug":"now-how-much-would-you-pay-for-this-code","url":"http:\/\/devhawk.net\/2007\/07\/25\/now-how-much-would-you-pay-for-this-code\/","status":"publish","title":"*Now* How Much Would You Pay For This Code?","title_plain":"*Now* How Much Would You Pay For This Code?","content":"<p>Via <a href=\"http:\/\/www.larkware.com\/dg8\/TheDailyGrind1193.aspx\">Larkware<\/a> and <a href=\"http:\/\/www.infoq.com\/news\/2007\/07\/worthless-code\">InfoQ<\/a>, I discovered a great post on code reuse by Dennis Forbes: <a href=\"http:\/\/www.yafla.com\/dennisforbes\/Internal-Code-Reuse-Considered-Dangerous\/Internal-Code-Reuse-Considered-Dangerous.html\">Internal Code Reuse Considered Dangerous<\/a>. I&#8217;ve <a href=\"http:\/\/devhawk.net\/2006\/09\/19\/A+Question+Of+Context.aspx\">written about<\/a><a href=\"http:\/\/devhawk.net\/2006\/09\/20\/Feasible+Service+Reuse.aspx\">reuse before<\/a>, albeit in the context of services. But where I wrote about the impact of context on reuse (high context == low or no reuse), Dennis focused on the idea of accidental reuse. Here&#8217;s the money quote from Dennis:<\/p>\n<blockquote><p>Code reuse doesn&#8217;t happen by accident, or as an incidental &#8211; <em>reusable code is designed and developed to be generalized reusable code<\/em>. Code reuse as a <em>by-product<\/em> of project development, usually the way organizations attempt to pursue it, is almost always detrimental to both the project and anyone tasked with reusing the code in the future. [Emphasis in original]<\/p>\n<\/blockquote>\n<p>I&#8217;ve seen many initiatives of varying &#8220;officialness&#8221; to identify and produce reusable code assets over the years, both inside and outside Microsoft. Dennis&#8217; point that code has to be specifically designed to be reusable is right on the money. Accidental code (or service) reuse just doesn&#8217;t happen. Dennis goes so far as to describe such efforts as &#8220;almost always detrimental to both the project and anyone tasked with reusing the code in the future&#8221;.<\/p>\n<p>One of the more recent code reuse efforts I&#8217;ve seen went so far as to identify a reusable asset lifecycle model. While it was fairly detailed at the lifecycle steps that came <em>after<\/em> said asset came into existence, it was maddeningly vague as to how these reusable assets got built in the first place. The lifecycle said that a reusable asset &#8220;comes into existence during the planning phases&#8221;. That&#8217;s EA-speak for &#8220;and then a miracle happens&#8221;. <\/p>\n<p>Obviously, the hard part about reusable assets is designing and building them in the first place. So the fact that they skimped on this part of the lifecycle made it very clear they had no chance of success with the project. I shot back the following questions, but never got a response. If you are attempting such a reuse effort, I&#8217;d strongly advise answering these questions first:<\/p>\n<ul>\n<li>How does a project know a given asset is reusable? <\/li>\n<li>How does a project design a given asset to be reusable?<\/li>\n<li>How do you incent (<a href=\"http:\/\/dictionary.reference.com\/browse\/incentivize\">incentivize?<\/a>) a project to invest the extra resources (time, people, money) in takes to generalize an asset to be reusable?<\/li>\n<\/ul>\n<p>And to steal one from Dennis:<\/p>\n<ul>\n<li>What, realistically, would competitors and new entrants in the field offer for a given reusable asset?<\/li>\n<\/ul>\n<p>Carl Lewis wonders <a href=\"http:\/\/cysquatch.net\/blog\/2007\/06\/08\/is-your-code-worthless\/\">Is your code worthless?<\/a> As a reusable asset, probably yes.<\/p>\n","excerpt":"<p>Via Larkware and InfoQ, I discovered a great post on code reuse by Dennis Forbes: Internal Code Reuse Considered Dangerous. I&#8217;ve written aboutreuse before, albeit in the context of services. But where I wrote about the impact of context on reuse (high context == low or no reuse), Dennis focused on the idea of accidental [&hellip;]<\/p>\n","date":"2007-07-25 14:47:52","modified":"2007-07-25 14:47:52","categories":[{"id":204,"slug":"development","title":"Development","description":"","parent":0,"post_count":165}],"tags":[{"id":220,"slug":"reuse","title":"Reuse","description":"","post_count":5}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2553,"name":"Nick Malik","url":"http:\/\/blogs.msdn.com\/nickmalik","date":"2007-07-27 09:56:47","content":"<p>It&#8217;s unfortunate that no one answered your questions, Harry.  if they ever do, let me know.<\/p>\n<p>I do thing that the stuff you saw was useful and necessary.  Just, as you point out, probably incomplete.<\/p>\n<p>My personal opinion is that we are serious about code reuse, we need to identify the services that SHOULD be provided by that reusable code.  The .Net framework takes the horizontal approach, and tries to fill in gaps for a dozen different types of projects for any business need.  If we want to do something in IT, it needs to take the opposite approach: build for one or two project types for one or two business needs, but cross all the way up across the stack.  That&#8217;s right: Components at every level of the stack.<\/p>\n<p>Perhaps something for patterns that connect dynamic user interfaces down through the stacks, including workflow and business rules engine, and through to adapters that save data?  See what I mean?<\/p>\n","parent":0},{"id":2554,"name":"raveman","url":"","date":"2007-07-31 20:16:47","content":"<p>i for once think there is no code reusable by default, its much harder to write that kind of code and really what for? because you hope it might get reused in the future? how much reusable code you wrote and &#8230;. Its slow you down, i personally know right away if the code should be reusable, if i write something that im planning(90% of time i wrong about it anyway <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_wink.gif\" alt=\";)\" class=\"wp-smiley\" \/>  to use in the future then i make it reusable, if i not then i wont.<\/p>\n<p>I just wonder how many people really reuse the code? and i dont mean classes that names are ended with Util or Helper.<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["6c298f24-05dc-4ecc-973d-77293e65d492"],"dasblog_compressedtitle":["Now+How+Much+Would+You+Pay+For+This+Code"],"dasblog_compressedtitleunique":["2007\/07\/25\/Now+How+Much+Would+You+Pay+For+This+Code"]}},"previous_url":"http:\/\/devhawk.net\/2007\/07\/25\/early-afternoon-coffee-105\/","next_url":"http:\/\/devhawk.net\/2007\/07\/26\/the-durable-messaging-debate-continues\/"}