{"status":"ok","post":{"id":1212,"type":"post","slug":"thoughts-from-inauguration-day","url":"http:\/\/devhawk.net\/2009\/01\/21\/thoughts-from-inauguration-day\/","status":"publish","title":"Thoughts from Inauguration Day","title_plain":"Thoughts from Inauguration Day","content":"<p>A few random thoughts on yesterday:<\/p>\n<p>Though some in the progressive blogosphere disagree, I thought <a href=\"http:\/\/www.pic2009.org\/blog\/entry\/president_obamas_inaugural_address\/\">Obama’s inaugural speech<\/a> was very good. His start, contrasting taking the oath of office “during rising tides of prosperity and the still waters of peace” (as now-former President Bush did [1]) versus taking the oath as he does “amidst gathering clouds and raging storms” really set the tone for the whole speech. With Bush sitting right there – mere feet from the podium – Obama categorically rejected almost every policy of the Bush administration. When they cut to a shot of Bush in the middle, he didn’t seem to be enjoying Obama’s speech very much. In a way, I was reminded of Steven Colbert’s <a href=\"http:\/\/video.google.com\/videoplay?docid=-869183917758574879\">epic performance<\/a> at the White House Correspondents Dinner a few years ago. Of course, the difference was that Colbert was speaking truth *to* power while Obama is speaking truth *from* power. <\/p>\n<p>Speaking of Ex-President Bush (man, <a href=\"http:\/\/twitter.com\/DevHawk\/status\/1134079689\">I love writing that<\/a>) I can say a lot of negative things about him, but I will grudgingly commend him on handling the transition. However, it does feel like it’s grading him on a massive curve: “Sure he’s been an abysmal president, but at least he was able to peacefully hand over the reigns of power without fucking that up too.”<\/p>\n<p>I felt sorry for <a href=\"http:\/\/www.pic2009.org\/blog\/entry\/elizabeth_alexander_inaugural_profile\/\">Elizabeth Alexander<\/a>, the poet who had to speak after President Obama’s inaugural speech. Everyone started heading for the exits after Obama was done. I hope those early exiters could hear Reverend Lowery’s benediction, it <a href=\"http:\/\/usatoday.com\/communities\/religion\/post\/2009\/01\/61651854\/1?imw=Y\">was awesome<\/a>. I realize Reverend Warren was a controversial pick to deliver the invocation – certainly, I’m not a fan – but I respect Obama for being inclusive of all-viewpoints. And while having a quartet with the likes of Itzhak Perlman and Yo-Yo Ma was awesome, I especially liked John Williams’ inaugural piece “Air and Simple Gifts”. But wouldn’t the theme to Superman have been more appropriate? <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" class=\"grouped_elements\" rel=\"tc-fancybox-group1212\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n<p>Finally, I skipped the rest of the pre and post inauguration analysis and commentary other than the Countdown podcast which I listen to on my way to work most days. Frankly, I didn’t need to be reminded of what an historic day it was. Res ipsa loquitur. <\/p>\n<hr \/>\n<p>[1] The Onion was disturbingly prescient with <a href=\"http:\/\/www.theonion.com\/content\/node\/28784\">their article<\/a> eight years ago “Bush: &#8216;Our Long National Nightmare Of Peace And Prosperity Is Finally Over&#8217;”<\/p>\n","excerpt":"<p>A few random thoughts on yesterday: Though some in the progressive blogosphere disagree, I thought Obama’s inaugural speech was very good. His start, contrasting taking the oath of office “during rising tides of prosperity and the still waters of peace” (as now-former President Bush did [1]) versus taking the oath as he does “amidst gathering [&hellip;]<\/p>\n","date":"2009-01-21 09:54:20","modified":"2009-01-21 09:54:20","categories":[{"id":219,"slug":"politics","title":"Politics","description":"","parent":0,"post_count":41}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2165,"name":"Ali","url":"","date":"2009-01-21 19:58:58","content":"<p>&#8220;But wouldn’t the theme to Superman have been more appropriate?&#8221;<\/p>\n<p>Yes, Williams screwed up, but the Internets are on top of it &#8230;<\/p>\n<p><a href=\"http:\/\/www.youtube.com\/watch?v=sI944RulJD4\" rel=\"nofollow\">http:\/\/www.youtube.com\/watch?v=sI944RulJD4<\/a><\/p>\n","parent":0},{"id":2166,"name":"Heath","url":"","date":"2009-01-23 07:44:02","content":"<p>You seem to be a touch misinformed there. Bush inherited a recession but when he mentioned it he got thrashed by the media. The policies of the Bush administration kept our great country safe and for that I applaud him. We were at war before Bush even took office, but we were simply to naive to realize it. He cared less about his poll numbers and appeasing a hateful media and more about doing what was right and being a man of honor and dignity. As a former soldier and current intelligence professional, I can say with all honesty that President Bush was a great president and THE president that we needed during his 8 years. This election was handed to Obama on a silver platter and he nearly managed to drop it despite that fact. However, if President Obama can be half the man that Bush was and is, he will do quite well and the country will be well served.<br \/>\n-Heath<\/p>\n","parent":0},{"id":2167,"name":"DevHawk","url":"","date":"2009-01-29 17:10:37","content":"<p>Heath, your willful ignorance is truely astounding. <\/p>\n","parent":0},{"id":2168,"name":"Key","url":"","date":"2009-03-03 04:27:24","content":"<p>Harry, you are an ignorant if you think Bush was a bad president. Most of the problems were caused by the fact that the Dems blocked Bush at every turn. The dems held up regulations to fix Fannie and Freddie. The dems blocked drilling for oil, and then blame Bush for high oil prices. Why is health care expensive? Because dems block tort reform, and push for government solutions rather than free market solutions.<\/p>\n<p>Check out George Orwell because you are putty in the hands of the media. They said Reagan was a bad president (but now have changed their opinion), and Clinton was a great president (who did nothing). Obama has been on the cover of Time magazine 17 times in one year &#8212; I guess you got the message like a loyal robot.<\/p>\n<p>Obama&#8217;s done nothing his entire career &#8212; would you make an intern the next CEO of Microsoft?<\/p>\n<p>How&#8217;s the economy going? The good thing about democracy is that we get to live with the choices we make. It makes for a smarter electorate, over time.<\/p>\n","parent":0}],"attachments":[],"comment_count":4,"comment_status":"closed","custom_fields":{"dasblog_entryid":["b49a805c-4e3b-4ddd-a18a-5beb3c014894"],"dasblog_compressedtitle":["Thoughts+From+Inauguration+Day"],"dasblog_compressedtitleunique":["2009\/01\/21\/Thoughts+From+Inauguration+Day"]}},"previous_url":"http:\/\/devhawk.net\/2009\/01\/08\/kid-programming-with-kodu-coming-to-xbox-360\/","next_url":"http:\/\/devhawk.net\/2009\/01\/29\/ironpython-and-codedom-dynamically-compiling-c-files\/"}