{"status":"ok","post":{"id":439,"type":"post","slug":"preparing-to-present-in-beijing","url":"http:\/\/devhawk.net\/2004\/09\/17\/preparing-to-present-in-beijing\/","status":"publish","title":"Preparing to Present in Beijing","title_plain":"Preparing to Present in Beijing","content":"<p>I made it to Beijing yesterday with no problem. There was a car waiting for me at the airport, and one of the speaker managers met me at my hotel shortly after I arrived. They even provide a loner <a href=\"http:\/\/www.microsoft.com\/windowsmobile\/devices\/devicedisplay.aspx?module=deviceDisplay;Smartphone;apac;58\">dopod SmartPhone<\/a> for use while I&#8217;m here though I&#8217;m not sure who I would call. I went to the attendee dinner last night and on to a party for local partners. I spoke to a few people, including a gentleman from <a href=\"http:\/\/digitalchina.com\/\">Digital China<\/a> who reads my blog. It&#8217;s nice to be recognized at all, much less as an <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=52945d4e-bc1a-496c-b3f3-195e5ca416f5\">International Man of Architecture<\/a>.<\/p>\n<p>After dinner, I worked for an hour or so with the translator for my Metropolis session, Quanzhan. Quanzhan is from China, but he&#8217;s now a program manager in the Windows Server division at corp &#8211; his office is just on the other side of campus. He&#8217;s here doing presentations of his own as well as helping out as a translator. I&#8217;ve met at least one other Chinese person here who works in Redmond &#8211; I&#8217;m guessing presenting TechEd China provides a great way for these folks to visit home and also give back to the community they are from in some way. <\/p>\n<p>Delivering these presentations via a translator will be an interesting challenge. I&#8217;ve never worked thru a translator before. Each session has it&#8217;s own unique challenge &#8211; Data in SOA is very technical while Metropolis is pretty abstract. I ended up cutting 20 slides from today&#8217;s Metropolis talk in order to ensure I have enough time to hit the important points. Presenting this way requires a truly conservative approach to word choice &#8211; even though my session is 75 minutes long, in reality I have closer to 30 as everything I say has to be spoken twice. I&#8217;m grateful that Quanzhan and I spent the time last night going thru the presentation even though we were both exhausted. I guess we&#8217;ll see how well the session goes today, but I think we&#8217;ll do well.<\/p>\n","excerpt":"<p>I made it to Beijing yesterday with no problem. There was a car waiting for me at the airport, and one of the speaker managers met me at my hotel shortly after I arrived. They even provide a loner dopod SmartPhone for use while I&#8217;m here though I&#8217;m not sure who I would call. I [&hellip;]<\/p>\n","date":"2004-09-17 16:20:35","modified":"2004-09-17 16:20:35","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["b4e7e5c6-6ca7-40e2-baf2-a91fa93b6219"],"dasblog_compressedtitle":["Preparing+To+Present+In+Beijing"],"dasblog_compressedtitleunique":["2004\/09\/17\/Preparing+To+Present+In+Beijing"]}},"previous_url":"http:\/\/devhawk.net\/2004\/09\/16\/leaving-kl\/","next_url":"http:\/\/devhawk.net\/2004\/09\/17\/stage-1-on-new-ws-specs\/"}