[
  {
    "author-name": "Scott@NOSPAM_Tripleasp.net (Scott Watermasysk)",
    "author-email": "Scott@NOSPAMTripleasp.netScottWatermasysk",
    "author-url": "http://scottwater.com/blog",
    "date": "2004-07-27T12:09:35-07:00",
    "content": "I have been using for a week or so now and it has worked great.\n\nSee: http://scottwater.com/blog/archive/2004/07/21/12689.aspx\n\nIf you need a referral, let me know :)\n\n-Scott"
  },
  {
    "author-name": "Michael Earls",
    "author-email": "mearls@hotmail.com",
    "author-url": "http://www.cerkit.com",
    "date": "2004-07-27T15:43:07-07:00",
    "content": "I'm afraid Vonage will be short-lived (at least in the US).  I think the FCC has been waiting for something like this to come along so they can start to regulate the Internet.  Maybe I'm just being paranoid.  I used to think that they'd step in as soon as Netmeeting and CU-SeeMe was released, but I guess they weren't functional enough."
  },
  {
    "author-name": "John",
    "author-email": "",
    "author-url": "",
    "date": "2004-07-27T16:09:54-07:00",
    "content": "I've been using Vonage for a month. I don't make a lot of calls, and so I use the $15 a month deal. What a bargain compared to my old phone company! And the extra features (voicemail by email, free Caller ID) are great.\n\n"
  },
  {
    "author-name": "Chris Church",
    "author-email": "cchurch@techplanning.net",
    "author-url": "",
    "date": "2004-08-02T20:13:30-07:00",
    "content": "I signed up for Vonage this weekend, installed it in 5 minutes, and its working great.  I expect I'll lower my cost with a bunch more features, and I'll use them.  So far, so good - neither party sending nor receiving has been able to tell any difference from POTS yet.\n\nI may try the softphone feature next... its an extra $9 a month, but its worth a look at least.\n\nChris"
  },
  {
    "author-name": "David Yack",
    "author-email": "",
    "author-url": "http://blog.davidyack.com",
    "date": "2004-08-06T23:45:06-07:00",
    "content": "We have several vonage lines and they work great.  I also have used the softphone alot while traveling - it especially worked great my last trip to canada\n\nThe virtual numbers and the ability to have fowarding rules are great - I often have my soft phone number ring both the softphone and my cell at the same time - you can answer either."
  }
]