{"status":"ok","post":{"id":1177,"type":"post","slug":"the-pdc-prep-death-march-its-almost-over","url":"http:\/\/devhawk.net\/2008\/10\/19\/the-pdc-prep-death-march-its-almost-over\/","status":"publish","title":"The PDC Prep Death March &#8211; It&#8217;s Almost Over","title_plain":"The PDC Prep Death March &#8211; It&#8217;s Almost Over","content":"<p><img style=\"display: inline; margin-left: 0px; margin-right: 0px\" align=\"right\" src=\"http:\/\/microsoftpdc.com\/Images\/BlogBling\/PDC2008Brain.gif\" \/>So it’s been just over a month since my last post, and I think it’s safe to say it’s been one of the busiest of my career to date. If you’ve been following my <a href=\"http:\/\/twitter.com\/devhawk\">Twitter stream<\/a>, you already know that I’ve spent the last two weeks in <a href=\"http:\/\/microsoftpdc.com\/\">PDC<\/a> dry runs – we went thru almost every session in the track, reviewing content and giving feedback to the speakers. Some were very good (as I <a href=\"http:\/\/twitter.com\/DevHawk\/statuses\/948784175\">twittered at the time<\/a>, <a href=\"http:\/\/blogs.msdn.com\/edpinto\/\">Ed Pinto’s<\/a><a href=\"http:\/\/channel9.msdn.com\/pdc2008\/TL06\/\">Building WCF Services with WF<\/a> blew my mind). Others, needed more work, but I think will be great by PDC. I got into several disagreements about the best way to present content, had to raise my voice once, and called some speakers “a little creepy”. (No, I’m not telling you which sessions those were.)<\/p>\n<p>After 9 days of dry runs, I spent Friday with <a href=\"http:\/\/blogs.msdn.com\/jasonz\/\">Jason Zander<\/a>, General Manager for Visual Studio, again reviewing almost all the decks with him and some marketing folks. Frankly, spending that much time with my boss’s boss’s boss’s boss is a bit intimidating, but Jason’s been great and I’m guessing the visibility will be great for my career. I mean, come review time, he won’t be saying “Harry who?” I’ve also gotten to meet people from far and wide across my division, which has been great since I’m still new over here.<\/p>\n<p>Unfortunately,  I can’t talk much about <em>what<\/em> I’ve seen, since as you know most of it is new and being revealed at PDC for the first time publicly. For example, I can tell you Ed’s talk was frakking awesome, but I can’t tell you <em>why<\/em> I think it’s frakking awesome, yet. But I’m queuing up some posts now that I will publish later once the sessions are public. <\/p>\n<p>Tomorrow, I’m back to my “day job” as the IronPython PM. My teammates have been soldering on in my absence – the one time I was in my office in the past two weeks I joked that no one would recognize me since I’ve been gone so long. We’re coming up on the final release of IronPython 2.0, and my exclusive focus on PDC has left me a mountain of work to do here in the final stretch. <\/p>\n<p>In addition to my teammates, I need to give a quick shout out to <a href=\"http:\/\/channel9.msdn.com\/shows\/WM_IN\/Developers-are-my-life-I-love-them-OK-how-can-you-not-want-to-find-out-more-about-who-said-tha\">Shoshanna Budzianowski<\/a> and <a href=\"http:\/\/blogs.msdn.com\/mswanson\">Mike Swanson<\/a>, without whom I’m not sure I would have survived the past two weeks. Mike is the PDC content owner, so as hard as the past two weeks have been for me, I’m sure they’re worse for him. Shoshanna is the track owner for the “Tools and Languages” track (that’s what the TL in the session codes stands for) and I’ve been the main representative for the VS group in the track. I don’t know if she’s ever done something like PDC before, but she’s awesome.  <\/p>\n<p>I leave Friday for southern California. I’m going down early to see a few friends and to do my <a href=\"http:\/\/www.socalcodecamp.com\/session.aspx?sid=96fe471e-e96d-4c82-bfa4-a2f7d4d88387\">Pumping Iron talk<\/a> at the <a href=\"http:\/\/www.socalcodecamp.com\/\">SoCal Code Camp<\/a> next Saturday. That should be fun since it’s being held at <a href=\"http:\/\/viterbi.usc.edu\/\">my alma mater<\/a>. Then Monday starts PDC proper. If you’re going to PDC, some find me in the <a href=\"http:\/\/microsoftpdc.com\/Agenda\/UnSessions.aspx#pdc-lounges\">PDC Lounges<\/a>. I’ll be spending the vast majority of my time there, since I’ve seen all the content in my track already! <\/p>\n","excerpt":"<p>So it’s been just over a month since my last post, and I think it’s safe to say it’s been one of the busiest of my career to date. If you’ve been following my Twitter stream, you already know that I’ve spent the last two weeks in PDC dry runs – we went thru almost [&hellip;]<\/p>\n","date":"2008-10-19 12:00:12","modified":"2008-10-19 12:00:12","categories":[],"tags":[{"id":232,"slug":"microsoft","title":"Microsoft","description":"","post_count":31},{"id":262,"slug":"pdc08","title":"PDC08","description":"","post_count":5}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["87983a0e-d4c9-4f9e-bdcf-0f9e0b5baeda"],"dasblog_compressedtitle":["The+PDC+Prep+Death+March+Ndash+Itrsquos+Almost+Over"],"dasblog_compressedtitleunique":["2008\/10\/19\/The+PDC+Prep+Death+March+Ndash+Itrsquos+Almost+Over"]}},"previous_url":"http:\/\/devhawk.net\/2008\/09\/17\/dlr-namespace-change-fire-drill\/","next_url":"http:\/\/devhawk.net\/2008\/10\/21\/the-fifth-assembly\/"}