{"status":"ok","post":{"id":1065,"type":"post","slug":"durable-and-restful","url":"http:\/\/devhawk.net\/2007\/12\/05\/durable-and-restful\/","status":"publish","title":"Durable and RESTful","title_plain":"Durable and RESTful","content":"<p>A while back I <a href=\"http:\/\/devhawk.net\/2007\/06\/05\/A+REST+Question.aspx\">wondered<\/a> if it&#8217;s still REST if you don&#8217;t use HTTP. The reason I wondered that is because like many I&#8217;ve become disillusioned with the WS-* stack over time and see REST as a viable alternative to all that spec-driven complexity. However, just because I&#8217;m looking to REST means I&#8217;m willing to give up on <a href=\"http:\/\/devhawk.net\/2007\/05\/30\/The+Case+For+Durable+Messaging+In+Service+Orientation.aspx\">durable messaging<\/a>. So I shouldn&#8217;t be asking &#8220;can I do REST without HTTP?&#8221; I should be asking &#8220;what protocol can I use to do durable messaging with REST?&#8221;<\/p>\n<p>It turns out HTTP is just fine for RESTful durable messaging, if you take the time to make your POSTs idempotent. There&#8217;s even a IETF RFC that builds on HTTP and specifies a mechanism to do it.<\/p>\n<p>As I wrote last month, <a href=\"http:\/\/devhawk.net\/2007\/11\/09\/The+Importance+Of+Idempotence.aspx\">idempotence is critically important<\/a> to ensuring &#8220;things&#8221; happen exactly once when connecting disparate systems together. At the end of that post, I asked you, dear reader, to contemplate just how durable messaging systems ensures exactly once delivery. They do it by assigning messages to be delivered a unique identifier. Any non-idempotent operations can be made idempotent with unique identifiers and a message ID log.<\/p>\n<blockquote><p>&#8220;<u>Not Idempotent<\/u>: <br \/>     Withdrawing $1 Billion. <br \/><u>Idempotent<\/u>: <br \/>     If Haven’t Yet Done Withdrawal #XYZ for $1 Billion, <br \/>     Then Withdraw $1 Billion and Label as #XYZ&#8221; <br \/>Pat Helland <\/p>\n<\/blockquote>\n<p>For example, when you send a message in MSMQ, it&#8217;s assigned a <a href=\"http:\/\/msdn2.microsoft.com\/en-us\/library\/ms705091.aspx\">20 byte identifier<\/a> which is &#8220;unique within your enterprise.&#8221; [1] If the destination system receives multiple messages with the same message ID, it knows they are duplicates and can safely toss all but one of the messages with the same ID. Exactly once, no transactions.<\/p>\n<p>While many operations in REST are naturally idempotent, using REST doesn&#8217;t magically make all your operations idempotent, contrary to <a href=\"http:\/\/diveintomark.org\/archives\/2004\/09\/29\/restagra\">popular belief<\/a>. Have you ever seen a message like &#8220;please don&#8217;t press submit order twice&#8221; on the checkout page of an e-commerce website? It&#8217;s there because POST is <u>not<\/u> naturally idempotent and the site hasn&#8217;t taken any extra steps to identify duplicate POSTs. If the site embedded a unique ID in a hidden form field, it could use that to identify duplicate orders. <\/p>\n<p>If you&#8217;re a RESTifarian, haven&#8217;t you <a href=\"http:\/\/bitworking.org\/projects\/atom\/rfc5023.html\">seen this approach somewhere before<\/a>?<\/p>\n<p>Given that POST isn&#8217;t <u>naturally<\/u> idempotent, I think it&#8217;s kinda surprising that new <a href=\"http:\/\/bitworking.org\/projects\/atom\/rfc5023.html#crwp\">resources are created in AtomPub<\/a> by POSTing them to a collection rather than PUTting them to a specific URL. <a href=\"http:\/\/www.oreilly.com\/catalog\/9780596529260\/\" target=\"_blank\">RESTful Web Services<\/a> specifically points out that PUT is idempotent, so I wonder why AtomPub uses POST. I&#8217;d guess most AtomPub implementations (aka blogs) aren&#8217;t much concerned about ensuring Exactly Once. If an blog entry gets posted twice, you delete one and go on with your life. <\/p>\n<p>However, if you wanted to use AtomPub and ensure Exactly Once, you can use the fact that Atom entries <a href=\"http:\/\/tools.ietf.org\/html\/rfc4287#section-4.1.2\">must contain exactly one ID element<\/a> which as per the spec <a href=\"http:\/\/tools.ietf.org\/html\/rfc4287#section-4.2.6\">must be universally unique<\/a>. From reading the Atom spec, the ID element seems primarily designed for Atom feed consumers, but AtomPub servers could also use it as an &#8220;idempotence identifier&#8221;, similar to how MSMQ uses the message ID. If you end up with multiple entries with the same entry ID, discard all but one.<\/p>\n<p>So by creating a unique identifier on the client side and logging that identifier on the server side, we can make any REST service idempotent. We can make it a durable service if we write the outgoing message &#8211; with the message ID we generate &#8211; to a durable store before trying to send it. If you write it to a durable store within the scope of a local transaction, you&#8217;re even closer to duplicating MSMQ&#8217;s functionality, yet the only protocol requirement beyond vanilla HTTP is having a unique message ID.<\/p>\n<p>The one problem with the Atom entity ID approach is that it requires cracking the message in order to see if we should process it. For REST services, I would think we&#8217;d want to stick the idempotence identifier in an HTTP header. We already headers to implement <a href=\"http:\/\/fishbowl.pastiche.org\/2002\/10\/21\/http_conditional_get_for_rss_hackers\">conditional GET<\/a>, why not a header for what amounts to conditional POST?<\/p>\n<p>Turns out such a header exists in the <a href=\"http:\/\/www.ietf.org\/rfc\/rfc4130.txt\" target=\"_blank\">AS2 spec<\/a>, i.e. &#8220;MIME-Based Secure Peer-to-Peer Business Data Interchange Using HTTP&#8221;. AS2 defines a <a href=\"http:\/\/tools.ietf.org\/html\/rfc4130#section-5.3.3\" target=\"_blank\">Message-Id HTTP header<\/a> which &#8220;SHOULD be globally unique&#8221;. In the case of <a href=\"http:\/\/tools.ietf.org\/html\/rfc4130#section-5.5\" target=\"_blank\">an HTTP error<\/a>, AS2 specifies the &#8220;POST operation with identical content, including same Message-ID, SHOULD be repeated&#8221; and that &#8220;Servers SHOULD be prepared to receive a POST with a repeated Message-ID.&#8221; I assume this implies a server shouldn&#8217;t process a message with the same ID twice.<\/p>\n<p>So what would a durable REST service look like? I think like this:<\/p>\n<ol>\n<li>Sending system records the intent to send a message by saving it to a local durable store, potentially in the scope of a local transaction. As part of saving the message, a unique message id is generated (I&#8217;d use a <a href=\"http:\/\/en.wikipedia.org\/wiki\/Guid\" target=\"_blank\">GUID<\/a>, but as long as it&#8217;s unique it doesn&#8217;t matter.)\n<\/li>\n<li>A background thread in the sending system monitors the durable message store. When a new to-be-sent message arrives, the thread POSTs it to the destination, setting the Message-Id HTTP header to the unique identifier generated in step 1.\n<\/li>\n<li>The receiving system stores the Message-Id header value in a log table and processes the received message, potentially in the scope of a local transaction. Optionally, it can store the return message (if there is one) in the durable store as well.\n<\/li>\n<li>If the sending system doesn&#8217;t receive a 2xx status code, it rePOSTs the message to the receiving system until it does.\n<\/li>\n<li>If the receiving system receives a message that&#8217;s already listed in the log table, it ignores it and returns a success status code. Optionally, if the return message has been saved, the receiving system can resend the return message as long as it doesn&#8217;t redo the work.<\/li>\n<\/ol>\n<p>This seems like a better approach than my original direction of doing REST over a durable protocol like MSMQ or SSB. What do you think? <\/p>\n<p>UPDATE &#8211; <a class=\"commentPermalinkStyle\" href=\"http:\/\/appside.blogspot.com\/\" rel=\"nofollow\"><font color=\"#017cbc\">Erik Johnson<\/font><\/a> <a href=\"http:\/\/devhawk.net\/CommentView,guid,becd3f0f-5484-4a9e-ae6a-4a61cebc2a4a.aspx#commentstart\">points out<\/a> that an HTTP POST&#8217;s idempotency is &#8220;left unsaid&#8221;. So my statement that &#8220;POST isn&#8217;t idempotent&#8221; isn&#8217;t quite correct. POST isn&#8217;t <em>naturally<\/em> idempotent. I&#8217;ve updated the post accordingly.<\/p>\n<\/p>\n<hr \/>\n<p>[1] Technically, the MSMQ message ID isn&#8217;t universally unique as it is a 16 byte GUID representing the source system + a 4 byte sequence number. The sequence number can rollover, after sending 2^32 messages. In practice, rolling over the message ID after 4 billion messages is rarely an issue.<\/p>\n","excerpt":"<p>A while back I wondered if it&#8217;s still REST if you don&#8217;t use HTTP. The reason I wondered that is because like many I&#8217;ve become disillusioned with the WS-* stack over time and see REST as a viable alternative to all that spec-driven complexity. However, just because I&#8217;m looking to REST means I&#8217;m willing to [&hellip;]<\/p>\n","date":"2007-12-05 10:50:40","modified":"2007-12-05 10:50:40","categories":[],"tags":[{"id":201,"slug":"durable-messaging","title":"Durable Messaging","description":"","post_count":5},{"id":181,"slug":"rest","title":"REST","description":"","post_count":18}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":1994,"name":"Erik Johnson","url":"http:\/\/appside.blogspot.com","date":"2007-12-05 21:40:18","content":"<p>> Given that POST isn&#8217;t idempotent&#8230;<\/p>\n<p>But like you said, idempotency is in the eye of the HTTP implementor.  The HTTP spec says that PUT and GET are meant to be idempotent and leaves the idempotency (is that a word?) of POST lesft unsaid.  It doesn&#8217;t say POST MUST NOT be idempotent.  <\/p>\n<p>One issue with PUT is that the spec says that I am saving a whole resource (replacing the data rep) which implies a programming model around that semantic.  There&#8217;s nothing wrong with that, but it might not be the best fit for Pat&#8217;s withdraw-a-billion-bucks scenario.<\/p>\n<p>POST just says I am handing data to a processor.  Your notion of having the implementing the idempotent behavior using HTTP headers is fine.  So does putting the message ID tags inside the payload.  Since the HTTP spec leaves the implementation of idempotency up to you (for all verbs) both are equally cool for RESTful apps.<\/p>\n<p>Anyway, I just wanted to point out that POST doesn&#8217;t have to mean non-idempotent &#8212; and then I started rambling as usual.<\/p>\n","parent":0},{"id":1995,"name":"DevHawk","url":"","date":"2007-12-05 23:35:11","content":"<p>Good point, Erik. POST isn&#8217;t *naturally* idempotent. I&#8217;ll change the text to reflect your comment.<\/p>\n","parent":0},{"id":1996,"name":"Libor SOUCEK","url":"http:\/\/lsblog.wordpress.com","date":"2007-12-06 06:02:19","content":"<p>Wouldn’t be generally safer base idempotent behavior rather on business data then on some kind of communication protocol?<\/p>\n<p>Sure with described approach you will discard all duplicate messages right on transport layer which is perfectly legal and saves recipient service from unnecessary processing but works only for certain scenarios.<\/p>\n<p>Especially this approach works poorly in case message source service makes “failover” to different HW\/geo location where it might “rerun” already once processed messages (i.e. source service tries to ensure all data were rely processed) and start with completely different message numbers. This is more highlighted with use of GUID which is not tight to data content what so ever.<\/p>\n<p>With GUID as “Unique ID” you have yet another problem. You would not be able on message recipient side define order in which messages were generated\/send. This might be problem not only on UDP based messaging protocol as widely known. Another case is when sending data from two location after service failover. And much less known\/mentioned message reordering problem is surprisingly on TCP based connection in certain network configurations as well (e.g. prime example of this behavior is on highly resilient network setup where are routers cross connected to ensure at least one network route cross routers is always available).<\/p>\n<p>I’m not saying is not usable for your scenarios but it could be generalized more. All depends on requirements and environment you are running in.<\/p>\n","parent":0},{"id":1997,"name":"Mark Baker","url":"http:\/\/www.markbaker.ca","date":"2007-12-06 12:09:25","content":"<p>FWIW, POST is idempotent by definition.  Erik&#8217;s confusing what the server does with the message with what the message means.  It is not inconsistent for the former to be idempotent and the latter to be non-idempotent.<\/p>\n<p>Also, re APP and PUT vs. POST, PUT can only be used for creation when the client knows the URI it is to use.  As it doesn&#8217;t in the typical scenario, the server has to provide the URI so POST is appropriate.<\/p>\n","parent":0},{"id":1998,"name":"Erik Johnson","url":"http:\/\/appside.blogspot.com","date":"2007-12-06 15:53:11","content":"<p>Mark,  I&#8217;m not the guru &#8212; am I looking at the wrong spec (it wouldn&#8217;t be the first time)?  <\/p>\n<p>RFC-2616 section 9.1.2 (Idempotent Methods) says:  &#8220;Methods can also have the property of &#8220;idempotence&#8221;&#8230;The methods GET, HEAD, PUT and DELETE share this property.&#8221;<\/p>\n<p>Looking further down at the section describing POST, I don&#8217;t see anything about idempotency.  <\/p>\n","parent":0},{"id":1999,"name":"Mark Baker","url":"http:\/\/www.markbaker.ca","date":"2007-12-07 04:20:36","content":"<p>Yes, of course.  I meant POST was *non*-idempotent.<\/p>\n","parent":0}],"attachments":[],"comment_count":6,"comment_status":"closed","custom_fields":{"dasblog_entryid":["becd3f0f-5484-4a9e-ae6a-4a61cebc2a4a"],"dasblog_compressedtitle":["Durable+And+RESTful"],"dasblog_compressedtitleunique":["2007\/12\/05\/Durable+And+RESTful"]}},"previous_url":"http:\/\/devhawk.net\/2007\/12\/04\/functional-understanding\/","next_url":"http:\/\/devhawk.net\/2007\/12\/07\/morning-coffee-128\/"}