{"status":"ok","post":{"id":1026,"type":"post","slug":"fantasy-free-code-and-the-sharepoint-model","url":"http:\/\/devhawk.net\/2007\/08\/09\/fantasy-free-code-and-the-sharepoint-model\/","status":"publish","title":"Fantasy, Free Code and the SharePoint Model","title_plain":"Fantasy, Free Code and the SharePoint Model","content":"<p>It might sounds like a fantasy, but Nick Malik really wants free code. He started <a href=\"http:\/\/blogs.msdn.com\/nickmalik\/archive\/2007\/06\/19\/not-crazy-just-lateral-thinking.aspx\" target=\"_blank\">talking about it<\/a> a few months ago when he was <strike>getting raked over the coals by<\/strike> debating Mort with the agile .NET community:<\/p>\n<blockquote><p>Rather than look at &#8220;making code maintainable,&#8221; what if we look at <u>making code free<\/u>.  Why do we need to maintain code?  Because code is expensive to write.  Therefore, it is currently cheaper to fix it than rewrite it.  On the other hand, what if code were cheap, or free?  What if it were cheaper to write it than maintain it?  Then we would never maintain it.  We&#8217;d write it from scratch every time.  <\/p>\n<\/blockquote>\n<p>Then about a week ago, <a href=\"http:\/\/blogs.msdn.com\/nickmalik\/archive\/2007\/07\/30\/free-code-getting-it-out-of-the-applications-business.aspx\" target=\"_blank\">he laid out the reasons<\/a> why free code would be a good thing. At a high level (Nick&#8217;s blog has the details), those reasons are:  <\/p>\n<ol>\n<li>Lower the cost of IT through reduced skill requirements.  <\/li>\n<li>The speed of development goes up.  <\/li>\n<li>Projects become more agile.  <\/li>\n<li>Solution quality goes up.  <\/li>\n<\/ol>\n<p>Talking about the benefits of free code is sorta like talking about talking about the benefits of dating a movie star. The benefits are actually pretty obvious, but talking about them doesn&#8217;t really help you get there from here. <\/p>\n<p>Actually, Nick isn&#8217;t suggesting that all code can be free. He&#8217;s focused on separating out business process modeling\/development from the rest of software development. In essence, he&#8217;s describing a new class of developer (should we call the persona Nick as an homage?) who needs their own class of tools and for the IT department to &#8220;formally&#8221; allow them to &#8220;easily develop, test, and deploy [aka host] their processes.&#8221; For the most part, these BP developers wouldn&#8217;t be traditional developers. They&#8217;d be more like software analysts who do the work directly instead of writing specs for developers.<\/p>\n<p>I call this separation of business and IT concerns the SharePoint Model. <a href=\"http:\/\/www.microsoft.com\/sharepoint\/default.mspx\" target=\"_blank\">SharePoint<\/a>, IMO, does an amazing job of separating the concerns and needs of business and IT users when it comes to running intranet web sites. Only the truly geeky stuff that requires specialized access, knowledge or equipment &#8211; installing the SharePoint farm in the first place, keeping it backed up, installing service packs, etc. &#8211; is done by IT. Everything else is done by the business folks. Need a new site? Provision it yourself. Need to give your v-team members access to it? Do it yourself. I see similarities in the free BP code approach Nick&#8217;s suggesting. I&#8217;d even argue that SharePoint is the natural &#8220;host&#8221; for such business processes. It already <a href=\"http:\/\/msdn2.microsoft.com\/en-us\/library\/ms414613.aspx\" target=\"_blank\">supports WF<\/a> and can provide access to back-end enterprise data via the <a href=\"http:\/\/msdn2.microsoft.com\/en-us\/library\/ms563661.aspx\" target=\"_blank\">Business Data Catalog<\/a>. <\/p>\n<p>On the other hand, some of what Nick suggests seems fairly impractical. For example, he thinks IT should &#8220;formally and officially take control of managing the common enterprise information model and the business event ontology.&#8221; First off, who officially manages this today? Does such an official information model or event ontology even exist? I&#8217;m guessing not. That means you&#8217;ve got to start by getting the business people to agree on one. That&#8217;s usually a sucker&#8217;s bet. Nick also suggests we &#8220;reduce the <a href=\"http:\/\/www.joelonsoftware.com\/articles\/LeakyAbstractions.html\" target=\"_blank\">leaky abstractions<\/a>&#8221; in our services. To suggest this is even possible seems incredibly naive. <\/p>\n<p>The good news is the things that will work (evolving BP into its own development discipline, building custom tools for BP development, getting IT into the BP hosting business) don&#8217;t depend in any way on the things that wont work (getting lots of folks to agree on anything, <strike>breaking the laws of physics<\/strike>, overcoming the law of leaky abstractions). I&#8217;m not sure it will result it truly free code, but it sure would bring the costs down dramatically. Thus, I think most of Nick&#8217;s free code vision is quite practical and not a fantasy at all. <\/p>\n<p>As for dating a movie star, you&#8217;re on your own.<\/p>\n","excerpt":"<p>It might sounds like a fantasy, but Nick Malik really wants free code. He started talking about it a few months ago when he was getting raked over the coals by debating Mort with the agile .NET community: Rather than look at &#8220;making code maintainable,&#8221; what if we look at making code free.  Why do [&hellip;]<\/p>\n","date":"2007-08-09 16:53:35","modified":"2007-08-09 16:53:35","categories":[{"id":204,"slug":"development","title":"Development","description":"","parent":0,"post_count":165}],"tags":[{"id":334,"slug":"business-process-management","title":"Business Process Management","description":"","post_count":1},{"id":302,"slug":"sharepoint","title":"SharePoint","description":"","post_count":8}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["b8a95052-7133-4b22-8058-5dfd6d931fcc"],"dasblog_compressedtitle":["Fantasy+Free+Code+And+The+SharePoint+Model"],"dasblog_compressedtitleunique":["2007\/08\/09\/Fantasy+Free+Code+And+The+SharePoint+Model"]}},"previous_url":"http:\/\/devhawk.net\/2007\/08\/09\/another-initimportantthing-approach\/","next_url":"http:\/\/devhawk.net\/2007\/08\/13\/retire-the-tenets\/"}