{"status":"ok","post":{"id":717,"type":"post","slug":"rod-smith-on-do-it-yourself-it","url":"http:\/\/devhawk.net\/2006\/03\/08\/rod-smith-on-do-it-yourself-it\/","status":"publish","title":"Rod Smith on Do It Yourself IT","title_plain":"Rod Smith on Do It Yourself IT","content":"<p>This post is a combination of Rod’s short keynote and his breakout session I went to right after lunch. Rod’s meta point is that lots of enterprise applications don’t get built because they aren’t affordable to write. <a href=\"http:\/\/www.thelongtail.com\/\">Chris Anderson<\/a> would call this the <a href=\"http:\/\/bnoopy.typepad.com\/bnoopy\/2005\/03\/the_long_tail_o.html\">long tail of software<\/a>. Rod introduced the idea of “situational applications” – something you build for a specific situation then you throw it away. I actually prefer the term “disposable application” since it focuses on the fact you will throw it away.<\/p>\n<p>He demoed a proof of concept called QEDWiki. QED == Quick and Easily Done. It seems a lot like <a href=\"http:\/\/www.jot.com\/\">JotSpot<\/a>. You have a palette of components that you can drag onto the page and wire together quickly. They built a slightly interesting application to mashup store locations with weather data in under five minutes. <\/p>\n<p>In the breakout, they got into much more detail on QEDWiki. There’s a wiki programming language &#8211; I&#8217;m guessing conceptually similar to <a href=\"http:\/\/www.flexwiki.com\/default.aspx\/FlexWiki\/WikiTalk.html\">WikiTalk<\/a> -and a AJAX-y drag and drop authoring environment that sits on top of it. Pretty cool, but as he got under the hood it seemed pretty complex. The amount of wiki code the visual authoring environment spits out is significant and the implementation of one of the reusable components is massive. Building a wrapper component for the <a href=\"http:\/\/developer.yahoo.com\/traffic\/index.html\">Yahoo Traffic<\/a> service took “around a day”. That seem large to you?<\/p>\n","excerpt":"<p>This post is a combination of Rod’s short keynote and his breakout session I went to right after lunch. Rod’s meta point is that lots of enterprise applications don’t get built because they aren’t affordable to write. Chris Anderson would call this the long tail of software. Rod introduced the idea of “situational applications” – [&hellip;]<\/p>\n","date":"2006-03-08 00:14:50","modified":"2006-03-08 00:14:50","categories":[],"tags":[{"id":297,"slug":"etech","title":"ETech","description":"","post_count":15},{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["038bbfcf-f5b4-4b41-8ca8-994f3c4ff56c"],"dasblog_compressedtitle":["Rod+Smith+On+Do+It+Yourself+IT"],"dasblog_compressedtitleunique":["2006\/03\/08\/Rod+Smith+On+Do+It+Yourself+IT"]}},"previous_url":"http:\/\/devhawk.net\/2006\/03\/08\/assorted-remaining-etech-day-two-keynotes-sessions\/","next_url":"http:\/\/devhawk.net\/2006\/03\/08\/michael-kunivsky-and-matt-cottam-on-sketching-in-hardware\/"}