{"status":"ok","post":{"id":490,"type":"post","slug":"starting-in-on-sql-service-broker","url":"http:\/\/devhawk.net\/2004\/12\/07\/starting-in-on-sql-service-broker\/","status":"publish","title":"Starting in on SQL Service Broker","title_plain":"Starting in on SQL Service Broker","content":"<p>Since <a href=\"http:\/\/atlasbrandview.blogspot.com\/\">Norman<\/a> joined the team a few months ago, I’m no longer in firefighter mode. For about six months my team was short a marketing manager and I ended up picking up a bunch of extra duties. For example, I took over as TechEd architect track owner when out previous marketing manager left. I don’t know much about marketing, but I guess I did OK – I received a Marketing Impact Award for my work on TechEd. However, I’m very happy to have handed those marketing responsibilities back to their rightful owner. Even still, Norman is trying to educate me about marketing. He made me read the first two chapters of <a href=\"http:\/\/www.amazon.com\/o\/ASIN\/002900151X\">Building Strong Brands<\/a> by David Aaker. I actually got thru the first three chapters before borrowing <a href=\"http:\/\/www.amazon.com\/o\/ASIN\/1576750744\">Birth of the Chaordic Age<\/a> by Dee Hock from my father at Thanksgiving. <\/p>\n<p>You would think that I would now have more time for blogging, but alas that has not been the case. When I was firefighting, I had no time for planning. Now, of course, I do. So between planning and thanksgiving vacation I’ve just been too busy to blog much.<\/p>\n<p>One thing I’m getting into recently is SQL Service Broker. I’m working on an interesting community project that is building on top of SSB. Luckily, one of the <a href=\"http:\/\/blogs.msdn.com\/pathelland\">primary architects<\/a> of SSB sits down the hall from me. Of course, not everyone is so lucky, so watch this space as I dig deeper on SSB. A good place to start is the <a href=\"http:\/\/msdn.com\/library\/en-us\/dnsql90\/html\/sqlsvcbroker.asp\">SSB First Look<\/a> article. In order to start getting a handle on SSB, I ported the Hello World example from that article from T-SQL to C#. It’s a bit tricky, as there is no SSB-specific framework – you just use SqlCommand to execute SSB commands like BEGIN DIALOG and RECEIVE – but otherwise it’s pretty straightforward. My sample also demonstrates using the new SQL Management Objects to create databases and SSB related objects (message types, contracts, queues and services). <a href=\"http:\/\/cid-0d9bc809858885a4.office.live.com\/self.aspx\/DevHawk%20Content\/BlogFiles\/HelloSSB.zip\">Here’s the code<\/a> – enjoy.<\/p>\n","excerpt":"<p>Since Norman joined the team a few months ago, I’m no longer in firefighter mode. For about six months my team was short a marketing manager and I ended up picking up a bunch of extra duties. For example, I took over as TechEd architect track owner when out previous marketing manager left. I don’t [&hellip;]<\/p>\n","date":"2004-12-07 15:43:12","modified":"2004-12-07 15:43:12","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2730,"name":"言情小说","url":"http:\/\/www.readnovel.com\/ch\/2.html","date":"2004-12-14 21:09:49","content":"<p>Too pity! I can’t help crying for you.<\/p>\n","parent":0},{"id":2731,"name":"言情小说","url":"http:\/\/www.readnovel.com\/ch\/2.html","date":"2004-12-14 21:13:13","content":"<p>Too pity! I can’t help crying for you.<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["57beeec2-ee56-4510-9232-9bde67f945da"],"dasblog_compressedtitle":["Starting+In+On+SQL+Service+Broker"],"dasblog_compressedtitleunique":["2004\/12\/07\/Starting+In+On+SQL+Service+Broker"]}},"previous_url":"http:\/\/devhawk.net\/2004\/12\/07\/pretty-soon-ill-need-a-friends-family-blogroll\/","next_url":"http:\/\/devhawk.net\/2004\/12\/07\/teched-2005-call-for-papers\/"}