{"status":"ok","post":{"id":639,"type":"post","slug":"code-is-model","url":"http:\/\/devhawk.net\/2005\/10\/05\/code-is-model\/","status":"publish","title":"Code is Model","title_plain":"Code is Model","content":"<p>In the foreword to <a href=\"http:\/\/www.microsoft.com\/architecture\/default.aspx?pid=journal.3\">Architecture Journal 3<\/a>, I wrote the following:<\/p>\n<blockquote><p>Abstraction is the architect&#8217;s key tool for dealing with complexity. We&#8217;ve seen the evolution of architectural abstractions techniques such as models and patterns; however, we have yet to realize much in the way of measurable value from them. Models and patterns are useful for communicating effectively with our peers, but so far they haven&#8217;t helped drastically reduce the amount of resources it takes to build and operate a system. In order to continue to deal with increasing complexity, we need to get much more pragmatic about using abstraction to solve problems.<\/p>\n<\/blockquote>\n<p>Because the lack of measurable value to date, the IT industry at large has come to view models at best as &#8220;pretty pictures&#8221; and at worst as a pointless waste of time and resources. But the reality is, we use models in the IT industry all the time. I don&#8217;t know what you&#8217;re favorite modeling tool it, but my current favorite is C#. Before that was VB and before that was C++. I realize some of my readers might be more partial to Java, Ruby, or even Assembly. But the reality is: all of these so-called &#8220;higher level&#8221; programming languages are simply models of the CPU execution environment. <\/p>\n<p>The only code that the CPU can understand is machine code. But nobody wants to write and debug all their code using 0’s and 1’s. So we move up a level of abstraction and use a language that humans can read more easily and that can be automatically translated (i.e. compiled) into machine code the CPU can execute. The simplest step above machine code is assembly language. But ASM isn&#8217;t particularly productive so work with, so the industry has continuously raised the level of abstraction in the languages they use. C is a higher level of abstraction than ASM, adding concepts like types and functions. C++ is a higher level of abstraction than C, adding concepts like classes and inheritance. Each of these levels of abstraction presents a new model of the execution environment with new features that make programming more productive (and sometimes <a href=\"http:\/\/devhawk.net\/2005\/09\/08\/Portability+Without+Productivity.aspx\">more portable<\/a>). Different languages offer different models of the execution environment. For example, the Ruby model of the execution environment allows for the manipulation of class instances while the C++ model allows for multiple inheritance. This isn&#8217;t to say one is better than the other &#8211; they are just different. <\/p>\n<p>In the past decade, we&#8217;ve seen the rise in popularity of VM based programming environments &#8211; primarily Java and CLR. In these environments, there are multiple models at work. CLR languages and Java are models above the underling VM execution environment. The VM execution environment is, in turn, a model of the physical execution environment. As an example, a C#\/Java program is translated into IL\/bytecode at compile time and then from IL\/bytecode to machine code at runtime. So in these VMs, two model translations have to occur in order to go from programming language to machine code. It turns out that this multiple step translation approach is also useful in non-VM environments. For example, the original C++ compiler output vanilla C code which was, in turn, compiled with a vanilla C compiler. C# and Java use a similar approach, except that the second translation occurs at runtime, not compile time.<\/p>\n<p>So if Code is Model, what can we learn from looking at the success of mainstream text-based programming languages to help us in the development of higher abstraction modeling languages that are actually useful. This isn&#8217;t an exhaustive list, but here are a few things (tenets?) I&#8217;ve thought of:<\/p>\n<ul>\n<li><u><b>Models must be Precise<\/b><\/u><br \/>There must be no ambiguity in the meaning of the elements in a model. In C#, every statement and keyword has an exact well-defined meaning. There is never a question as to what any given piece of C# code means. There may be context-sensitive meanings, such as how the keyword &#8220;using&#8221; has different meanings in C# depending on where it is used. If you don&#8217;t have a similar level of precision in your model, there&#8217;s no way to transform it to lower abstraction models in a deterministic fashion. Models that can&#8217;t be transformed into lower abstraction models are nothing more than pretty pictures &#8211; perhaps useful for communication with other people on the project, but useless as development artifacts.\n<\/li>\n<li><u><b>Model Transformation must be Deterministic<\/b><\/u><br \/>By definition (or at least by convention), models are at a higher level of abstraction than both your execution domain and mainstream programming languages &#8211; perhaps significantly higher. In order to derive value from a model, you must be able to transform it into the execution domain. Like the C# to IL to machine code example, the model transformation may comprise multiple steps. But each transformation between models must be as precise as the models themselves. When you compile a given piece of C# code, you get the same IL output every time. However, this transformation can vary across target models. For example, when you run a managed app on a x86 machine you get different machine code than if you ran it on an x64 machine.\n<\/li>\n<li><u><b>Models must be Intrinsic to the Development Process<br \/><\/b><\/u>Even if you have precise models and deterministic transformations, you have to make them first class citizens of the development process or they will become outdated quickly. How often have you blueprinted your classes with UML at the start of the project, only to have that class diagram be horribly out of date by the end of the project? In order to keep models up to date, they must be used through-out the development process. If you need to make a change, make the change to the model and then retransform into the execution domain. Think of C# and IL &#8211; do we use C# as a blueprint, transform once to IL and then hand edit the IL? No! We change the C# directly and retransform into IL. We need to have the same process even as we move into higher levels of abstraction.\n<\/li>\n<li><u><b>Models Aren&#8217;t Always Graphical<br \/><\/b><\/u>Some things are best visualized as pictures, some things aren&#8217;t. To date, we&#8217;re much better at graphically modeling static structure than dynamic behavior. That&#8217;s changing &#8211; for example, check out the <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/sdk\/htm\/ebiz_prog_useod.gif\" class=\"grouped_elements\" rel=\"tc-fancybox-group639\">BTS<\/a> or <a href=\"http:\/\/www.windowsworkflow.net\/images\/Temp\/WWF%20Designer%20Screenshot%20-%20thumbnail2.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group639\">WF<\/a> tools. But generally, it&#8217;s easier to model structure than behavior graphically. Don&#8217;t try and put a square peg in a round hole. If a text based language is the best choice, that&#8217;s fine. Think about the Windows Forms Designer in VS &#8211; you use a graphical &#8220;language&#8221; to lay out your user interface, but you implement event handlers using a text-based language.\n<\/li>\n<li><u><b>Explicitly Call Out Models vs. Views <br \/><\/b><\/u>One of the areas that I get easily confused about is model views. If I&#8217;m looking at two different model visualizations (text or graphical), when are they different models and when are they views into the same model. People don&#8217;t seem to care much one way or the other, but I think the difference is critical. For example, a UML class model and a C# class are two separate models &#8211; you need a transformation to go back and forth between them. However, the VS <a href=\"http:\/\/blogs.msdn.com\/classdesigner\/\">Class Designer<\/a> is a graphical view into the model described by the C# class definitions. Changes in one view are immediately visible in the other &#8211; no transformation required. If you look at the <a href=\"http:\/\/blogs.msdn.com\/classdesigner\/archive\/2005\/07\/29\/444501.aspx\">Class Designer file format<\/a>, you&#8217;ll notice only diagram rendering specific information is stored (ShowAsAssociation, Position, Collapsed, etc.). I guess this could fall under &#8220;Models must be Precise&#8221; &#8211; i.e. you should precisely define if a given visualization is a view or a model &#8211; but I think this area is muddy enough to warrant it&#8217;s own tenet.<\/li>\n<\/ul>\n<p>I&#8217;m sure there are more thoughts for this list, but that&#8217;s a good start. Please feel free to leave your opinion on these tenets and suggestions for new ones in <a href=\"http:\/\/devhawk.net\/CommentView,guid,7d6d6cb2-2300-4e39-8ad8-a2910d81d498.aspx\">my comments<\/a>.<\/p>\n","excerpt":"<p>In the foreword to Architecture Journal 3, I wrote the following: Abstraction is the architect&#8217;s key tool for dealing with complexity. We&#8217;ve seen the evolution of architectural abstractions techniques such as models and patterns; however, we have yet to realize much in the way of measurable value from them. Models and patterns are useful for [&hellip;]<\/p>\n","date":"2005-10-05 14:55:20","modified":"2005-10-05 14:55:20","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2850,"name":"Steven Kelly","url":"http:\/\/www.metacase.com\/blogs\/stevek\/blogView","date":"2005-10-06 04:53:44","content":"<p>[Hmm, trying to submit a comment returned me to the same page with my comment text, let's try again...]<\/p>\n<p>Great piece of writing, Harry! Here are some additions (also added in my blog, link above):<\/p>\n<p>Models Aren&#8217;t Always Graphical:<br \/>\nThe only alternative to graphical models that you mention is text. I&#8217;d like to add matrices and tables. A matrix is normally like in IBM&#8217;s Business Systems Planning, with objects on the axes and relationships marked in the cell at the intersection of their object. A table is basically an ordered list of objects and their properties: graphical models are otherwise poor at representing an ordered list. It&#8217;s probably also useful to distinguish &#8220;standard&#8221; bubble-and-line graphical models from things like Sequence Diagrams, Constraint Diagrams, Spider Diagrams and even UI layouts, where the exact position of elements, and their position relative to each other, has semantic content.<\/p>\n<p>To return to text: Unfortunately, text doesn&#8217;t integrate well with other models, primarily because it has no notion of object identity. If I write a piece of code to go with a model, I often want to use the name of one of the model&#8217;s objects in the code, but there is currently no good way to do this. Copying and pasting loses the link, i.e. if I update the name in the model, it will (at least in a half-way decent modeling tool) update everywhere else in the model where that name is visible, but the text will still contain the old value. <\/p>\n<p>Clearly, we need Smart Text, but exactly what that is and how it would work is an interesting research topic. Current text-based tools at best try to parse the text and cobble the links back together after changes, but that&#8217;s time consuming, error prone, and basically bolting the stable door well after the horse has left. <\/p>\n<p>I guess Intentional Programming is aiming to be something like Smart Text. My impression so far though is that the Intentional Programming crowd aren&#8217;t particularly amenable to graphical representations &#8211; &#8220;nah, we don&#8217;t want those, we can do it all in text&#8221;. Hopefully I&#8217;m wrong or that is going to change: model-driven development and Smart Text would complement each other perfectly.<\/p>\n","parent":0},{"id":2851,"name":"David Ing","url":"http:\/\/from9till2.com","date":"2005-10-06 06:59:18","content":"<p>Good points Harry. I&#8217;m not a great fan of tenets though… <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" \/> <\/p>\n<p>I whole-heartily agree that an important lesson not to forget from the &#8216;CASE-years&#8217; is that (a) we can&#8217;t lose fidelity between the execution side (code) and the design representations in any modeling approach and (b) no oceans will require boiling. It is interesting though that saying exactly what is &#8216;code&#8217; is actually getting increasingly harder to do. <\/p>\n<p>To carry on your thread, it seems to me we are heading for more and more declarative style systems definitions either at the system framework level (Workflow State persistence, XAML presentation, Policy assertions) or at the DSL&#8217;s for specific configuration points of a custom framework. The languages of C# and the like will always play the majority part, but it&#8217;s the libraries\/run-times and the like will really need the &#8216;abstraction points&#8217; more. Perhaps it&#8217;s the interface definitions (schema?) and the behaviors around those that need the most thought in terms of their expression in the model?<\/p>\n<p>Another thought is that what we lack is the common conventions for visualization of these &#8216;non-imperative&#8217; styles. To be a useful abstraction it would seem to be important to be able to relate and summarize these things concisely. Text is useful (and can be very precise) but polymetric visualizations (the sort of stuff that Edward Tufte has been on about for years) seems to be a harvestful area for models. In the last 20 years we&#8217;ve spent a lot of time working out that a class shouldn&#8217;t look like a cloud but a rectangle, for example. We did that so we could scale model bits to used from *AsASketch to *AsABluePrint. As computer system designers we obviously dont have a lot of faith in computer system tools as a reliable enabler?<\/p>\n<p>If we could let go of the UML mindset of a paper-printable-centric model representation that treats the run-time as a generic block then we could be making good progress for MDD. It&#8217;s a note of irony of course that the MDA\/MOF may be the exact opposite of what it will take to get to a next step of handling increased complexity. Maybe we should be letting go of those representations to move forward?<\/p>\n<p>We do seem to be hitting a wall with the level of complexity we have at the moment and that a &#8216;Unified&#8217; approach ain&#8217;t gonna cut it. IMO.<\/p>\n<p>PS Good &#8216;model&#8217; refresher paper here for those interested: <\/p>\n<p><a href=\"http:\/\/www.bptrends.com\/publicationfiles\/01-04%20COL%20Dom%20Spec%20Modeling%20Frankel-Cook.pdf\" rel=\"nofollow\">http:\/\/www.bptrends.com\/publicationfiles\/01-04%20COL%20Dom%20Spec%20Modeling%20Frankel-Cook.pdf<\/a> <\/p>\n<p>- David<\/p>\n","parent":0},{"id":2852,"name":"Alan Cameron Wills","url":"http:\/\/blogs.msdn.com\/alan_cameron_wills\/","date":"2005-10-06 09:41:21","content":"<p>Good stuff.<\/p>\n<p>&#8220;Models are Precise&#8221; &#8211; well:<\/p>\n<p>(a) There is a use for imprecise models. When I&#8217;m sketching an architecture on the corner of a whiteboard, I don&#8217;t need a precise semantics: I need a notation familiar enough that I can convey and discuss my ideas. What&#8217;s familiar might depend on the business context and the level of implementation detail I&#8217;m talking at &#8211; flight paths, tube map, org charts, or maybe sequence charts.<\/p>\n<p>(b) Where we do use models for precise purposes &#8211; generating code or configurations or whatever &#8211; it is useful if the precise notation is related to, and can easily degenerate into, the familiar imprecise form. So that I can quickly sketch an impression of what I want, and later fix up the detail to make it work.<\/p>\n<p>Models are Abstract &#8211; no, this wasn&#8217;t one of your headers, but I think it nearly was! Abstract means leaving stuff out; the power of it is that it lets me squeeze big ideas into my small brain. There&#8217;s less information in an abstraction.  For me, this is the essential thing that makes it a &#8220;model&#8221;: it leaves out information.<\/p>\n<p>There are several distinct ways a model can be abstract &#8211; i.e. leave out information:<\/p>\n<p> 1. Leave out unvarying assumptions.<br \/>\n   1a   C is an abstraction of ASM because it&#8217;s assumed your code follows some conventions &#8212; for example, keeping stuff on the stack while calling a subroutine. By restricting ourselves to those assumptions, we can read the code more easily; the information is put back by the compiler.  Of course, a great benefit is that we can &#8216;put back&#8217; different variants of the left-out stuff, to work atop different platforms.<\/p>\n<p>   1b   A DSL that drives a framework &#8211; for example to configure a mobile phone or a watch &#8211; is abstract because it doesn&#8217;t include the stuff that&#8217;s the same every time: the basic structure of the phones.  In the DSL, we omit the information about those assumptions, and the generators and execution framework put it information back.<\/p>\n<p> 2. Separation of concerns.<br \/>\n    A model that&#8217;s about the sequence of pages in a GUI can leave out stuff about the appearance of the pages. The appearance can be dealt with in a separate language elsewhere. Here, the separate models leave out the information dealt with elsewhere, and the left-out information is put back when the different aspects or viewpoints are composed (by whatever mechanism).<\/p>\n<p>(I suppose that really (1) is a particular case of (2) &#8212; the place where you choose what platform you want to implement on is a separate language, and the choice of compiler is the composition mechanism.)<\/p>\n<p> 3. Indeterminacy.<br \/>\n    The model is abstract because some of the information hasn&#8217;t been determined or decided yet; or is maybe different every time. So for example:<br \/>\n   &#8211; an HTML page specifies a sequence of words, but it rarely defines exactly how they&#8217;re arranged on a screen &#8212; that depends on the width of the window etc.<br \/>\n   &#8211; programs in C# specify a sequence of behavior, but don&#8217;t specify the exact timings of events; by contrast, MIDI defines the exact timings of the musical notes.<br \/>\n   &#8211; a test script defines a result (like &#8220;out*out==in&#8221;, or &#8220;X less than 12&#8243;) without saying how you might achieve it, nor even exactly what the result must be &#8212; just some conditions it must fulfill.<br \/>\n   &#8211; a specification &#8211; whether it&#8217;s formal or informal, a slide show or a test script, or a set of example instances, or just a list of bullet points &#8211; is a model. If written well (!) it allows you to discuss the system or solution, without including all the fine detail.<\/p>\n<p>To me, the indeterminate kind of abstraction is a very important kind of model in software engineering. It allows you to talk sensibly about things without having decided everything yet.  This is an essential, because you can&#8217;t decide everything all at once.  <\/p>\n<p>Programming languages aren&#8217;t terribly good at this &#8211; they tend only to make sense once all the decisions have been made.  While we&#8217;re half-way through a design, I want something that helps me think and talk about half-formed stuff. When working more towards the code, I want things like sequence diagrams etc; when more at the business end, I want languages appropriate to the kind of business domain; and the more I work in a particular domain, the more I want languages attuned to that domain. But again: if it&#8217;s only good at expressing finished ideas, it&#8217;s a kind of programming language; for me, a real *modeling* language is one that helps me while I&#8217;m developing the ideas.<\/p>\n","parent":0},{"id":2853,"name":"David Ing","url":"http:\/\/from9till2.com","date":"2005-10-06 12:24:19","content":"<p>Hello Alan &#8211; I almost agree.<\/p>\n<p>I think imprecise *Sketch Models are &#8216;ok&#8217;, and are in many ways, they are where we are now, i.e. UML2. I just wanted to add a thought though.<\/p>\n<p>But [and at this point I think it's fair to claim a coup d'etat on Harry's blog, just by sheer weight of text] I also think Sketching ability inhibits us slightly from keeping the models nice and tight to the execution-side. One of my greatest fears (goodness, that sounds over-dramatic) is in that progress in Modeling will be held back by going through a number of new rounds of gathering consensus around over a common display notation. If we can&#8217;t degenerate for pen&#038;board the Model notation then so be it &#8211; the steam train rolls on, but if we can, then great; just don&#8217;t want to sacrifice anything for it. <\/p>\n<p>I think that the benefits of a sketched\/shared notation are actually only a small part of the battle in making sure that two people are sharing the same context when designing something. It&#8217;s often all &#8216;about the run-time&#8217; and how well you both share knowledge of it. The sketched rectangles help like they helped pattern languages, you can still talk at cross purposes for as long as you can keep reality at bay. RE:What most people think a Singleton or even MVC patterns do.<\/p>\n<p>Also, as soon as the model becomes an purely optional part of the development cycle is where it runs the risk of being irrelevant and seen as a withering design artifact for &#8216;that guy in an office down the hall&#8217;. <\/p>\n<p>Put another way, I&#8217;d trade some common Sketch notation ability any day of the week, as long as it meant I could always get to an execution &#8216;vehicle&#8217; and could model early in terms of validating my ideas with the framework&#8217;s help, i.e. rather than the whiteboard&#8217;s. I want to &#8216;run&#8217; my model as a part of an iterative design process?<br \/>\nWith the frameworks getting so complex now then the gap between being able to try your ideas from some sort of limited notation into actually running them is getting smaller. We seem to be growing &#8216;rails&#8217; all the time, let&#8217;s make use of that. <\/p>\n<p>Anyhoo, I would be tempted to rename &#8216;Models must be Precise&#8217; with something like &#8216;Models must be in Context&#8217; or &#8216;Models make Assumptions&#8217; or even &#8216;Models Miss Things Out We Already Know Because Our Brains Are Too Small&#8217;. I like the last one best.<\/p>\n<p>I did like your comments on abstraction very much, but for me personally I sway towards a modeling language that helps me validate my ideas early rather than share them early.<\/p>\n<p>- David<\/p>\n","parent":0},{"id":2854,"name":"Arnon Rotem-Gal-Oz","url":"http:\/\/www.rgoarchitects.com","date":"2005-10-06 14:15:46","content":"<p>[also appears in my blog]<br \/>\nHi Harry,<\/p>\n<p>While I tend to agree that there is a place for precise formal models that can be transformed easily to lower levels.<br \/>\nI would also like to argue that<br \/>\n\t○ I think that imprecise models are also very useful, since at different points in time during the development you cannot fully specify all the finest details (even if for the &#8220;current&#8221; level of abstraction) esp. since most projects these days are iterative.<br \/>\n\t○ Which brings me to the next point &#8211; for imprecise models &#8211; I don&#8217;t necessarily think that there&#8217;s a need to keep (all of) them updated during the development life-cycle. The high-level designs can be replaces by detailed designs and they in turn can be replaces with the code itself &#8211; good code explains itself beautifully <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/>  .<br \/>\n\t○ You should carefully weight the ROI for creating such a precise model. For example I happened to work on a large (hundreds of man-year) project where the initial thought was to use a tool (Vitech&#8217;s Core (<a href=\"http:\/\/www.vtcorp.com\/overview.html\" rel=\"nofollow\">http:\/\/www.vtcorp.com\/overview.html<\/a>) ) to for requirements analysis. The benefit was that (if done right) the model created can be &#8220;run&#8221; using their built-in simulator. After spending more than half a year (of a rather large team) we finally decided to drop this precise model for a much less precise model of use-cases which allow for a varying level of abstraction. It should be noted though, that (cross-subsystems) use cases are later refined into a DSL  which is actively used for generating cross-subsystem interfaces and simulate  missing system during  integrations.<br \/>\n\t○ Another point from the former example is on the timing of requiring the precision. Modeling tools should allow several levels of precision, since in earlier stages you (usually) cannot determine all the bits and bytes that will allow for a &#8220;deterministic transformation&#8221; <\/p>\n<p>Just my 2 cents <\/p>\n","parent":0},{"id":2855,"name":"Magnus Christerson","url":"","date":"2005-10-09 08:51:51","content":"<p>Great post, Harry!<\/p>\n<p>We often use the term &#8220;higher level of abstraction&#8221; as the one and only right answer to manage complexity. A better description would be to use the &#8220;appropriate level of abstraction&#8221; for the task at hand and I blogged on it here <a href=\"http:\/\/blog.intentionalsoftware.com\/intentional_software\/2005\/09\/appropriate_lev.html\" rel=\"nofollow\">http:\/\/blog.intentionalsoftware.com\/intentional_software\/2005\/09\/appropriate_lev.html<\/a><\/p>\n<p>In that blog we also discussed the need for multiple levels of abstractions that are editable. So the issue of bi-directional transformations between models comes up. Mentally, we think of it as a refinement between the appropriate level. The trick is to maintain model level consistency as editing progresses. In the real messy world, where code is stored in simple text files, that can be edited at will, this is a tricky and expensive problem. Integrating the code in a smarter way might make it a lot easier.<\/p>\n<p>As for Steven Kelly&#8217;s earlier blog comment about Intentional only doing SmartText based stuff: Your hopes are correct, we think a combination of text and graphics is the most powerful, and also the most natuaral to use.<\/p>\n<p>\/Magnus<\/p>\n","parent":0},{"id":2856,"name":"Jimmy Nilsson","url":"http:\/\/www.jnsk.se\/weblog\/","date":"2005-10-10 10:35:35","content":"<p>Hi Harry,<\/p>\n<p>I posted the following as a comment:<br \/>\n<a href=\"http:\/\/www.jnsk.se\/weblog\/posts\/codeismodel.htm\" rel=\"nofollow\">http:\/\/www.jnsk.se\/weblog\/posts\/codeismodel.htm<\/a><\/p>\n<p>Best Regards,<br \/>\nJimmy<br \/>\n<a href=\"http:\/\/www.jnsk.se\/weblog\/\" rel=\"nofollow\">http:\/\/www.jnsk.se\/weblog\/<\/a><br \/>\n###<\/p>\n","parent":0},{"id":2857,"name":"John","url":"http:\/\/blogs.msdn.com\/jevdemon","date":"2005-10-11 12:18:56","content":"<p>I have to admit I was ready to debunk this until you got into the (somewhat philosophical) discussion of code being an abstraction layer between the CPU and the developer &#8211; nice touch!  That said, I think we can agree that there are different types of models for different types of purposes.  Developers will easily buy into Code is Model but business analysts (and to a lesser extent, architects) will not.  The concept of domain-specfic models helps address this issue.   The one (minor) quibble is the section at the end dealing with views.  Just as we can have different types of models we can also have differnet types views of a single model.  We might have a code view versus a graphical view or an individual participant&#8217;s view of a larger business process (e.g. a raw material supplier&#8217;s view of their role and responsibilities in a larger manufacturer&#8217;s supply chain).<br \/>\nNice post!<\/p>\n","parent":0},{"id":2858,"name":"orcmid","url":"http:\/\/nfocentrale.net\/orcmid\/blog\/","date":"2006-02-21 13:44:51","content":"<p>I&#8217;ve been waiting to come up with something profound to toss in here, and I will give that up to point out one particular thing.  First, I agree about (machine) code.  You can tell that from &#8220;What Computers Know&#8221; (<a href=\"http:\/\/nfocentrale.net\/orcmid\/blog\/2006\/02\/what-computers-know.asp\" rel=\"nofollow\">http:\/\/nfocentrale.net\/orcmid\/blog\/2006\/02\/what-computers-know.asp<\/a>).<\/p>\n<p>But I&#8217;m not sure that we are raising the level of abstraction exactly (though raising something, for sure) as we move up through layers of programming languages, maybe not even domain-specific languages.  <\/p>\n<p>Why do I say that?<\/p>\n<p>Well, because the model is not married to the behavior that is elicited from the computer.  We are doing something about the expressibility of certain things, but we need to understand that a good part of that expressibility having to do with what the program is for is an illusion that only we know and understand.  It has no impact on what the computer does.<\/p>\n<p>My simple illustration has to do with obfuscation of code.  Run your source-code-as-model through a really-great obfuscator.  Same behavior by the computer; clearly a fully-equivalent program is produced.  But where&#8217;s the model now?<\/p>\n<p>In some sense, the transformation from source to executable preserves something and it also delivers something.  The delivery is (at best) very loosely-related to our intention for the software.  It seems to me that the programs we write preserve our model while being indifferent to it.  That this works at all is a consequence of our care and only our care.<\/p>\n<p>That says to me that the articulation of the model will likely always have to be elsewhere.  Source code doesn&#8217;t really carry it except as a kind of computer-ignored narrative and cues (choice of identifiers) that are for us and not the machine.  Furthermore, our model is generally different than one that deals at the level of abstraction which has the computer&#8217;s behavior as its &#8220;extensional&#8221; meaning.<\/p>\n<p>[I don't want to rule out the value of model-driven schemes at this point, although I think it is important to understand where the design rules come from and how that is not anything the computer \"knows\" on its own.]<\/p>\n<p>Hmm, maybe this is baked enough to start writing about &#8230; .<\/p>\n","parent":0}],"attachments":[],"comment_count":9,"comment_status":"closed","custom_fields":{"dasblog_entryid":["7d6d6cb2-2300-4e39-8ad8-a2910d81d498"],"dasblog_compressedtitle":["Code+Is+Model"],"dasblog_compressedtitleunique":["2005\/10\/05\/Code+Is+Model"]}},"previous_url":"http:\/\/devhawk.net\/2005\/10\/04\/dave-is-pimping-his-ride\/","next_url":"http:\/\/devhawk.net\/2005\/10\/05\/finally-back-on-the-ice\/"}