[
  {
    "id": 2707,
    "author-name": "Rod",
    "author-email": "",
    "author-url": "http://www.rodtempleton.net",
    "date": "2004-11-03T08:48:57-08:00",
    "content": "While it would never fly in North America, perhaps the U.S. (and Canada, too, I must admit), should look at going the way Australia holds its elections.  Voting is not a right.  Voting is *mandatory*.  If you don't vote, you are hit with either a fine or time as a guest of the crown.",
    "parent-id": 469,
    "RowKey": "20041103-084857"
  },
  {
    "id": 2708,
    "author-name": "Steve",
    "author-email": "spamhole@gmail.com",
    "author-url": "",
    "date": "2004-11-03T11:18:02-08:00",
    "content": "\"While I understand it’s every citizen’s duty to vote, it’s the government’s duty to enable the citizens to do their duty. We should treat the turnout as a grade, and 53% is a failure.\"\n\nThat's a faithful Democrat.  Blame the government for people's apathy.  Yeah, it's Bush's fault people don't bother to get off their butt and vote.\n\nThe Republican party advocates personal responsibility.  Your actions are no one's fault but your own.\n\nI'm not celebrating the low turnout (I'm certainly celebrating the Bush win and Daschel loss though), I wish everyone legally eligible would vote.  I think it's kinda cool that Australia has a mandatory vote but I really don't think you can hold the governement responsible for these lame voter turnouts.",
    "parent-id": 469,
    "RowKey": "20041103-111802"
  },
  {
    "id": 2709,
    "author-name": "DevHawk",
    "author-email": "harry@devhawk.net",
    "author-url": "",
    "date": "2004-11-03T12:41:26-08:00",
    "content": "Steve, I'm not sure where in my post that I said it was \"Bush's fault\" or that I \"blamed the goverment for people's apathy\". I was trying to say (note it was almost 3am when I wrote this) that we shouldn't be proud of a 58%-60% turnout (estimates have come in since I originally posted). Goverment shouldn't be blamed, but it should be thinking of ways to get that number higher.\n\nMy comment about voter reform not being a Republican priority was the introduction to my investigation of the conventional wisdom of large turnout favoring Democrats. Honestly, I doubt a 100% voter turnout would have changed the outcome of the popular vote (which is all I looked at). \n\nDo you?",
    "parent-id": 469,
    "RowKey": "20041103-124126"
  },
  {
    "id": 2710,
    "author-name": "Steve",
    "author-email": "spamhole@gmail.com",
    "author-url": "",
    "date": "2004-11-03T14:15:32-08:00",
    "content": "Oh, now I understand.  When you said:\n\n\"While I understand it’s every citizen’s duty to vote, it’s the government’s duty to enable the citizens to do their duty. We should treat the turnout as a grade, and 53% is a failure.\" \n\nI took it that since you were saying \"it's the government's duty\" you were also saying that the government failed.  In fact, it sounds like you meant the people failed.  As the grammar challenged youths of today would say \"My bad.\"  \n\nI think it sucks that nearly half the population didn't vote.  I have at least one friend that isn't even registered and I'm pretty annoyed with him.\n\nI don't know if voter reform is or is not a republican priority.  I don't think I've heard anyone talk about it from either party.  We all lament the low turnout but I've never really heard any politician suggest a government solution.  Maybe we need tax cuts for voters - that would be more palatable than Australia's fines.\n\nI would agree, based on the popular vote distribution with 60% turnout I tend to think 100% turnout would still give the election to Bush.  \n",
    "parent-id": 469,
    "RowKey": "20041103-141532"
  },
  {
    "id": 2711,
    "author-name": "DevHawk",
    "author-email": "harry@devhawk.net",
    "author-url": "",
    "date": "2004-11-03T14:38:43-08:00",
    "content": "No worries - I did write this at 3am so I wasn't exactly at my best at explaining my meaning.",
    "parent-id": 469,
    "RowKey": "20041103-143843"
  }
]