{"status":"ok","post":{"id":995,"type":"post","slug":"the-myth-of-the-service-catalog","url":"http:\/\/devhawk.net\/2007\/06\/26\/the-myth-of-the-service-catalog\/","status":"publish","title":"The Myth of the Service Catalog","title_plain":"The Myth of the Service Catalog","content":"<p>Normally, I would simply note that Nick Malik had finally moved on from the <a href=\"http:\/\/blogs.msdn.com\/nickmalik\/archive\/2007\/06\/19\/not-crazy-just-lateral-thinking.aspx\">Great Mort vs. Agile Debate<sup>tm<\/sup><\/a> in my next Morning Coffee post and be done with it. But man, his post on the <a href=\"http:\/\/blogs.msdn.com\/nickmalik\/archive\/2007\/06\/26\/the-unimportant-soa-catalog.aspx\">Unimportant SOA Catalog<\/a> is just too good to leave until then&#8230;<\/p>\n<p>Nick has come around to the view that the catalog does &#8220;a really good job of solving the wrong problem&#8221;. I agree 100%. I haven&#8217;t talked about it much here, but my teammates could tell you I have been on a rampage about this internally. People think a service catalog will create adoption and reuse. That suggests that the big obstacle to service adoption and reuse is simply the issue of finding something to adopt or reuse. <\/p>\n<p>It&#8217;s not. <\/p>\n<p>The next PM I meet who says &#8220;I wish I had a big catalog of services so I can search for something that I can take an external dependency on&#8221; will be the first. And they&#8217;ll probably be wearing a straightjacket, because looking for dependencies on purpose like that is crazy talk. Project managers <em><u>avoid<\/u><\/em>external dependencies like the plague. So when a PM looks at a service catalog, what they see a big list of stuff they don&#8217;t want to take a dependency on. Not exactly the mindset to stimulate reuse and adoption, is it?<\/p>\n<p>Nick suggests that a catalog might work if it was small (20-50 services) but not for hundreds or thousands of services. I think it&#8217;s a culture issue not a scale issue, so I don&#8217;t think it would work even for a small number of services. But in the end, it&#8217;s a moot point since he expects a large number of services. Different reasons, same conclusion. &#8217;nuff said.<\/p>\n<p>However, while I rail against wasting time building a service catalog that won&#8217;t do what everyone thinks it will do, I haven&#8217;t had a better idea.<\/p>\n<p>Nick does. The Periodic Table of Services. <a href=\"http:\/\/blogs.msdn.com\/nickmalik\/archive\/2007\/06\/26\/the-unimportant-soa-catalog.aspx\">Go read<\/a>. More of my thoughts on this later.<\/p>\n","excerpt":"<p>Normally, I would simply note that Nick Malik had finally moved on from the Great Mort vs. Agile Debatetm in my next Morning Coffee post and be done with it. But man, his post on the Unimportant SOA Catalog is just too good to leave until then&#8230; Nick has come around to the view that [&hellip;]<\/p>\n","date":"2007-06-26 17:26:38","modified":"2007-06-26 17:26:38","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["d236d038-9cec-42fc-aa45-06a02c8a9352"],"dasblog_compressedtitle":["The+Myth+Of+The+Service+Catalog"],"dasblog_compressedtitleunique":["2007\/06\/27\/The+Myth+Of+The+Service+Catalog"]}},"previous_url":"http:\/\/devhawk.net\/2007\/06\/26\/what-is-the-rails-question\/","next_url":"http:\/\/devhawk.net\/2007\/06\/27\/morning-coffee-95\/"}