{"status":"ok","post":{"id":1300,"type":"post","slug":"job-opening-on-my-team","url":"http:\/\/devhawk.net\/2009\/12\/07\/job-opening-on-my-team\/","status":"publish","title":"Job Opening on my Team","title_plain":"Job Opening on my Team","content":"<p>I’m just starting the third week in my new job – though between Thanksgiving and an intestinal virus, I’ve only been in my office for five days total so far. That’s not enough time to establish enough groundwork to be comfortable talking about what my team is doing yet. However, I just found out we’re still hiring and better yet there’s a public description of the job opening. So if you’ve ever thought “I want to work for Microsoft\/Windows Division\/With Harry”, here’s your chance! And if you aren’t looking for a new job, at least you can get some small hints as to what I’m doing in my new gig &#8211; “building substantial improvements into the Windows development platform” sounds interesting, doesn’t it?<\/p>\n<blockquote><p><strong><a href=\"https:\/\/careers.microsoft.com\/JobDetails.aspx?jid=9986\">Senior Program Manager(708846 -External)<\/a><\/strong><\/p>\n<p>Job Category: Software Engineering: Program Management     <br \/>Location: United States, WA, Redmond      <br \/>Job ID: 708846 9986      <br \/>Product: Windows  <br \/>Division: Windows Division<\/p>\n<p>Developers! Developers! Developers!<\/p>\n<p>Developers are the key to the success of Windows and at the center of a software ecosystem that represents hundreds of billions of dollars. Our team is chartered with reinvigorating the Windows developer ecosystem by building substantial improvements into the Windows development platform (APIs, tools and the underlying infrastructure) and making developing for Windows fun!<\/p>\n<p>The team is currently seeking a Senior Program Manager to help us achieve our mission. The ideal candidate will have:<\/p>\n<ul>\n<li>Strong core PM competencies with special emphasis on developer tools and collaboration skills.<\/li>\n<li>Proven track-record of delivering results in a cross-team (ideally cross-division) environment. <\/li>\n<li>Has been a Program Manager shipping key products for at least 6 years.<\/li>\n<li>Deep empathy for the developer as a customer; ability to empathize through 1st hand experience of writing apps some of the issues developers are facing with respect to APIs, tooling such as Visual Studio and SDK.<\/li>\n<li>A demonstrated track record of excellence and delivering in ambiguous V1 situations.<\/li>\n<li>Has Bachelors in Computer Science or engineering.<\/li>\n<\/ul>\n<\/blockquote>\n","excerpt":"<p>I’m just starting the third week in my new job – though between Thanksgiving and an intestinal virus, I’ve only been in my office for five days total so far. That’s not enough time to establish enough groundwork to be comfortable talking about what my team is doing yet. However, I just found out we’re [&hellip;]<\/p>\n","date":"2009-12-07 11:49:10","modified":"2009-12-07 11:49:10","categories":[{"id":283,"slug":"windows","title":"Windows","description":"","parent":0,"post_count":16}],"tags":[{"id":250,"slug":"working-at-msft","title":"Working at MSFT","description":"","post_count":21}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["8b7ad043-5c02-4753-b59a-c897bce205b5"],"dasblog_compressedtitle":["Job+Opening+On+My+Team"],"dasblog_compressedtitleunique":["2009\/12\/07\/Job+Opening+On+My+Team"]}},"previous_url":"http:\/\/devhawk.net\/2009\/10\/27\/the-soa-manifesto-pointlessness-manifested\/","next_url":"http:\/\/devhawk.net\/2010\/01\/21\/fixing-powershells-busted-resolve-path-cmdlet\/"}