{"status":"ok","post":{"id":425,"type":"post","slug":"t-mobile-rocks-sprint-sucks","url":"http:\/\/devhawk.net\/2004\/08\/22\/t-mobile-rocks-sprint-sucks\/","status":"publish","title":"T-Mobile Rocks, Sprint Sucks","title_plain":"T-Mobile Rocks, Sprint Sucks","content":"<p>A while ago, <a href=\"http:\/\/conpro.net\/\">Tom<\/a><a href=\"http:\/\/www.conpro.net\/PermaLink.aspx?guid=558f432f-3118-4ad2-ba50-b3476a8849b6\">mentioned<\/a> that I had a great customer service experience with T-Mobile. Truthfully, the great customer service experience came today. T-Mobile just earned a customer for&#8230;well, maybe not for life, but they certainly have earned enough karma to keep me around a while. And at the same time, Sprint has spurned a customer for life. <\/p>\n<p>I <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=75f886b0-06db-4cf1-9534-604a518841f8\">blogged<\/a> back in April about getting a SmartPhone. Well, the honeymoon was short lived &#8211; it was a developer beta unit and it was not particularly robust. I dropped it about a month ago and it died. No huge deal, the <a href=\"http:\/\/www.motorola.com\/motoinfo\/product\/details\/0,,53,00.html\">MPx220<\/a> is coming soon. Of course, I need a phone in the meantime. I had signed up for T-Mobile service to power the SmartPhone so I went back to pick up a <a href=\"http:\/\/www.motorola.com\/mdirect\/hellomoto\/experience\/v300\/flash\/index.shtml\">V300<\/a> which would go to my wife when the MPx220 became available. Only trouble was that since I hadn&#8217;t bought the phone when I activated my account, I was not eligible for an activation discount. I had asked about that when I bought the service, and had been assured it was no big deal. So I call up customer service, and they promise to wave the disconnect fee on the current account if I buy a new phone (with the activation discount). This was right before I went to New Zealand, so I figured I&#8217;d take care of it when I got back. In the meantime, I&#8217;m using a old borrowed phone and my existing account.<\/p>\n<p>So I&#8217;ve been back a week, but hadn&#8217;t gotten to taking care of the phone yet. Then last night, someone steals my phone and my wife&#8217;s phone out of the car. So I call T-Mobile and explain the situation. They cancel the account on the spot, outright &#8211; no early termination fee or anything. Pretty cool. Of course, I did tell them I was going to buy not one but two new <a href=\"http:\/\/www.amazon.com\/exec\/obidos\/tg\/stores\/detail\/-\/wireless\/B0000WZWSI\/ref=w_zr_hp_td_blah2\/002-7066890-6721622\">V300&#8242;s from Amazon<\/a> (for the low price of -$100 each after rebate) but still, I thought that was pretty cool. The only bummer of this whole scenario is that I won&#8217;t be able to get the MPx220 with an activation discount when it comes up.<\/p>\n<p>After talking to T-Mobile, I called Sprint. Now, I&#8217;ve been a Sprint customer for five years. You would think that would warrant a little respect and\/or leeway, but apparently not. The &#8220;customer service&#8221; rep I spoke to was both rude and stupid. He was able to suspend my wife&#8217;s phone, but when I asked to cancel it he told me there would be an early termination fee. Funny thing is, the term on this &#8220;contract&#8221; (which I never signed and was unaware of) end&#8217;s on the 28th of August. You know, next Saturday. As in, six days from today. You would think that you might give a customer of five years who is dealing with a case of theft the benefit of the doubt and wave the early termination fee less than a week before the contract expires anyway. No, apparently I have to call back Saturday to terminate the contract. Fine. I set a reminder on my calendar so I don&#8217;t forget to rid myself of Sprint for good and forever. <\/p>\n","excerpt":"<p>A while ago, Tommentioned that I had a great customer service experience with T-Mobile. Truthfully, the great customer service experience came today. T-Mobile just earned a customer for&#8230;well, maybe not for life, but they certainly have earned enough karma to keep me around a while. And at the same time, Sprint has spurned a customer [&hellip;]<\/p>\n","date":"2004-08-22 21:10:31","modified":"2004-08-22 21:10:31","categories":[{"id":223,"slug":"general-geekery","title":"General Geekery","description":"","parent":0,"post_count":35}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2670,"name":"Chris Church","url":"","date":"2004-08-23 20:47:46","content":"<p>Its a shame the wireless companies each seem to have a major flaw.  I switched from AT&#038;T (after 10 years) to Nextel &#8217;cause my new job issued me one.  What a mistake &#8211; the radio service severely sucks, and I get dropped calls on the cell all the time.  I saw a Gartner &#8220;magic quadrant&#8221; on the cell carriers about a year ago and it was surprising how mediocre to crappy they all were in at least one major dimension.  The trouble is &#8211; they all seem to be crappy at something different!<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["ac168f48-6765-4e23-8521-27fc633c568c"],"dasblog_compressedtitle":["TMobile+Rocks+Sprint+Sucks"],"dasblog_compressedtitleunique":["2004\/08\/23\/TMobile+Rocks+Sprint+Sucks"]}},"previous_url":"http:\/\/devhawk.net\/2004\/08\/21\/no-time-to-experiment-so-im-reading-about-cw\/","next_url":"http:\/\/devhawk.net\/2004\/08\/24\/new-phones-arrived\/"}