{"status":"ok","post":{"id":759,"type":"post","slug":"against-school","url":"http:\/\/devhawk.net\/2006\/06\/21\/against-school\/","status":"publish","title":"Against School","title_plain":"Against School","content":"<p><a href=\"http:\/\/grahamglass.blogs.com\/main\/2006\/06\/thought_provoki.html\">Graham Glass<\/a> called <a href=\"http:\/\/www.wesjones.com\/gatto1.htm\">this article<\/a> &#8220;thought provoking&#8221;. Calling that an understatement is an understatement it and of itself. The article is by <a href=\"http:\/\/www.johntaylorgatto.com\/\">John Taylor Gatto<\/a>, former NY State and NYC teacher of the year. In this article, he completely shreds the modern school system. He describes our education system as &#8220;deliberately designed to produce mediocre intellects, to hamstring the inner life, to deny students appreciable leadership skills, and to ensure docile and incomplete citizens &#8211; all in order to render the populace &#8216;manageable&#8217;&#8221;. <\/p>\n<p>I&#8217;ve long had issues with the education system (I&#8217;d say &#8220;of this country&#8221; but it&#8217;s fairly universal) but I couldn&#8217;t ever articulate them. I&#8217;ve been known to say stuff like &#8220;a diploma is evidence of attendance, not intelligence&#8221; and &#8220;never let school stand in the way of your education&#8221;. I got better at understanding the problem after reading <a href=\"http:\/\/en.wikipedia.org\/wiki\/The_Third_Wave_%28book%29\">The Third Wave<\/a>. Toffler points out the need for an industrial society to have a mass education system to turn children into factory workers. But Toffler doesn&#8217;t really get into the downside of the mass education approach the way Gatto does. Note to self, pick up Gatto&#8217;s book <a href=\"http:\/\/www.johntaylorgatto.com\/underground\/index.htm\">The Underground History of American Education<\/a>.<\/p>\n<p>As I type this, I wonder if I&#8217;ll regret blogging this when my kids are in school. I can almost hear the argument now: &#8220;Dad, why should I have to go to school if you think it&#8217;s designed to produce mediocre intellects?&#8221; Frankly, I don&#8217;t have a good answer for that now and I doubt I&#8217;ll have a good one then. (&#8220;I don&#8217;t know. Go ask your mother.&#8221; Kidding!) <\/p>\n<p>You know, now that I think about it, I&#8217;m looking forward to that conversation with my kids. Gatto suggests teaching your own children to be leaders and adventures instead of letting schools train them to be employees and servants. A frank discussion about the value of school sounds much more like leadership than servitude to me.<\/p>\n<p>Update: You can read the book <a href=\"http:\/\/www.johntaylorgatto.com\/chapters\/index.htm\">online for free<\/a> or you can <a href=\"http:\/\/www.johntaylorgatto.com\/bookstore\/index.htm\">buy the book<\/a> (and others) online from Gatto&#8217;s website.<\/p>\n","excerpt":"<p>Graham Glass called this article &#8220;thought provoking&#8221;. Calling that an understatement is an understatement it and of itself. The article is by John Taylor Gatto, former NY State and NYC teacher of the year. In this article, he completely shreds the modern school system. He describes our education system as &#8220;deliberately designed to produce mediocre [&hellip;]<\/p>\n","date":"2006-06-21 22:30:50","modified":"2006-06-21 22:30:50","categories":[],"tags":[{"id":239,"slug":"education","title":"Education","description":"","post_count":3}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2370,"name":"Michael Cook","url":"http:\/\/www.cadred.net","date":"2006-06-22 09:37:40","content":"<p>Good points, but if everyone is a leader, who will they have to lead?<\/p>\n","parent":0},{"id":2371,"name":"Phil Wheat","url":"http:\/\/blog.austinwheats.net","date":"2006-06-22 11:18:12","content":"<p>Sounds like the basic problem in &#8220;Diamond Age&#8221; by Stephenson.  How to keep your children from joining the median.  He had a very interesting proposal and result, not sure if I agree with it, but it was an interesting read. <\/p>\n","parent":0},{"id":2372,"name":"Mike Clark","url":"http:\/\/www.clarkmichael.com","date":"2006-06-22 11:29:36","content":"<p>Gatto is right on.  While it is possible to get an education in the public school system, it is not typical.  My suggestion to you with respect to school is to homeschool your little bright ones.  I&#8217;ve been following your wife&#8217;s blog and Harry, I think the woman could educate a rock.  <\/p>\n<p>We homeschooled most of our kids and the results were pretty good &#8212; the public education racket likes to make a big deal about how qualified they are compared to parents (as in &#8220;don&#8217;t try this at home &#8212; WE&#8217;RE professionals), but they are blowing smoke.<\/p>\n","parent":0},{"id":2373,"name":"Julianne Pierson","url":"http:\/\/techiewife","date":"2006-06-22 11:33:51","content":"<p>Here is the thing, we ask SO much of our teachers and we teachers get such a crap load of disrespect for trying to do the right thing. I tried to teach my students to think, you see, how they solved a problem was most often times more important than the answer they came to. If I could teach them how to problem solve, I would have taught them how to think. In teaching them how to think, I believe that I helped them realize their individuality. In so doing I most definately was NOT creating factory workers (not that there is anything wrong with becoming one) the important thing I was teaching was the power of choice. The power of thought. The power of their brains. Still, our country has asked teachers to become parents, social workers, educators, doctors, nutritionists, social commentators and reporters all at the same time&#8230;oh yes all the while paying less to the teachers then we do the bus drivers. I am not kidding the teachers in most systems are paid less than bus drivers it is a travesty. I am still not convinces home schooling is the answer either as so much social integration is lost. Perhaps, as I have suggested to my husband, school systems should enable partial home school, partial school house school (some already do this) but in order for that to work, parents who stay at home to educate, rear and nurture their kids need resources, tools and education (not to mention more tax breaks since they do not get an income&#8230;wouldnt it be great if stay at home parents who could prove that they were raising kids got a special tax break to make that more financially possible in an age when two income families are a necessity not a choice??) anyway obviously this strikes a chord with me, the old social worker\/teacher who is now a stay at home Mom of two&#8230;<\/p>\n","parent":0},{"id":2374,"name":"John","url":"","date":"2006-06-22 18:23:31","content":"<p>Business Week recently ran a story focusing how on the Gates Foundation is trying (and apparently failing) to help fix the troubles with school systems here in the US.  Throwing money at the problem isn&#8217;t fixing anything &#8211; we&#8217;ve been doing this for decades with nothing to show for it. <\/p>\n<p>I personally think there are two major problems with public schools (neither of which anyone seems to want to fix):  <\/p>\n<p>1) The governement shouldn&#8217;t be in the education business &#8211; make it a private sector effort.  Force schools to compete for students.<\/p>\n<p>2) The teachers unions (NEA and AF) care more about polticial issues than students.   <\/p>\n<p>Fix those two massive problems and the schools (and students) will be much better off.<\/p>\n","parent":0},{"id":2375,"name":"Walter Brown","url":"http:\/\/www.monticohort1.blogspot.com","date":"2006-07-31 11:55:01","content":"<p>I just finished reading &#8220;Whats Worth Fighting For in Your School?&#8221; by Hargreaves and Fullan, My Small Learning COmmunity is having disscussion around this book now..  please feel free to join the conversation. Real reform can only occur from teachers.<\/p>\n<p>Check out <a href=\"http:\/\/www.monticohort1.blogspot.com\" rel=\"nofollow\">http:\/\/www.monticohort1.blogspot.com<\/a><\/p>\n","parent":0}],"attachments":[],"comment_count":6,"comment_status":"closed","custom_fields":{"dasblog_entryid":["18c69e3f-d424-4cae-9f3a-b633da15aff7"],"dasblog_compressedtitle":["Against+School"],"dasblog_compressedtitleunique":["2006\/06\/22\/Against+School"]}},"previous_url":"http:\/\/devhawk.net\/2006\/06\/21\/gartner-ea-summit-day-one\/","next_url":"http:\/\/devhawk.net\/2006\/06\/22\/architecture-by-powerpoint\/"}