[
  {
    "author-name": "Michael Cook",
    "author-email": "",
    "author-url": "http://www.cadred.net",
    "date": "2006-06-22T09:37:40-07:00",
    "content": "Good points, but if everyone is a leader, who will they have to lead?"
  },
  {
    "author-name": "Phil Wheat",
    "author-email": "pwheat@austinwheats.net",
    "author-url": "http://blog.austinwheats.net",
    "date": "2006-06-22T11:18:12-07:00",
    "content": "Sounds like the basic problem in \"Diamond Age\" by Stephenson.  How to keep your children from joining the median.  He had a very interesting proposal and result, not sure if I agree with it, but it was an interesting read. "
  },
  {
    "author-name": "Mike Clark",
    "author-email": "michael.clark@ofm.wa.gov",
    "author-url": "http://www.clarkmichael.com",
    "date": "2006-06-22T11:29:36-07:00",
    "content": "Gatto is right on.  While it is possible to get an education in the public school system, it is not typical.  My suggestion to you with respect to school is to homeschool your little bright ones.  I've been following your wife's blog and Harry, I think the woman could educate a rock.  \n\nWe homeschooled most of our kids and the results were pretty good -- the public education racket likes to make a big deal about how qualified they are compared to parents (as in \"don't try this at home -- WE'RE professionals), but they are blowing smoke."
  },
  {
    "author-name": "Julianne Pierson",
    "author-email": "juliannepierson@hotmail.com",
    "author-url": "http://techiewife",
    "date": "2006-06-22T11:33:51-07:00",
    "content": "Here is the thing, we ask SO much of our teachers and we teachers get such a crap load of disrespect for trying to do the right thing. I tried to teach my students to think, you see, how they solved a problem was most often times more important than the answer they came to. If I could teach them how to problem solve, I would have taught them how to think. In teaching them how to think, I believe that I helped them realize their individuality. In so doing I most definately was NOT creating factory workers (not that there is anything wrong with becoming one) the important thing I was teaching was the power of choice. The power of thought. The power of their brains. Still, our country has asked teachers to become parents, social workers, educators, doctors, nutritionists, social commentators and reporters all at the same time...oh yes all the while paying less to the teachers then we do the bus drivers. I am not kidding the teachers in most systems are paid less than bus drivers it is a travesty. I am still not convinces home schooling is the answer either as so much social integration is lost. Perhaps, as I have suggested to my husband, school systems should enable partial home school, partial school house school (some already do this) but in order for that to work, parents who stay at home to educate, rear and nurture their kids need resources, tools and education (not to mention more tax breaks since they do not get an income...wouldnt it be great if stay at home parents who could prove that they were raising kids got a special tax break to make that more financially possible in an age when two income families are a necessity not a choice??) anyway obviously this strikes a chord with me, the old social worker/teacher who is now a stay at home Mom of two..."
  },
  {
    "author-name": "John",
    "author-email": "jevdemon@acm.org",
    "author-url": "",
    "date": "2006-06-22T18:23:31-07:00",
    "content": "Business Week recently ran a story focusing how on the Gates Foundation is trying (and apparently failing) to help fix the troubles with school systems here in the US.  Throwing money at the problem isn't fixing anything - we've been doing this for decades with nothing to show for it. \n\nI personally think there are two major problems with public schools (neither of which anyone seems to want to fix):  \n\n1) The governement shouldn't be in the education business - make it a private sector effort.  Force schools to compete for students.\n\n2) The teachers unions (NEA and AF) care more about polticial issues than students.   \n\nFix those two massive problems and the schools (and students) will be much better off."
  },
  {
    "author-name": "Walter Brown",
    "author-email": "walterbrown@gmail.com",
    "author-url": "http://www.monticohort1.blogspot.com",
    "date": "2006-07-31T11:55:01-07:00",
    "content": "I just finished reading \"Whats Worth Fighting For in Your School?\" by Hargreaves and Fullan, My Small Learning COmmunity is having disscussion around this book now..  please feel free to join the conversation. Real reform can only occur from teachers.\n\nCheck out www.monticohort1.blogspot.com"
  }
]