{"status":"ok","post":{"id":713,"type":"post","slug":"michael-kunivsky-and-matt-cottam-on-sketching-in-hardware","url":"http:\/\/devhawk.net\/2006\/03\/08\/michael-kunivsky-and-matt-cottam-on-sketching-in-hardware\/","status":"publish","title":"Michael Kunivsky and Matt Cottam on Sketching in Hardware","title_plain":"Michael Kunivsky and Matt Cottam on Sketching in Hardware","content":"<p>For a while, I really didn’t understand where this session was going. Michael spent a bunch of time on the issues of user experience design that I’m not familiar with. I still don’t know why he was talking about the <a href=\"http:\/\/www.amazon.com\/exec\/obidos\/tg\/detail\/-\/B0009351ES\/103-0060861-4573421\">Cuddle Chimp<\/a>. But then he started talking about the importance of the sketching process to the practice of design. His meta point is that sketching is the root design tool, and different mediums are better or worse at supporting sketching. Drawing, as you might expect, is the best medium for sketching. Hardware is the worst. Michael rated a variety of sketching mediums based on Speed, Provisionality and History Preservation. By this time I figured out they were talking about enabling sketching of hardware.<\/p>\n<p>Then Matt got up. I didn’t get his bio written down, but he is a professor of experience design. And he was talking about a product he’s been involved in to enable rapid sketching of hardware user experiences using simple sensors and motors. The product is called <a href=\"http:\/\/www.sketchtools.com\/index.php?option=com_content&amp;task=blogcategory&amp;id=35&amp;Itemid=91\">Nada<\/a> and it supports Flash and Java. No .NET? Nope, but I spoke to Matt after the session about it. The demos were pretty cool. He controlled the opacity of an element in Flash with a hardware potentiometer. He controlled the speed of a fan based on the current temperature reported via a website. He showed a variety of other sensors like light sensors and flex resiststors. These demos weren’t that compelling, but the potential is huge. It can connect to variety of hardware systems including serial port devices, MIDI devices, plus kits like <a href=\"http:\/\/www.makingthings.com\/\">Teleo<\/a> and <a href=\"http:\/\/www.phidgets.com\/\">Phidgets<\/a>. I’m thinking <a href=\"http:\/\/www.hanselman.com\/blog\/\">Scott<\/a> needs to check this out for a future installment of <a href=\"http:\/\/msdn.microsoft.com\/coding4fun\/someassemblyrequired\">Some Assembly Required<\/a>.<\/p>\n","excerpt":"<p>For a while, I really didn’t understand where this session was going. Michael spent a bunch of time on the issues of user experience design that I’m not familiar with. I still don’t know why he was talking about the Cuddle Chimp. But then he started talking about the importance of the sketching process to [&hellip;]<\/p>\n","date":"2006-03-08 00:19:23","modified":"2006-03-08 00:19:23","categories":[],"tags":[{"id":297,"slug":"etech","title":"ETech","description":"","post_count":15},{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["4b539ab8-aea4-4d6a-bd93-eaedbd2069c2"],"dasblog_compressedtitle":["Michael+Kunivsky+And+Matt+Cottam+On+Sketching+In+Hardware"],"dasblog_compressedtitleunique":["2006\/03\/08\/Michael+Kunivsky+And+Matt+Cottam+On+Sketching+In+Hardware"]}},"previous_url":"http:\/\/devhawk.net\/2006\/03\/08\/rod-smith-on-do-it-yourself-it\/","next_url":"http:\/\/devhawk.net\/2006\/03\/08\/microformats-panel\/"}