{"status":"ok","post":{"id":1245,"type":"post","slug":"writing-an-ironpython-debugger-repl-console","url":"http:\/\/devhawk.net\/2009\/04\/06\/writing-an-ironpython-debugger-repl-console\/","status":"publish","title":"Writing an IronPython Debugger: REPL Console","title_plain":"Writing an IronPython Debugger: REPL Console","content":"<p>While I was <strike>banging my head against a wall<\/strike> experimenting with understanding how <a href=\"http:\/\/devhawk.net\/2009\/03\/31\/Writing+An+IronPython+Debugger+Displaying+Values.aspx\">CorValue extraction worked<\/a>, I found myself wanting to dink around with the debugger objects in a REPL console. One of IronPython’s core strengths is support for “exploratory programming” via the REPL. It turned out bringing a REPL to ipydbg was quite simple.<\/p>\n<p>Python includes two built-in features that making DIY REPL quite easy: compile and exec (though technically, exec is a statement, not a function). As you might assume from their names, compile converts a string into what Python calls a code object while exec executes a code object in a given scope. Technically, exec can accept a string so I could get by without using compile. However, if you’re compiling a single interactive statement compile can automatically insert a print statement if you’ve passed in a an expression. In other words, if you type in “2+2” on the console it will print “4”, which is the behavior I wanted.<\/p>\n<p>Here’s what my REPL console code look like. I love that it’s only 20 lines of code.<\/p>\n<pre class=\"brush: python\">\n@inputcmd(_inputcmds, ConsoleKey.R)\ndef _input_repl_cmd(self, keyinfo):\n  with CC.Gray:\n    print \"nREPL ConsolenPress Ctl-Z to Exit\"\n    cmd = \"\"\n    _locals = {'self': self}\n\n    while True:\n      Console.Write(\"&gt;&gt;&gt;\" if not cmd else \"...\")\n      \n      line = Console.ReadLine()\n      if line == None:\n        break\n      \n      if line:\n        cmd = cmd + line + \"n\"\n      else:\n        try:\n          if len(cmd) &gt; 0:\n            exec compile(cmd, \"&lt;input&gt;\", \"single\") in globals(),_locals\n        except Exception, ex:\n          with CC.Red: print type(ex), ex\n        cmd = \"\"\n<\/pre>\n<p>It’s pretty straightforward. I set up a dictionary to act as the local variable scope for the code that gets executed. I’m just reusing the current global scope, but I want the local scope to start with only the reference to the current IPyDebugProcess instance which is passed into _input_repl_cmd as “self”. All the other local variables like cmd and line won’t be available to the REPL code. Then I drop into a loop where I read lines from the console and execute them.<\/p>\n<p>In order to support multi-line statements, I build up the cmd variable over multiple line inputs and I don’t execute it until the user inputs an empty line. In the standard Python console, it can recognize single line statements and execute them immediately. Dino showed me how to use the IronPython parser to do the same thing, but I haven’t implemented that in ipydbg yet. To exit the REPL loop, you type Ctl-Z, which returns None (aka null) from ReadLine instead of the empty string.<\/p>\n<p>Since I never execute the code more than once, I have my exec and compile statements together on a single line. Compile takes the string to be compiled, the name of the file it came from (I’m using &lt;input&gt; for this) and the kind of code. Passing in “single” for the kind of code adds the auto-expression-print functionality I mentioned above. Then I exec the code object that’s returned in specified scope I’m managing for this instance of the REPL loop. If you exit out of the REPL and re-enter it, you get a fresh new copy of the local scope so any functions or variables you define in the last REPL are gone.<\/p>\n<p>Runtime execution of code into a given scope is a hallmark of dynamic languages, but I’m still fairly green when it comes to Python so it took me a while to figure this out. Python code executes in a given scope, a combination of global and local variables. When you’re in the ipy.exe REPL, you’re at top level scope anyway, so global and local scope are the same – if you add something to global scope, it shows up in local scope and vis-versa. Inside a function, you’ll have the same global scope, but the local scope will be different and changes to one won’t be reflected in the other. The ipydbg REPL isn’t a function per-se, but it does provide an explicit local scope that gets disposed when you exit the REPL.<\/p>\n<p>While having a debugger REPL is really convenient for prototyping new ipydbg commands, it’ll really shine once I get function evaluation working. Then I’ll be able to open a REPL console where the commands are executed in the <em>target<\/em> process instead of the <em>debugger<\/em> process as they are now. That will be very cool. Until then, the <a href=\"http:\/\/github.com\/devhawk\/ipydbg\/commit\/1993f263d31af5442f84d2139d3002a001a64fd8\">latest code<\/a> is – as always – up on GitHub.<\/p>\n","excerpt":"<p>While I was banging my head against a wall experimenting with understanding how CorValue extraction worked, I found myself wanting to dink around with the debugger objects in a REPL console. One of IronPython’s core strengths is support for “exploratory programming” via the REPL. It turned out bringing a REPL to ipydbg was quite simple. [&hellip;]<\/p>\n","date":"2009-04-06 12:07:39","modified":"2009-04-06 12:07:39","categories":[{"id":252,"slug":"ironpython","title":"IronPython","description":"","parent":0,"post_count":99}],"tags":[{"id":279,"slug":"debugger","title":"Debugger","description":"","post_count":23}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2193,"name":"Twitchell","url":"http:\/\/nazaraliev.com\/","date":"2009-05-20 08:07:35","content":"<p>Good Day. Reality is that which, when you stop believing in it, doesn&#8217;t go away. Help me! I find sites on the topic: drug addiction center. I found only this &#8211; <a href=\"http:\/\/design.ru-deluxe.ru\/\" rel=\"nofollow\">photoshop dizain saitov<\/a>. Adolescent drug treatment provided in a safe, caring environment by medical professionals who specialize in youth drug abuse. This page features content from the farthest reaches of the blogosphere that authors have tagged. Thanks :confused:. Twitchell from Darussalam.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["6f889e12-fbf8-483a-92de-b6776cc7fd30"],"dasblog_compressedtitle":["Writing+An+IronPython+Debugger+REPL+Console"],"dasblog_compressedtitleunique":["2009\/04\/06\/Writing+An+IronPython+Debugger+REPL+Console"]}},"previous_url":"http:\/\/devhawk.net\/2009\/04\/06\/writing-an-ironpython-debugger-getting-arguments\/","next_url":"http:\/\/devhawk.net\/2009\/04\/06\/pygments-for-wl-writer-v1-0-1\/"}