{"status":"ok","post":{"id":435,"type":"post","slug":"shopping-in-shinjuku","url":"http:\/\/devhawk.net\/2004\/09\/12\/shopping-in-shinjuku\/","status":"publish","title":"Shopping in Shinjuku","title_plain":"Shopping in Shinjuku","content":"<p>Since I had the morning off, I spent it wandering around Shinjuku, the part of Tokyo where the MS Japan office is. I was looking for presents for my wife and son, but couldn’t find anything. Experience tells me that I’m a poor judge of clothes for Julie plus with the <a href=\"http:\/\/techiewife.com\/PermaLink.aspx?guid=83ef8e3d-5195-4feb-9599-29b2d542ea75\">diet she’s been on<\/a> and the foreign sizes there’s little chance I’ll pick out something that she likes or that fits. Too bad, as this is like heaven for women’s clothes shopping. I went to four different department stores, and each had floor after floor of ladies wear. For example, the Odakyu department store has 14 floors, of which 6 are dedicated to ladies wear. Other departments get a floor or less. I did find a cute shirt for Patrick, but it was around 8,000 yen, which I was told was $76 US. Seems pretty steep for a shirt he will only wear a few times before he out grows it. <br \/> <br \/>I did have more shopping luck (for me at least, not for Julie or Patrick) at <a href=\"http:\/\/www.yodobashi.com\/\">Yodobashi Camera<\/a>. Their slogan is “Total Multimedia Life” and let me tell you they are not kidding! If it uses electricity, they have it. From computer equipment to media players to digital and video cameras to pro music gear to home appliances &#8211; eight floors of geek paradise to put Fry’s to shame. I picked up a compact USB 2.0 hub and a Wireless 54G card for my laptop – grand total about $50 US. I know I could get these in the states, but the place was so cool I had to get something. And unlike the US, they had racks of hubs to choose from. Literally, they must have had 30 different models of compact USB 2.0 hubs in different shapes and colors. The one thing they didn’t have that I looked for was a tablet PC. Hey Scoble, what’s up with that?<\/p>\n","excerpt":"<p>Since I had the morning off, I spent it wandering around Shinjuku, the part of Tokyo where the MS Japan office is. I was looking for presents for my wife and son, but couldn’t find anything. Experience tells me that I’m a poor judge of clothes for Julie plus with the diet she’s been on [&hellip;]<\/p>\n","date":"2004-09-12 23:00:03","modified":"2004-09-12 23:00:03","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2682,"name":"Drew Robbins","url":"http:\/\/geekswithblogs.net\/drewby","date":"2004-09-13 21:43:27","content":"<p>You gotta get over to Akihabara (Electric Town) for some great electronics stores. Check out the refridgerators! They are great! <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n<p>Also, you can plan a trip to Asakusa in the same half-day (if you don&#8217;t spend too much time in the toy..er..electronics stores). Asakusa has the Senso-ji shrine and a bunch of gift stores. Some of them are too cheap looking, but you certainly can find whatever you want.<\/p>\n<p>I wish I was there, but I just got back from Sapporo and couldn&#8217;t stay in Japan any longer.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["3988067b-0108-4781-a246-f5488e61f2fe"],"dasblog_compressedtitle":["Shopping+In+Shinjuku"],"dasblog_compressedtitleunique":["2004\/09\/13\/Shopping+In+Shinjuku"]}},"previous_url":"http:\/\/devhawk.net\/2004\/09\/12\/first-stop-japan\/","next_url":"http:\/\/devhawk.net\/2004\/09\/14\/japanese-architects-and-malaysian-teched\/"}