{"status":"ok","post":{"id":761,"type":"post","slug":"gartner-ea-summit-day-one","url":"http:\/\/devhawk.net\/2006\/06\/21\/gartner-ea-summit-day-one\/","status":"publish","title":"Gartner EA Summit Day One","title_plain":"Gartner EA Summit Day One","content":"<\/p>\n<p>I&#8217;m in sunny San Diego for the <a href=\"http:\/\/www.gartner.com\/2_events\/conferences\/ea4.jsp\">Gartner Enterprise Architecture Summit<\/a>. I&#8217;m presenting a sponsor session and case study tomorrow (MSFT is a <a href=\"http:\/\/agendabuilder.gartner.com\/EA4\/webpages\/platinum_sponsors.aspx?menu=menu_itxpo_and_vendors&amp;menuItem=75\">platinum sponsor<\/a> for the event) but I came in yesterday so I could attend a few sessions, meet a few customers and work the MS booth in the Solution Showcase. It&#8217;s my last event and deliverable for my old team before switching to the new role full time. <\/p>\n<p>The first of two keynotes today was Richard Buchanan&#8217;s session on <a href=\"http:\/\/agendabuilder.gartner.com\/EA4\/webpages\/SessionDetail.aspx?EventSessionId=860\">The New Enterprise Architecture: Time for Leadership<\/a>. Pretty decent session, though much of it was pretty obvious. He even said at one point that this was &#8220;<span>Strategic Enterprise Planning 101&#8243;. Not exactly the best way to kick of an EA summit, IMHO. However, he did make some interesting points:<\/span><\/p>\n<ul>\n<li>It&#8217;s hard to quantify the value of business effectiveness. Richard&#8217;s quote on this was great: &#8220;<span>What’s the dollar value of staying out of jail?&#8221;<\/span><\/li>\n<li>He compared most of how IT is operated today as &#8220;looking in the mirror&#8221; (i.e. focusing on running what we already have). He suggested instead &#8220;looking out the window&#8221; (i.e. at the industry and the future). <\/li>\n<li>I always say that architecture is the intersection of business and IT. Richard said “Architecture is a translation from business strategy to technology implementation. Architects must institutionalize this translation.” Close enough. <\/li>\n<li>He also suggested that architects need to learn to speak the language of business. That&#8217;s good advice.<\/li>\n<li>Richard did do a good job capturing the dynamic aspect of enterprise and IT architecture. It&#8217;s about change, not structure. He said &#8220;<span>EA is not about the past or the present. It’s about the future.&#8221; Couldn&#8217;t agree more.<\/span><\/li>\n<\/ul>\n<p>The second keynote was <a href=\"http:\/\/www.allthingsdistributed.com\/\">Werner Vogels<\/a> talk <a href=\"http:\/\/agendabuilder.gartner.com\/EA4\/webpages\/SessionDetail.aspx?EventSessionId=861\">Order in the Chaos: Building the Amazon.com Platform<\/a>. This was a great talk. I know a little about how Amazon has evolved, but I had no idea that it powered websites like <a href=\"http:\/\/target.com\/\">Target<\/a> and <a href=\"http:\/\/bebe.com\/\">Bebe<\/a>. His talk was a little scattered &#8211; I&#8217;m guessing he&#8217;s not as used to speaking at events like this than the Gartner folks. There&#8217;s no way to do the talk justice without basically repeating it verbatim, but my key takeaways were:<\/p>\n<ul>\n<li>Amazon naturally evolved from an application into a platform. This is fascinating and worthy of more study, esp. as I&#8217;m making the switch to MSFT&#8217;s internal IT department. Microsoft knows a thing or two about platforms, but I&#8217;m not sure how it applies inside IT.<\/li>\n<li>Amazon sees it&#8217;s &#8220;secret sauce&#8221; as their ability to automate operations at scale. For example, handling over a million sellers in their system. That helps explain their moves into services like <a href=\"http:\/\/www.amazon.com\/gp\/browse.html\/ref=sc_fe_l_2\/103-5532906-6031841?%5Fencoding=UTF8&amp;node=16427261&amp;no=3435361&amp;me=A36L942TSJ2AJA\">S3<\/a> and <a href=\"http:\/\/www.amazon.com\/gp\/browse.html\/ref=sc_fe_l_2\/103-5532906-6031841?%5Fencoding=UTF8&amp;node=15879911&amp;no=3435361&amp;me=A36L942TSJ2AJA\">MTurk<\/a> which at first glance seems at odds with their retail web site. <\/li>\n<li>One of the key values to becoming a platform is being able to open it up to partners. Again, Microsoft knows a lot about opening a platform to partners, but I&#8217;m not sure how it applies inside IT.<\/li>\n<li>Money Quote: &#8220;<span>At Amazon, things are always failing. It’s not a bad thing, it’s a fact of life.&#8221; I&#8217;ve started theorizing about this on my own, good to know where to start looking for <\/span>people putting this into practice.<\/li>\n<li>Towards that end, he made probably the most interesting observation of the day. At Amazon, there is no wall between development and operations. Combined with the secret sauce of automating operations at scale and there is a good recipe for how enterprises need to run their IT department.<\/li>\n<\/ul>\n<p>The final session I went to today was Nick Gall on <span><a href=\"http:\/\/agendabuilder.gartner.com\/EA4\/webpages\/SessionDetail.aspx?EventSessionId=863\">Architecture for the Agile Enterprise: Integrating EA &amp; SOA<\/a>. The use of the term &#8220;agile&#8221; in this context was unfortunate, as he had no discussion of agile principles. He primarily focused on what he called Web Oriented Architecture or WOA. His formula for WOA was &#8216;WOA = SOA + WWW + REST&#8221; which seems redundant. Isn&#8217;t REST an attempt to capture the architectural style of the WWW? Anyway, this session wasn&#8217;t very good. He had about 15 minutes of really good content but you had to wade thru the other 45 minutes of crap to find it. For example, he spent about ten minutes talking about the <\/span>value of using a small set common modular operations (i.e. the REST \/ WS-Transfer approach) before he used this great analogy:<\/p>\n<blockquote><p>Modularity can be open or closed. Closed modularity is like a jigsaw puzzle. There are lots of individual pieces, but they can only be put together one way. Open modularity is like a <a href=\"http:\/\/en.wikipedia.org\/wiki\/Tangram\">tangram puzzle<\/a>. There are only seven pieces, but they can be put together in hundreds of different combinations.<\/p><\/blockquote>\n<p>That was a great analogy that really got the point across! Why not just start with that and skip the mumbo jumbo? <\/p>\n<p>I missed the last session as I had to prep for booth duty. Even though this audience is very different from a typical MSFT event like TechEd, they still mobbed the booth for swag and a chance to win an Xbox 360. I had a few interesting architectural discussion, but mostly it was about the swag. <\/p>\n<p>My session is tomorrow at 11am. I&#8217;m presenting <a href=\"http:\/\/agendabuilder.gartner.com\/EA4\/webpages\/SessionDetail.aspx?EventSessionId=899\">Beyond SOA<\/a> and a <a href=\"http:\/\/agendabuilder.gartner.com\/EA4\/webpages\/SessionDetail.aspx?EventSessionId=901\">case study session<\/a> on the Dell Integrated Desktop . Then there&#8217;s two more hours of booth duty tomorrow, but I&#8217;m hoping it&#8217;s more content and less swag this time as 1) I will have just presented so I&#8217;m hoping to get some questions and 2) everyone has already gotten their swag ration for the conference.  <\/p>\n","excerpt":"<p>I&#8217;m in sunny San Diego for the Gartner Enterprise Architecture Summit. I&#8217;m presenting a sponsor session and case study tomorrow (MSFT is a platinum sponsor for the event) but I came in yesterday so I could attend a few sessions, meet a few customers and work the MS booth in the Solution Showcase. It&#8217;s my [&hellip;]<\/p>\n","date":"2006-06-21 21:14:16","modified":"2006-06-21 21:14:16","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2376,"name":"Adam Stanley","url":"http:\/\/www.echoes.com\/","date":"2006-06-22 07:02:23","content":"<p>Good review of day one.  I need to finish posting my comments.  One of the true revalations of being an enterprise architect is in the books that Microsoft was giving away.  One on enterprise patterns, one of powerpoint.  I do a lot of powerpoint! <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n","parent":0},{"id":2377,"name":"dudey","url":"","date":"2006-07-02 07:04:25","content":"<p>The Gartner report is one of the worst reports floating around.<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["147ea496-930c-429d-8a3e-73fe9fa914b7"],"dasblog_compressedtitle":["Gartner+EA+Summit+Day+One"],"dasblog_compressedtitleunique":["2006\/06\/22\/Gartner+EA+Summit+Day+One"]}},"previous_url":"http:\/\/devhawk.net\/2006\/06\/21\/alpha-release-of-ruby-net\/","next_url":"http:\/\/devhawk.net\/2006\/06\/21\/against-school\/"}