{"status":"ok","post":{"id":175,"type":"post","slug":"spelunking-wss-webmatrix","url":"http:\/\/devhawk.net\/2003\/08\/22\/spelunking-wss-webmatrix\/","status":"publish","title":"Spelunking WSS &#038; WebMatrix","title_plain":"Spelunking WSS &#038; WebMatrix","content":"<p>I&#8217;ve been doing a little spelunking the last few days. Unfortunately, much of it has been to no end, but I thought I&#8217;d share anyway.<\/p>\n<ul>\n<li>The deeper I dig into <a href=\"http:\/\/www.microsoft.com\/windowsserver2003\/technologies\/sharepoint\/default.mspx\"> Windows SharePoint Services<\/a>, the more impressed I am. While it&#8217;s well known you can customize at the data level (custom lists) and the web part level, it turns out you can do a lot of customization at the page layout level. Don&#8217;t like the default page layout of WSS? Go ahead and change it. You can customize the pages within a specific site using Front Page 2003, or at the server level by hacking files in the web server extensions60template1033 directory. I was able to add my own custom site templates, use my own custom default.aspx page, define my own custom list types, etc.<\/li>\n<li>One WSS downer &#8211; as far as I can tell, you can only have one instance running on a given machine. Which means if you go hack on the templates at the file level, everyone running on that server gets the changes. Which means I&#8217;m guessing most WSS hosting providers won&#8217;t let you hack on the templates.<\/li>\n<li>I&#8217;ve also been playing around with custom designers and <a href=\"http:\/\/www.asp.net\/webmatrix\/default.aspx?tabIndex=4&amp;tabId=46\"> WebMatrix<\/a>. One of the cool things about WebMatrix is it&#8217;s ability to render UserControls in the pages where they are used &#8211; something VS.NET can&#8217;t do. I wanted to know how WebMatrix did it since I want similar functionality in my custom designer. However, it appears that this capability is specifically tied to WebMatrix as a designer host. If you look in Microsoft.Matrix.Packages.Web.dll, there&#8217;s a Microsoft.Matrix.Packages.Web.Designers.MxUserControlDesigner class. I&#8217;m guessing WebMatrix silently substitutes this designer for the default UserControlDesigner provided by the framework. In the <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/cpref\/html\/frlrfSystemWebUIDesignControlDesignerClassGetDesignTimeHtmlTopic.asp\"> GetDesignTimeHtml<\/a> method (part of the designer infrastructure), the designer is able to walk the project hierarchy in order to find the file the control instance refers to. This project hierarchy is all written in managed code and is provided to the designer via the standard designer services infrastructure (<a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/cpref\/html\/frlrfsystemcomponentmodeldesigncomponentdesignerclassgetservicetopic.asp\">ControlDesigner.GetService<\/a>). VS.NET project hierarchy is accessed as part of the old COM-based DTE (design time environment) object model. Furthermore, there doesn&#8217;t appear to be a consistent way to retrieve that DTE base object unless it is explicitly passed to you (as in the case of an add-in). According to the docs, you should be able to <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/vsintro7\/html\/vxconreferencingdteobject.asp\"> get a DTE reference<\/a> to the currently running instance of VS.NET by calling System.Runtime.InteropServices.Marshal.GetActiveObject(&#8220;VisualStudio.DTE.7.1&#8243;). However, if there are multiple instances of VS.NET running, that call to GetActiveObject actually retireves the DTE reference to the <i>first<\/i> instance of VS.NET, not the current instance. Woops.<\/li>\n<li>The upshot of the above spelunking is that in WebMatrix, a designer can easily find, open and read the contents of another file in the project (or should I say directory since WebMatrix doesn&#8217;t use projects per se). In VS.NET, it can&#8217;t. Seems odd that the free product has features the non-free product doesn&#8217;t. Of course, some of that probably comes from the fact WebMatrix is simpler and built with managed code. Here&#8217;s to future versions of VS.NET being built using more (or better yet exclusively) managed code. <\/li>\n<\/ul>\n","excerpt":"<p>I&#8217;ve been doing a little spelunking the last few days. Unfortunately, much of it has been to no end, but I thought I&#8217;d share anyway. The deeper I dig into Windows SharePoint Services, the more impressed I am. While it&#8217;s well known you can customize at the data level (custom lists) and the web part [&hellip;]<\/p>\n","date":"2003-08-22 09:18:54","modified":"2003-08-22 09:18:54","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["7475ec52-9d64-4c70-988e-bb6b535ef5cf"],"dasblog_compressedtitle":["Spelunking+WSS+WebMatrix"],"dasblog_compressedtitleunique":["2003\/08\/22\/Spelunking+WSS+WebMatrix"]}},"previous_url":"http:\/\/devhawk.net\/2003\/08\/19\/dont-replace-the-waterwheel\/","next_url":"http:\/\/devhawk.net\/2003\/08\/26\/hacking-__dopostback\/"}