{"status":"ok","post":{"id":544,"type":"post","slug":"you-never-owned-any-music","url":"http:\/\/devhawk.net\/2005\/02\/16\/you-never-owned-any-music\/","status":"publish","title":"You Never Owned Any Music","title_plain":"You Never Owned Any Music","content":"<blockquote><p>&#8220;I just tried out Napster to Go with my iMate and while I still am not sure that I like the idea of music rental, but I would pay a monthly fee to Apple if I could get access to any piece of music anytime even if just for a while after using Napster for even a few days.  The software experience needs work, but it is a lot better than I ever expected it to be.  Napster has something here actually, but most people don&#8217;t realize it yet because Microsoft and the industry is doing a piss poor job at showing just how interesting life can be in this model.&#8221; [<a href=\"http:\/\/lennpryor.blogs.com\/lenn\/2005\/02\/2005_the_year_o.html\">Lenn Pryor<\/a>]<\/p>\n<\/blockquote>\n<p dir=\"ltr\">While Lenn admits that &#8220;Napster has something here actually&#8221;, I guess I have never understood the issue some people have with &#8220;music rental&#8221;. You don&#8217;t own the music and you never did. You&#8217;ve always owned a copy of the music. You &#8220;rented&#8221; the music in perpetuity (that&#8217;s legalese for &#8220;a long ass time&#8221;) for a flat fee. You can argue that the record labels have kept more than their fair share of said flat fee, but it doesn&#8217;t change the fact that you never owned anything but a copy.<\/p>\n<p dir=\"ltr\">Personally, I like the Napster model much better. I am paying $15 a month in perpetuity but I get access to pretty much everything that comes out. Actually, I&#8217;m not even paying yet &#8211; I&#8217;m still in my 14 day trial period. But I&#8217;ve downloaded nearly 3GB so far including a variety of stuff that I was going to buy on CD anyway when I got around to it. Life is certainly more interesting under this model.<\/p>\n","excerpt":"<p>&#8220;I just tried out Napster to Go with my iMate and while I still am not sure that I like the idea of music rental, but I would pay a monthly fee to Apple if I could get access to any piece of music anytime even if just for a while after using Napster for [&hellip;]<\/p>\n","date":"2005-02-16 14:26:17","modified":"2005-02-16 14:26:17","categories":[],"tags":[{"id":248,"slug":"music","title":"Music","description":"","post_count":20}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2779,"name":"Michael Earls","url":"http:\/\/www.cerkit.com","date":"2005-02-18 07:27:12","content":"<p>This is a debate that I keep having with someone at work.  They keep telling me how DRM is evil because they&#8217;re being forced to participate.<\/p>\n<p>I can&#8217;t help but laugh at such statements.  I keep reminding him that he&#8217;s never owned any of the movies or music that he thinks he owns.<\/p>\n<p>I think this will be one of the biggest hurdles for the entertainment industry to face &#8211; convincing the average consumer of the truth that has been the truth all along.<\/p>\n<p>I for one hope that Napster succeeds.  I&#8217;m buying.<\/p>\n","parent":0},{"id":2780,"name":"Scott Duffy","url":"http:\/\/www.mydemos.com\/Blog","date":"2005-02-22 11:51:22","content":"<p>Allow me to disagree.<\/p>\n<p>The progression from &#8220;unencrypted vinyl and CD&#8221; to &#8220;encrypted bits and bytes&#8221; has meant that we consumers have lost several rights under the law we used to have. The record companies want us to concentrate on what we have, versus what we&#8217;re losing.<\/p>\n<p>For instance, it&#8217;s perfectly legal for me to make a copy of a CD I purchase and give it to a friend or family member. (see <a href=\"http:\/\/www.musicunited.org\/2_thelaw.html#5\" rel=\"nofollow\">http:\/\/www.musicunited.org\/2_thelaw.html#5<\/a>) In fact, I can buy the latest Eminem CD, make 20 copies, and give it to everyone I know. That&#8217;s legal. But DRM has taken away this legal right.<\/p>\n<p>Or, more practically, I can purchase a CD enjoy it for a few months, and resell it in a garage sale or something. You can&#8217;t resell DRM&#8217;d music.<\/p>\n<p>Now, if the music companies would provide a service where a music license can be permanently transfered from one user to another, that would restore one of these traditional rights. If they would allow unlimited burning to CD (not all songs do), that would restore one more.<\/p>\n<p>I had this actually happen to me recently. I purchased a DRM&#8217;d song that allows me to burn the song to CD 3 times. So I burn it (along with a few others) to an audio CD, and something is just not right with it. The CD didn&#8217;t burn properly &#8211; it&#8217;s not playing in my CD players. That&#8217;s strike one. I burn it again, and a few months later the plastic label starts peeling off and the CD is ruined. Strike two. So the next time I burn this CD, I will not be able to burn it again. I almost have to burn it, and then RIP the CD, just to be safe. DRM interferes with my RIGHTS to enjoy the music in the ways I traditionally have.<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["95d40052-ac24-4acb-a18f-eddfea4aadb5"],"dasblog_compressedtitle":["You+Never+Owned+Any+Music"],"dasblog_compressedtitleunique":["2005\/02\/16\/You+Never+Owned+Any+Music"]}},"previous_url":"http:\/\/devhawk.net\/2005\/02\/14\/speaking-of-steve\/","next_url":"http:\/\/devhawk.net\/2005\/02\/16\/it-has-come-to-this\/"}