[
  {
    "author-name": "MinorRipper",
    "author-email": "mikedidier@gmail.com",
    "author-url": "http://www.minor-ripper.blogspot.com",
    "date": "2006-11-10T11:59:39-08:00",
    "content": "I think it's appropriate that we get underway in relegating the Bush Jr. foreign policy team into the dustbin of history ASAP after the election --Rumsfeld, Bolton, Cheney (hopefully). Doesn't the whole 'neocon' era already seem like a bad nightmare??  Never again.  Yeah right!\n\nwww.minor-ripper.blogspot.com"
  },
  {
    "author-name": "Libertarian",
    "author-email": "",
    "author-url": "",
    "date": "2006-11-10T12:17:38-08:00",
    "content": "Interestingly enough, I agree with pretty much everything you wrote. It will be interesting to see in 2 years if progress has been made, or more excuses. Believing Bush to cooperate when you see it may be entirely appropriate; however, I'm a little more optimistic based on his history as TX governor working with democrats. If you think about it, before the election he wasn't working with democrats at all. Heck, he wasn't even working with republicans! At the very least this election sends a loud message all politicians, and I think that is definitely a good thing."
  },
  {
    "author-name": "Dale Churchward",
    "author-email": "dale.churchward@microsoft.com",
    "author-url": "http://halfmybrain.spaces.live.com/",
    "date": "2006-11-13T11:04:47-08:00",
    "content": "As much as I hate to admit it, I agree with a lot of what you wrote Harry, especially about the Republicans being fired. As far as Bush pushing through stuff before the new Congressional session I can't blame him for that. Is he really just supposed to wait until January when it will be much harder? That really wouldn't be the smartest move on his part.\n\nAs far as the Democrats cleaning house and not tolerating the corruption of the Republican I found an article I thought was really interesting.\n \nhttp://www.rollcall.com/issues/1_1/breakingnews/15974-1.html\n\nIt sure looks like the Democrats aren’t embracing the concept of draining the swamp. Not that I expected them to. Politicians are politicians no matter the party and they seem to like to defend their own.\n"
  }
]