{"status":"ok","post":{"id":540,"type":"post","slug":"inital-thoughts-on-zen-micro-and-nomad-to-go","url":"http:\/\/devhawk.net\/2005\/02\/13\/inital-thoughts-on-zen-micro-and-nomad-to-go\/","status":"publish","title":"Inital Thoughts on Zen Micro and Nomad to Go","title_plain":"Inital Thoughts on Zen Micro and Nomad to Go","content":"<p>After using the new 2.1 firmware for my Nomad Zen Micro for a couple of days, I can see why they haven&#8217;t upgraded all their players en masse quite yet. It still has a few rough edges. <a href=\"http:\/\/www.redchairsoftware.com\/\">Red Chair Software<\/a>, makers of the awesome <a href=\"http:\/\/www.redchairsoftware.com\/notmad\/\">Notmad Explorer<\/a> that I use to manage my other Nomads, advises that you use the older 1.x firmware &#8220;you have a specific reason to switch&#8221;. Of course, I have a <a href=\"http:\/\/www.napster.com\/ntg.html\">very good reason to switch<\/a>. The 2.1 firmware is actually beta &#8211; something I think Creative should make a little more obvious on the website (not that I wouldn&#8217;t have downloaded it anyway). For the less adventurous, the 2.0 firmware also supports Napster to Go and isn&#8217;t in beta.<\/p>\n<p>The place where I notice the rough edge the most during song transition. When I push next or previous song, sometimes it happens right away and sometimes it takes 4-5 seconds. It doesn&#8217;t happen when it&#8217;s playing back a set of songs &#8211; what ever the Nomad is doing (verifying licenses I&#8217;m assume) it must do it for the next song before the current song ends, so the lag only occurs when you&#8217;re jumping around manually.<\/p>\n<p>That&#8217;s really my biggest complaint. Napster to Go works really well. They haven&#8217;t upgraded their help files to the new 3.x version of Napster &#8211; for example, all of their screenshots have a separate library function within Napster, but on my machine it just uses WMP&#8217;s library &#8211; but it&#8217;s pretty easy to figure out. I&#8217;ve configured NTG and WMP 10 to auto sync any Zen Micro with any songs I&#8217;ve downloaded from Napster (about 1GB in the first 24 hours I&#8217;ve used it!). The only complaint there is that autosync works by playlist. If you download a Napster compilation, autosync will transfer the music but not the playlist. <\/p>\n<p>And that reminds me of a feature I&#8217;d like to see on the Nomad (all of them). I want to be able filter the list of album to exclude the ones that only have one or two songs. When you download a compilation, you get around 25 songs from different artists. Great for discovering new music, but it adds a bunch of noise to the list of albums. So why not exclude albums that only have a few songs downloaded?<\/p>\n","excerpt":"<p>After using the new 2.1 firmware for my Nomad Zen Micro for a couple of days, I can see why they haven&#8217;t upgraded all their players en masse quite yet. It still has a few rough edges. Red Chair Software, makers of the awesome Notmad Explorer that I use to manage my other Nomads, advises [&hellip;]<\/p>\n","date":"2005-02-13 09:08:09","modified":"2005-02-13 09:08:09","categories":[],"tags":[{"id":248,"slug":"music","title":"Music","description":"","post_count":20}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["a59d6a4d-453f-4c9b-ad63-179526754bf4"],"dasblog_compressedtitle":["Inital+Thoughts+On+Zen+Micro+And+Nomad+To+Go"],"dasblog_compressedtitleunique":["2005\/02\/13\/Inital+Thoughts+On+Zen+Micro+And+Nomad+To+Go"]}},"previous_url":"http:\/\/devhawk.net\/2005\/02\/12\/i-give-up-on-css-but-not-on-flash\/","next_url":"http:\/\/devhawk.net\/2005\/02\/13\/another-vector-option-xamlon-flash\/"}