{"status":"ok","post":{"id":688,"type":"post","slug":"the-next-mainstream-programming-language","url":"http:\/\/devhawk.net\/2006\/02\/13\/the-next-mainstream-programming-language\/","status":"publish","title":"The Next Mainstream Programming Language","title_plain":"The Next Mainstream Programming Language","content":"<p><a href=\"http:\/\/terranova.blogs.com\/\">Terra Nova<\/a> is not the usual place I go to get news around programming language improvements. But <a href=\"http:\/\/terranova.blogs.com\/terra_nova\/2006\/02\/troubles_with_t.html\">they linked<\/a> to a great presentation from <a href=\"http:\/\/www.cs.princeton.edu\/~dpw\/popl\/06\/\">POPL 2006<\/a> by Tim Sweeney of <a href=\"http:\/\/epicgames.com\/\">Epic Games<\/a>. Tim&#8217;s talk is called <a href=\"http:\/\/www.cs.princeton.edu\/~dpw\/popl\/06\/Tim-POPL.ppt\">The Next Mainstream Programming Language: A Game Developer&#8217;s Perspective<\/a> and it talks at great length the major issues facing game developers today. As Nate Combs at Terra Nova remarked, most of these issues are not specific to the game industry, but will likely be seen there first.<\/p>\n<p>Most interesting (to me) was the issue of concurrency. Tim uses <a href=\"http:\/\/www.xbox.com\/en-US\/games\/g\/gearsofwar\/\">Gears of War<\/a> for all his examples. Of course, Gears of War is an Xbox 360 exclusive. Xbox 360, as many of you probably know, has three hyper-threaded CPUs for a total capactiy of six hardware threads. Herb Sutter talked about this in his DDJ article <a href=\"http:\/\/www.gotw.ca\/publications\/concurrency-ddj.htm\">The Free Lunch Is Over<\/a>. Tim points out &#8211; rightly so &#8211; that &#8220;C++ is ill-equipped for concurrency&#8221;. C#, Java and VB aren&#8217;t much better. Tim conculdes that we&#8217;ll need a combination of effects-free non-imperative code (which can safely be executed in parallel) and software transactional memory (to manage parallel modifications to system state).\n<\/p>\n<p>Tim also touches on topics of performance, modularity and reliability. And he has an eye on the practical at all times. For example, he points out that even a four times performance overhead of software transactional memory is acceptable, if it allows the code to scale to many threads.\n<\/p>\n<p>Anyway, it&#8217;s a great read so check it out. Also, MS Research has a <a href=\"http:\/\/www.cs.brown.edu\/~mph\/sxm.htm\">software transactional memory project<\/a> you can download if you&#8217;re so inclined. <\/p>\n","excerpt":"<p>Terra Nova is not the usual place I go to get news around programming language improvements. But they linked to a great presentation from POPL 2006 by Tim Sweeney of Epic Games. Tim&#8217;s talk is called The Next Mainstream Programming Language: A Game Developer&#8217;s Perspective and it talks at great length the major issues facing game [&hellip;]<\/p>\n","date":"2006-02-13 15:07:02","modified":"2006-02-13 15:07:02","categories":[{"id":204,"slug":"development","title":"Development","description":"","parent":0,"post_count":165}],"tags":[{"id":229,"slug":"lanugages","title":"Lanugages","description":"","post_count":43}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2896,"name":"Matt Dotson","url":"http:\/\/blogs.msdn.com\/mattdotson\/","date":"2006-02-21 21:42:52","content":"<p>Interesting stuff.  I wonder if it would catch on with the &#8220;write to the metal&#8221; approach of most game devs.  I could see this sort of thing catching on much better with windows devs where abstraction is everywhere.  I&#8217;d like to see this built into existing languages with language extensions to C# (or others) enabled by the phoenix compiler project?<\/p>\n<p>Even if the languages were better equipped to deal with concurrency, we are stuck with so many libraries that don&#8217;t do concurrency well.  How long will we be bound by windows&#8217; single UI thread concept, which is unfortunately not resolved with WPF?<\/p>\n<p>Finally, I&#8217;m excited to see a bunch of C++ people saying that the future is garbage collected!!  It makes sense that once you get a bunch of hardware threads (they talked of 20+ hardware threads), giving up 5% processing power would mean the gc could run all of the time and not add any latency to the apps.  With our single threaded apps now, the whole app has to freeze while GC takes place.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["ec844f4d-fed3-488c-a16d-96c108bf6a0b"],"dasblog_compressedtitle":["The+Next+Mainstream+Programming+Language"],"dasblog_compressedtitleunique":["2006\/02\/13\/The+Next+Mainstream+Programming+Language"]}},"previous_url":"http:\/\/devhawk.net\/2006\/02\/13\/web-2-0-evolution\/","next_url":"http:\/\/devhawk.net\/2006\/02\/13\/thoughts-on-the-ajax-toolkit-spectrum\/"}