{"status":"ok","post":{"id":1303,"type":"post","slug":"washington-stealth-lacrosse","url":"http:\/\/devhawk.net\/2010\/05\/17\/washington-stealth-lacrosse\/","status":"publish","title":"Washington Stealth Lacrosse","title_plain":"Washington Stealth Lacrosse","content":"<p><a href=\"http:\/\/www.stealthlax.com\/\"><img style=\"border-right-width: 0px; display: inline; border-top-width: 0px; border-bottom-width: 0px; border-left-width: 0px\" border=\"0\" align=\"right\" src=\"http:\/\/sphotos.ak.fbcdn.net\/hphotos-ak-snc1\/hs159.snc1\/5932_111961876044_93620706044_2350467_25193_n.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group1303\" width=\"240\" height=\"107\" \/><\/a>Last Saturday night, my family and I went with some friends from the neighborhood up to Everett to catch the <a href=\"http:\/\/www.stealthlax.com\/\">Washington Stealth<\/a> in the <a href=\"http:\/\/www.nll.com\">National Lacrosse League<\/a> Champion’s Cup final. This was my first indoor lacrosse game, and it was a <a href=\"http:\/\/seattletimes.nwsource.com\/html\/othersports\/2011876936_stealth16.html\">doozy<\/a> &#8211; the Stealth were down four goals with a a minute to go in the third quarter, but scored eight goals in a row to take the Champions Cup 15-11. After watching my Capitals <a href=\"http:\/\/sports.espn.go.com\/nhl\/playoffs\/2010\/columns\/story?columnist=burnside_scott&amp;id=5146185\">collapse<\/a> in the NHL playoffs, it was awesome to see the home team come out on top.<\/p>\n<p>(Side Note, at least the Caps aren’t alone when it comes to embarrassing playoff performances this year. Boston <a href=\"http:\/\/espn.go.com\/nhl\/playoffs\/2010\/matchup\/_\/teams\/bruins-flyers\">blew a 3-0 series lead<\/a> against Philly and Pittsburg blew a 3-2 series lead against Montreal <em>and <\/em><a href=\"http:\/\/espn.go.com\/nhl\/recap?gameId=300512016\">got beat like a drum<\/a> in game 7. I’d argue that the Caps performance was still the most embarrassing of the three, but not by much)<\/p>\n<p><img style=\"margin: 0px 10px 0px 0px; display: inline\" align=\"left\" src=\"http:\/\/upload.wikimedia.org\/wikipedia\/en\/thumb\/c\/cd\/NLLLogo.svg\/200px-NLLLogo.svg.png\" width=\"132\" height=\"234\" \/>As I said, this was my first indoor lacrosse game. The game is basically ice hockey without the ice. In fact, the Stealth’s advertising slogan this year was “It’s like hockey…with balls”. [1] As far as I could tell, the playing area is identical to a hockey rink except for the no ice thing. Benches, boards, penalty boxes, goal position – all the same. There are five players + a goalie per side, with lots of line changes and plenty of hitting. I might not have been to a game before, but I was able to pick up the basics of strategy and rules just based on the similarity to hockey. <\/p>\n<p>Since it’s so similar to hockey, it’s probably easier to talk about the things that are different &#8211; like the shot clock. Similar to basketball, in indoor lacrosse you have a limited amount of time to take a shot or else you lose possession. Maintaining possession in lacrosse seems easier than in does in hockey, so the shot clock is an important addition. Otherwise, killing penalties and running out the clock with a lead would be child’s play once you got possession. But with the shot clock, you can only chew up thirty seconds at a time.<\/p>\n<p>The combination of the basketball-esque shot clock and hockey-esque line changes creates for an interesting dynamic, but not always positive. I was expecting there to be more fast breaks, But instead, unless it’s a clear one-on-none or two-on-one, the breaking player almost always pulls up and waits for the line change to finish – often going off himself. There are line changes in hockey, but it’s rare for a guy in the offensive zone to be able to just hold onto the puck and wait for the rest of the team to line change.<\/p>\n<p>On the other hand, I really liked how indoor lacrosse doesn’t have constant face-offs like hockey does. Face offs in indoor lacrosse are only to start quarters and after goals. Otherwise, when the ball goes out of play or there’s a penalty, there are simple possession rules to determine who gets the ball. Face-offs are exciting, and they happen often enough given the amount of scoring in indoor lacrosse (26 goals total Sat. night, which was close to the season average for the Stealth of 24.375 total goals scored per game) without being overwhelming (there were 68 face-offs in yesterday’s Sharks\/Hawks game – that’s more than one per minute). <\/p>\n<p>Of course, having a good game with a come-from-behind victory by the home team certainly casts the game in the best light. Having a packed house also helped. 8,600 fans there last night – a sellout – many of whom appeared to be involved in lacrosse leagues around the Puget Sound area. The friends we went with have a teenage son who plays, which is how they got into it. Patrick says he wants to learn to play to, so I’m guessing this won’t be our last Stealth game.<\/p>\n<p>This being primarily a geek blog, I’ll add that both the Stealth and the NLL in general need to modernize their marketing and fan base building efforts. The Stealth website is old school to put it mildly – I especially like the full screen ad to buy tickets for Saturday’s game that still pops up, two days after the game. Lacrosse fans claim it’s the <a href=\"http:\/\/blog.fortiusone.com\/2008\/01\/24\/lacrosse-the-fastest-growing-sport-in-the-country\/\">fastest growing sport in the nation<\/a>, but it gets almost zero media attention. So why not encourage citizen media by issuing press credentials to fans who blog about the Stealth like the <a href=\"http:\/\/offwing.com\/2006\/08\/guidelines-for-issuing-press-credentials-to-bloggers\">Caps did a few years ago<\/a>? Selling NLL TV rights for any significant dollars is a pipe dream right now, so why not stream the games online? I suspect the main revenue source for NLL teams is ticket sales and merchandise – streaming the games would be a good way to push both.<\/p>\n<hr \/>\n<p>[1] Cute slogan, but the implication that lacrosse players are tougher than hockey players is ludicrous. NLL season lasts 16 games and the playoff are three rounds of single elimination. NHL season lasts 82 games and the playoffs are four rounds of best of seven series.<\/p>\n","excerpt":"<p>Last Saturday night, my family and I went with some friends from the neighborhood up to Everett to catch the Washington Stealth in the National Lacrosse League Champion’s Cup final. This was my first indoor lacrosse game, and it was a doozy &#8211; the Stealth were down four goals with a a minute to go [&hellip;]<\/p>\n","date":"2010-05-17 09:58:42","modified":"2010-05-17 09:58:42","categories":[{"id":234,"slug":"sports","title":"Sports","description":"","parent":0,"post_count":50}],"tags":[{"id":294,"slug":"indoor-lacrosse","title":"Indoor Lacrosse","description":"","post_count":1},{"id":295,"slug":"washington-stealth","title":"Washington Stealth","description":"","post_count":1}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2303,"name":"jdn","url":"http:\/\/www.blogcoward.com","date":"2010-05-17 18:04:06","content":"<p>I&#8217;m sorry sir, but as a Pens fan, I completely object to the idea that we got beaten by a drum in Game 7 against the Habs.<\/p>\n<p>We got our a$$e$ whipped and handed back to us in a burlap sack.<\/p>\n<p>Please correct this oversight&#8230;LOL.<\/p>\n<p>Boston&#8217;s performance has to be the worst because it is so historic.  The #1 seed has lost in the first round before (forgetting the year, but the Wings did it at least once, if not twice&#8230;which might bode well for the Caps as much as I cringe to think about it as a Pens fan&#8230;back in the day, I think there was a movement to dump Yzerman from the Wings because he couldn&#8217;t win&#8230;think about that for a minute).<\/p>\n","parent":0},{"id":2304,"name":"DevHawk","url":"","date":"2010-05-18 08:23:55","content":"<p>I dunno &#8211; teams have blown 3-1 series leads and #1 seeds have lost to #8 seeds, but the combination of #1 seed blowing a 3-1 series hasn&#8217;t ever happned, so I still think it&#8217;s worse than Boston&#8217;s performance, though maybe only worse by a little bit.<\/p>\n<p>Comparisons to Yzerman&#8217;s Wings as well as Gretzky&#8217;s Oilers have been plentiful in Washington. I just hope management doesn&#8217;t hear those and think nothing has to change. The team doesn&#8217;t need to be blown up and rebuild, but it does need tweaking. <\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["2bdd5c99-733f-4efe-a135-60d4786eca64"],"dasblog_compressedtitle":["Washington+Stealth+Lacrosse"],"dasblog_compressedtitleunique":["2010\/05\/17\/Washington+Stealth+Lacrosse"]}},"previous_url":"http:\/\/devhawk.net\/2010\/02\/17\/weakly-typed-dynamic-languages-and-natural-selection\/","next_url":"http:\/\/devhawk.net\/2010\/10\/07\/testing-the-untestable-with-delegate-injection\/"}