[
  {
    "id": 2748,
    "author-name": "Rick",
    "author-email": "rick@grape8.net",
    "author-url": "",
    "date": "2004-12-16T08:40:05-08:00",
    "content": "I'm missing hockey myself and like you am siding with the owners. The NHLPA is exhibiting what's wrong with Unions these days. If you can't stay in business then NO ONE gets paid! It seems to me that the Owners are willing to pay some very nice salaries but they just want \"cost certainty\". Again, from where I sit, food on the table is a good thing and the Owners aren't serving McDonalds.",
    "parent-id": 502,
    "RowKey": "20041216-084005"
  },
  {
    "id": 2749,
    "author-name": "Tom Vande Stouwe",
    "author-email": "tomv@conpro.net",
    "author-url": "http://ww.conpro.net",
    "date": "2004-12-16T12:06:12-08:00",
    "content": "Everytime one of the major sports goes on strike, I ask myself, why don't we offer alternative programming. Why not a live feed of master Halo 2 players, in a league setting.\n\nIf the Leagues think their strike might offer a competitor an opening, they will be back on the Ice in no time. If we sit like lumps waiting, they have no incentive except each other greed to get them playing.\n\nIn every industry, true competition is 3 players. Sports is no different. Owners, player and a wild card.\n\nHmmm.... The Microsoft Borgies :)",
    "parent-id": 502,
    "RowKey": "20041216-120612"
  },
  {
    "id": 2750,
    "author-name": "DevHawk",
    "author-email": "harry@devhawk.net",
    "author-url": "",
    "date": "2004-12-16T15:07:04-08:00",
    "content": "Sounds like a great name for a Halo 2 clan!",
    "parent-id": 502,
    "RowKey": "20041216-150704"
  },
  {
    "id": 2751,
    "author-name": "John",
    "author-email": "",
    "author-url": "",
    "date": "2004-12-16T15:50:32-08:00",
    "content": "Most unions produce the opposite of their stated intent - killing industry and putting its workers out of a job.  I have yet to see this theory proven wrong, regardless of industry.",
    "parent-id": 502,
    "RowKey": "20041216-155032"
  }
]