[
  {
    "id": 3011,
    "author-name": "Rory",
    "author-email": "",
    "author-url": "http://www.neopoleon.com",
    "date": "2004-02-29T22:51:42-08:00",
    "content": "I bought KOTOR when it first came out, and I hated it. I played it for about three hours, and just couldn't stand it.\n\nThen, a few months later, I took some time off work. I sat down in the first week and told myself that I'd give KOTOR another try.\n\nFour days later, I still hadn't left the couch :)\n\nI'm going to go back and play it again, too. I think it would be rather satisfying to be...\n\n...eeeeeeevvvviiillllllll ;)",
    "parent-id": 323,
    "RowKey": "20040229-225142"
  },
  {
    "id": 3012,
    "author-name": "mearls@hotmail.com (Michael Earls)",
    "author-email": "mearls@hotmail.comMichaelEarls",
    "author-url": "http://www.cerkit.com/",
    "date": "2004-03-02T07:54:08-08:00",
    "content": "I haven't finished the game, yet.  It seems the drive on my XBox has gone bad.  I can't get past a certain spot in the game, it just freezes while trying to load the scene.  It also won't play DVDs all the way through.  Very frustrating.\n\nHowever, when it was still working, I started another game of KOTOR where I chose all the \"bad\" paths.  It is much harder and you end up fighting a lot more.  Of course, I chose a fighter character this time.\n\nLots of fun.",
    "parent-id": 323,
    "RowKey": "20040302-075408"
  },
  {
    "id": 3013,
    "author-name": "DevHawk",
    "author-email": "harry@devhawk.net",
    "author-url": "",
    "date": "2004-03-02T16:36:59-08:00",
    "content": "The DVD drive in my XBOX is failing too. A friend of mine got his replaced under warranty, but mine didn't fail in time. There are instructions online for replacing it, but you can get it fixed thru XBOX.com for something like $90 which is cheaper than buying a new drive.",
    "parent-id": 323,
    "RowKey": "20040302-163659"
  },
  {
    "id": 3014,
    "author-name": "John Morales",
    "author-email": "",
    "author-url": "http://www.zyxil.net/blogs/john",
    "date": "2004-03-03T05:19:14-08:00",
    "content": "i played kotor the first time thru as a good guy and it was a blast.  i took a few months off, playing lesser games, and then came back to be the bad guy.\n\nbeing the bad guy is tough. the gameplay is mostly the same as the light side.  the tough part is that you get the be REALLY bad.  not just \"bad mood, snarky comments\" bad, but \"sell people into slavery\" bad and \"incite violence amongst peasants\" bad.  it's great fun, and you feel guilty sometimes, choosing the bad choices, but when the little red icon pops up saying \"you have gained dark side points,\" that makes it feel so good. ",
    "parent-id": 323,
    "RowKey": "20040303-051914"
  },
  {
    "id": 3015,
    "author-name": "Michael Earls",
    "author-email": "mearls@hotmail.com",
    "author-url": "http://www.cerkit.com",
    "date": "2004-03-15T20:22:54-08:00",
    "content": "Thanks for the tip.  I've been really bummed at the whole XBox thing since it died.  I'll head over to XBox.com and check it out.",
    "parent-id": 323,
    "RowKey": "20040315-202254"
  }
]