{"status":"ok","post":{"id":333,"type":"post","slug":"custom-modeling-languages","url":"http:\/\/devhawk.net\/2004\/03\/22\/custom-modeling-languages\/","status":"publish","title":"Custom Modeling Languages","title_plain":"Custom Modeling Languages","content":"<p>It sure has been quiet around here. I spent last week on the road in Washington DC and Orlando at the federal and eastern region architect forums. Since my parents live in DC, <a href=\"http:\/\/techiewife.com\/\">Julie<\/a> and Patrick came too. Nine days on the road with the family is hard, but it was worth it. Lots of fun, including Patrick&#8217;s first <a href=\"http:\/\/sports.espn.go.com\/nhl\/recap?gameId=240320023\">hockey game<\/a> (even though the officiating was awful).<\/p>\n<p>I spent a lot of time with customers talking about SOA and architecture frameworks. The frameworks talks were most interesting given Microsoft&#8217;s view on <a href=\"http:\/\/msdn.microsoft.com\/architecture\/application\/default.aspx?pull=\/library\/en-us\/dnvsent\/html\/vsent_modelinglangs.asp\">modeling languages<\/a> in general, Whidbey&#8217;s <a href=\"http:\/\/msdn.microsoft.com\/vstudio\/productinfo\/enterprise\/enterpriseroadmap\/default.aspx?pull=\/library\/en-us\/dnvsent\/html\/vsent_soadover.asp\">design tools<\/a> and our work on <a href=\"http:\/\/www.microsoft.com\/windowsserversystem\/dsi\/sdm.mspx\">domain-specific models<\/a> for distributed applications. To me, the most interesting thing is not the modeling tools shipping in the box with Whidbey, rather the modeling infrastructure. Accepting the idea of domain specific modeling means accepting that there are a vast number of different modeling languages &#8211; more than Microsoft could ever create on our own. In his solution <a href=\"http:\/\/msdn.microsoft.com\/architecture\/overview\/series\/\">architecture strategy series<\/a> presentation, <a href=\"http:\/\/blogs.msdn.com\/keith_short\/\">Keith Short<\/a> talked about the need for a designer infrastructure and tool extensibility. He also confirmed that the Whidbey modeling tools are themselves built on a general modeling engine and framework. This modeling infrastructure enables the definition of new meta-models, extensions to existing meta-models and transforms between meta-models. It also has a synchronization engine for keeping artifacts at different levels of abstraction in sync (e.g. updating the model updates the code and visa versa). I&#8217;m not sure how much of this infrastructure will surface publicly in Whidbey, but Keith specifically said the modeling engine is a &#8220;piece of work that, over time, we hope to be able to offer both to our partners and customers so that you can build [modeling] tools yourself.&#8221;<\/p>\n<p>This idea of building domain-specific modeling languages and tools feels pretty powerful to me. Besides the ones included in Whidbey (and the the previously discussed <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=feb67165-4f08-4342-97f9-8ce830fa1575\">service-oriented language<\/a>) what other languages would you like to see \/ use \/ design?<\/p>\n","excerpt":"<p>It sure has been quiet around here. I spent last week on the road in Washington DC and Orlando at the federal and eastern region architect forums. Since my parents live in DC, Julie and Patrick came too. Nine days on the road with the family is hard, but it was worth it. Lots of [&hellip;]<\/p>\n","date":"2004-03-22 15:51:34","modified":"2004-03-22 15:51:34","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":225,"slug":"modelling","title":"Modelling","description":"","post_count":61}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":3032,"name":"mearls@hotmail.com (Michael Earls)","url":"http:\/\/www.cerkit.com\/","date":"2004-03-22 17:05:52","content":"<p>I&#8217;d very much like to see a tool that combines the ease of use of the Acid music tool and the Vegas Video tool created by Sonic Foundry (now owned by Sony).  In addition, there is a freeware tool out there named &#8220;Buzz&#8221; that inspired me to write my first IE-based VML modeling tool.<\/p>\n<p>If we can somehow codify business requirements (and business solution technical requirements) into such an interface, I think that building the first 80% of the system would be very quick.<\/p>\n<p>In addition, maybe we could intergrate it with DirectX and play the system as a piece of music. Hrmh, not funny.<\/p>\n<p>Search the web for &#8220;Buzz music generator&#8221; and &#8220;Acid Pro&#8221; and &#8220;Vegas Video&#8221;.  The first is a freeware program and the latter two have trials, if you&#8217;re interested.<\/p>\n<p>To shorten the trip, I can summarize that these tools allow you to create base elements and then &#8220;paint&#8221; with them.  I think software development like this would be sweet.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["0183b1e0-6a94-4b1a-9599-f8c5552db953"],"dasblog_compressedtitle":["Custom+Modeling+Languages"],"dasblog_compressedtitleunique":["2004\/03\/22\/Custom+Modeling+Languages"]}},"previous_url":"http:\/\/devhawk.net\/2004\/03\/14\/spinning-the-unthinkable\/","next_url":"http:\/\/devhawk.net\/2004\/03\/26\/pat-at-vslive\/"}