{"status":"ok","post":{"id":1058,"type":"post","slug":"f-hawkeye-functional-programming","url":"http:\/\/devhawk.net\/2007\/11\/28\/f-hawkeye-functional-programming\/","status":"publish","title":"F# Hawkeye : Functional Programming","title_plain":"F# Hawkeye : Functional Programming","content":"<p><em>(Harry is @ DevTeach in Vancounver with his family this week. He was hoping to still do Morning Coffee posts, but that&#8217;s turned out to be infeasible. So instead, you get a series of pre-written posts about F#.)<\/em><\/p>\n<p>If you&#8217;re coming from the imperative object-oriented world of C#, Java or VB, functional programming just seems odd at first. But you might as well start getting used to it &#8211; functional aspects have been leaking into C# and VB with every version. The way LINQ chains together iterators (Where, Select, Order By, etc) is heavily influenced by FP (aka functional programming). <\/p>\n<p>It takes a while to get the hang of FP, but I&#8217;ve found that some problems that are hard to solve in C# are easy in F#. For example, in my parsing code, I have a bunch of boilerplate caching and tracing code that I need to execute in each parsing function. How do I do that in C# without having to cut and paste the boilerplate code over and over again? <\/p>\n<p>In F#, I wrote a function called CacheAndTrace that takes a parsing function as a parameter and returns a new function that adds the caching and tracing code. Since the new function has the same signature as the original parsing function, the caller can&#8217;t tell the difference but it saves me having to write the boilerplate code over and over again. <\/p>\n<p>Actually, you can do this type of functional composition with C#. In fact, I first wrote my version of the CacheAndTrace function in C#. But F#&#8217;s syntax is much better for functional programming &#8211; probably since it was designed for FP, rather than having FP tacked on later.  <\/p>\n<p>My father once compared functional programming to Aspect Oriented Programming. AOP is about factoring apart cross cutting concerns, which tends to be hard to do in a straight-up OO language. But in an FP language, AOP-esque separation of concern is fairly straightforward. <\/p>\n<p>F# isn&#8217;t a pure functional language &#8211; it&#8217;s actually a multi-paradigm language, so you can do imperative and OO stuff if you want to. For example, variables are typically immutable in functional programming. So how do you do something like cache the most recent result from a given function &#8211; which is what my CacheAndTrace function does? Frankly, I don&#8217;t know. But in F#, I can easily mark the cache value as mutable so I can update it on every call. Sort of the best of both worlds, though mixing and matching can get a little tricky.<\/p>\n<p>F#&#8217;s OO support is really useful when you interop with other .NET languages, since they&#8217;re mostly OO themselves. For example, I&#8217;m using NUnit test cases for all my parsing code. My parsing code is F#, so I wanted to write my tests in F# as well. NUnit requires test methods to be grouped into classes known as test fixtures. Frankly, if I were designing a native F# xUnit library, I wouldn&#8217;t require all the test methods to be grouped into a class. But it&#8217;s easier to just define an test fixture object in F# rather than build my own xUnit Framework for F#<\/p>\n","excerpt":"<p>(Harry is @ DevTeach in Vancounver with his family this week. He was hoping to still do Morning Coffee posts, but that&#8217;s turned out to be infeasible. So instead, you get a series of pre-written posts about F#.) If you&#8217;re coming from the imperative object-oriented world of C#, Java or VB, functional programming just seems [&hellip;]<\/p>\n","date":"2007-11-28 08:22:03","modified":"2007-11-28 08:22:03","categories":[],"tags":[{"id":198,"slug":"f-sharp","title":"F#","description":"","post_count":51}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["0c9e8b59-5091-4dd4-9555-8598806a8e7f"],"dasblog_compressedtitle":["F+Hawkeye+Functional+Programming"],"dasblog_compressedtitleunique":["2007\/11\/28\/F+Hawkeye+Functional+Programming"]}},"previous_url":"http:\/\/devhawk.net\/2007\/11\/28\/f-as-a-second-net-language\/","next_url":"http:\/\/devhawk.net\/2007\/11\/29\/f-hawkeye-pattern-matching\/"}