{"status":"ok","post":{"id":448,"type":"post","slug":"strategic-architect-forum-iv","url":"http:\/\/devhawk.net\/2004\/10\/12\/strategic-architect-forum-iv\/","status":"publish","title":"Strategic Architect Forum IV","title_plain":"Strategic Architect Forum IV","content":"<p>This week is Strategic Architect Forum IV where we are bring over 200 top strategic architects from around the world to Redmond for a series of presentations and breakout discussions. <a href=\"http:\/\/www.microsoft.com\/presspass\/exec\/judah\">Norman Judah<\/a>, CTO of MSFT Services, is doing the opening keynote. Other keynote speakers include <a href=\"http:\/\/blogs.msdn.com\/pathelland\">Pat Helland<\/a>, Software Factories&#8217; authors <a href=\"http:\/\/blogs.msdn.com\/Keith_Short\/\">Keith Short<\/a> and Jack Greenfield, plus a Q&amp;A session with <a href=\"http:\/\/www.microsoft.com\/billgates\">BillG<\/a>. Last year, we recorded all the sessions and published them as <a href=\"http:\/\/www.msdn.microsoft.com\/architecture\/overview\/series\/\">The Architecture Strategy Series<\/a>. We&#8217;re still working out the specifics for this year&#8217;s content, but we will be publishing this year&#8217;s sessions as soon as we can.<\/p>\n<p>One of the things that&#8217;s interesting about SAF is that we do a small number of traditional presentation sessions and a large number of discussion breakouts. For these discussion breakouts, we get around fifteen to twenty architects in a room to discuss a problem. For example, I&#8217;m doing a talk discussion breakout tomorrow on Refactoring Your Best Practices. Each breakout also has a moderator and a note taker &#8211; the goal being to record the knowledge and to track a list of action items.<\/p>\n<p>In addition to SAF, we have two ancillary events going on. All of our field architect evangelists are in town with their customers, so the past two days we had training for them. I had to speak Sunday morning about our influential and community programs. We also have most of our Architecture Advisory Board in town for SAF and their twice-yearly face-to-face meeting. This is the first face-to-face meeting of MAAB since I took over the program, so I&#8217;m looking forward to meeting these folks in person.  <\/p>\n","excerpt":"<p>This week is Strategic Architect Forum IV where we are bring over 200 top strategic architects from around the world to Redmond for a series of presentations and breakout discussions. Norman Judah, CTO of MSFT Services, is doing the opening keynote. Other keynote speakers include Pat Helland, Software Factories&#8217; authors Keith Short and Jack Greenfield, [&hellip;]<\/p>\n","date":"2004-10-12 09:17:31","modified":"2004-10-12 09:17:31","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["5b0fe7fa-36a7-4929-9b06-4993d5e03828"],"dasblog_compressedtitle":["Strategic+Architect+Forum+IV"],"dasblog_compressedtitleunique":["2004\/10\/12\/Strategic+Architect+Forum+IV"]}},"previous_url":"http:\/\/devhawk.net\/2004\/09\/30\/good-iasa-meeting\/","next_url":"http:\/\/devhawk.net\/2004\/10\/12\/architect-mvps\/"}