{"status":"ok","post":{"id":1181,"type":"post","slug":"i-survived-october","url":"http:\/\/devhawk.net\/2008\/11\/01\/i-survived-october\/","status":"publish","title":"I Survived October","title_plain":"I Survived October","content":"<p>It&#8217; felt touch and go at times, but I did manage to make it thru PDC prep, PDC itself, shipping <a href=\"http:\/\/www.codeplex.com\/IronPython\/Release\/ProjectReleases.aspx?ReleaseId=17404\">IPy 2.0 RC1<\/a> and Halloween relatively unscathed. I was Superman for Halloween – the perils of letting the five year old pick everyone’s costume, we we’re *all* Superman (well, Jules and Riley were Supergirl) – but given how exhausted I was, I could have skipped the costume and just gone as a zombie. <\/p>\n<p>My inbox is currently just under 500 messages, I’ve got a mountain of stuff to finish for IPy RTM, I’m presenting at the <a href=\"http:\/\/www.pnpsummit.com\/west2008\/west2008.aspx\">p&amp;p Summit<\/a> and I’m finally get some attention from the legal dept (now that we’re past PDC). In other words, it’s not the end of PDC is ushering in a golden age of zero work for Harry. But with PDC in my rear view mirror, I don’t feel quite so overwhelmed as I did.<\/p>\n<p>And on top of all this, I’ve been borderline obsessed with election news. I’ve basically given up on all my non-political blog reading – if I hadn’t been working on PDC I might not have even been aware of the big announcements like Oslo and Azure. Things are looking good for Obama and the Democrats, but as this <a href=\"https:\/\/donate.barackobama.com\/page\/contribute\/finishline1\">hilarious video shows<\/a> “Being in a good position to win is not the same as winning.” I haven’t had the time to volunteer for Obama but my father has been volunteering for Obama in Northern Virginia – aka “<a href=\"http:\/\/ap.google.com\/article\/ALeqM5hby_5Pku5ywmfC_rEtEV5BcYKR5gD93KDFPO0\">communist country<\/a>”. It sure would be nice to see my home state go blue.<\/p>\n","excerpt":"<p>It&#8217; felt touch and go at times, but I did manage to make it thru PDC prep, PDC itself, shipping IPy 2.0 RC1 and Halloween relatively unscathed. I was Superman for Halloween – the perils of letting the five year old pick everyone’s costume, we we’re *all* Superman (well, Jules and Riley were Supergirl) – [&hellip;]<\/p>\n","date":"2008-11-01 10:59:40","modified":"2008-11-01 10:59:40","categories":[{"id":219,"slug":"politics","title":"Politics","description":"","parent":0,"post_count":41}],"tags":[{"id":262,"slug":"pdc08","title":"PDC08","description":"","post_count":5}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2127,"name":"Anonymous","url":"","date":"2008-11-01 18:24:00","content":"<p>stick to technology because I don&#8217;t think people read your excellent blogs because of your ideological convictions&#8230;<\/p>\n","parent":0},{"id":2128,"name":"Serge Baranovsky","url":"http:\/\/http\/\/submain.com","date":"2008-11-03 10:59:48","content":"<p>2 Anonymous &#8211; that&#8217;s really harsh. There is a real person behind this blog. Not a chicken who wouldn&#8217;t even sign comments with own name. Let me repeat &#8211; &#8220;Weblog&#8221; &#8211; in its original meaning a web based &#8220;diary&#8221;. Hence &#8211; &#8220;personal&#8221;. If one wants to read technical only stuff, pick up a copy of MSDN magazine. <\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["e375ccf8-6a9f-4c99-8f21-3b108eacb1f6"],"dasblog_compressedtitle":["I+Survived+October"],"dasblog_compressedtitleunique":["2008\/11\/01\/I+Survived+October"]}},"previous_url":"http:\/\/devhawk.net\/2008\/10\/25\/pdc08-day-2\/","next_url":"http:\/\/devhawk.net\/2008\/11\/04\/election-day-2008\/"}