{"status":"ok","post":{"id":464,"type":"post","slug":"oopsla-day-1-2","url":"http:\/\/devhawk.net\/2004\/10\/26\/oopsla-day-1-2\/","status":"publish","title":"OOPSLA Day 1","title_plain":"OOPSLA Day 1","content":"<p>This morning was Rick Rashid&#8217;s keynote with &#8220;<a href=\"http:\/\/www.microsoft.com\/presspass\/press\/2004\/oct04\/10-26oopslaecosystempr.asp\">the big announcement<\/a>&#8220;: a framework and tools for developing Domain Specific Languages in VSTS. Essentially, this is a toolkit for building your own modeling tools on top of the infrastructure that powers the <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/dnvsent\/html\/vsent_ModelingLangs.asp\">VSTS Distributed System Designers (aka WhiteHorse)<\/a>. Personally, I think this is pretty exciting stuff and I can&#8217;t wait to play with it more in the coming months.<\/p>\n<p style=\"PADDING-LEFT: 10px; FLOAT: right\"><a href=\"http:\/\/s3.amazonaws.com\/devhawk_images\/UIPDSL.JPG\" class=\"grouped_elements\" rel=\"tc-fancybox-group464\"><img src=\"http:\/\/s3.amazonaws.com\/devhawk_images\/UIPDSLthumb.JPG\" border=\"0\" \/><\/a><\/p>\n<p>As part of the announcement, they demoed the toolkit with a DSL for programming the flow of pages in a web application. Typically, you would use a framework like <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/dnpag\/html\/uipab.asp\">User Interface Process<\/a> for this. However, the UIP comes with 130 pages of documentation and a variety of classes and configuration settings. By building a DSL on top of the framework, we can make the developers significantly more productive. I&#8217;ve posted a screen shot of the designer &#8211; it&#8217;s essentially a box-and-stick modeling environment &#8211; boxes are pages and sticks are transitions. Dragging a new page onto the design surface from the toolbar generates a new web page in the solution. Dragging a transition onto the design surface changes the config file. That&#8217;s much more productive than mucking around in source and config files to accomplish the same task. <\/p>\n<p>Of course, the standard question when we announce stuff like this is &#8220;when can I get my hands on it?&#8221; We&#8217;re going to release a tech preview version of the DSL Toolkit &#8220;real soon now&#8221;. You&#8217;ll be able to download it from the newly minted <a href=\"http:\/\/lab.msdn.microsoft.com\/vs2005\/teamsystem\/workshop\/default.aspx\">VSTS Workshop<\/a> page. I hear that this project, now that it&#8217;s public, is going to be very transparent to the community, so keep an eye out for more info (of course, I&#8217;ll blog it when the toolkit is released). Honestly, the version we&#8217;re shipping &#8220;real soon&#8221; is much rougher than what we previewed in the keynote this morning, but we&#8217;ll be updating it periodically as it marches towards release. <\/p>\n<p>I&#8217;ve had several good conversations in the booth with people wanting more info about VSTS and the DSL toolkit as well as Software Factories in general. As is typical, I learn as much as I teach in these sorts of discussions. For example, I met Gan Deng from Vanderbilt who showed me GME &#8211; the <a href=\"http:\/\/www.isis.vanderbilt.edu\/Projects\/gme\">Generic Modeling Environment<\/a> &#8211; which is DSL modeling environment similar conceptually to what we announced today for VSTS. Not sure when I&#8217;m going to get to play with it, but it&#8217;s nice to see academia support for DSLs.<\/p>\n<p>The only downer is that some of the OOPSLA crowd was put-off by a product demo during the keynote. Stuart <a href=\"http:\/\/blogs.msdn.com\/stuart_kent\/archive\/2004\/10\/27\/248260.aspx\">described it<\/a> as a &#8220;commercial break&#8221;. Several people gave me &#8220;brutal feedback&#8221; that brazen marketing displays like product demos don&#8217;t work in OOPSLA keynotes. But others thought it was cool. Good to keep in mind for next year. <\/p>\n<p>UPDATE &#8211; Alan Kay, in his <a href=\"http:\/\/www.oopsla.org\/2004\/ShowEvent.do?id=421\">Turing Award Lecture<\/a>, made a joke about about our product announcement this morning and everyone laughed, including me.<\/p>\n<p>UPDATE 2 &#8211; After making a joke about our morning&#8217;s product demo (and several other assorted jabs), Alan Kay ended his Turing Award Lecture with&#8230;wait for it&#8230;a product demo. Two product demos, actually. <a href=\"http:\/\/www.squeak.org\/\">Squeak<\/a> is educational programming environment, based on Smalltalk. It is <a href=\"http:\/\/www.squeak.org\/download\/index.html\">freely downloadable<\/a> and has an associated <a href=\"http:\/\/www.squeakland.org\/\">community<\/a> and <a href=\"http:\/\/minnow.cc.gatech.edu\/squeak\">wiki<\/a>. Alan did a simple little demo where he drew a car and a steering wheel and was able to steer the car as it moved by rotating the steering wheel. Cool. Alan&#8217;s other demo, <a href=\"http:\/\/www.opencroquet.org\/\">Croquet<\/a> is a &#8220;massively multi-user virtual learning environment&#8221; which is built on top of Squeak. While I liked Squeak, I don&#8217;t know many people who spend significant time in a virtual 3D space who aren&#8217;t gaming. Frankly, Croquet doesn&#8217;t seem particularly practical or useful &#8211; check out this <a href=\"http:\/\/www.opencroquet.org\/About_Croquet\/screenshots\/slideshow9.html\">screenshot<\/a> of document collaboration in Croquet. In this example, the 3D space is more of a distraction than an enabler. The only place Croquet seems useful to me is for dynamic 3D simulations, such as this <a href=\"http:\/\/www.opencroquet.org\/About_Croquet\/screenshots\/slideshow12.html\">screenshot<\/a> demonstrating the Coriolis effect.<\/p>\n","excerpt":"<p>This morning was Rick Rashid&#8217;s keynote with &#8220;the big announcement&#8220;: a framework and tools for developing Domain Specific Languages in VSTS. Essentially, this is a toolkit for building your own modeling tools on top of the infrastructure that powers the VSTS Distributed System Designers (aka WhiteHorse). Personally, I think this is pretty exciting stuff and [&hellip;]<\/p>\n","date":"2004-10-26 17:19:58","modified":"2004-10-26 17:19:58","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":225,"slug":"modelling","title":"Modelling","description":"","post_count":61}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2698,"name":"brant","url":"","date":"2004-10-27 07:27:31","content":"<p>There was a big difference between Kay&#8217;s lecture and the keynote that I don&#8217;t think you are capturing.<\/p>\n<p>- The product demo during the Keynote was delivered by the Program Manager for the tool; not from the primary speaker (Head of MS Research)<\/p>\n<p>- The product demo was very hard to follow and didn&#8217;t seem to re-enforce any of the topics that the speaker had let up to; it felt very disconnected: hence the commercial feel to it<\/p>\n<p>- Kay&#8217;s lecture was really his business; the lecture is the reward he gets for all the great contributions he has made during his career; if he wan&#8217;t to show some products that&#8217;s his choice.  A Keynote is different; its supposed to setup the theme of the conference: there are plenty of other times during the conference for product demos<\/p>\n<p>- Kay&#8217;s demo wasn&#8217;t really pushing a vendor or a product; but rather (IMO) trying to show the lack of innovation in computing science; this fit very well with his entire lecture which was positioned as a challenge to the community to teach better, and innovate more.  (BTW: it is clear that he views MS as one of the companies NOT innovating I would be interested to see you blog about that)<\/p>\n<p>I saw MANY people just walk out during the MS Keynote demo it was clear that<br \/>\n- Many (more than 50%) were Java developers that really have no use for MS only tools<br \/>\n- Many felt it inappropriate to be doing a product demo at that time<br \/>\n- MS &#8220;abused&#8221; its priviledge of the Keynote by resorting to blatant produt advertising<\/p>\n<p>cheers<\/p>\n<p>b<\/p>\n<p>PS: One my Day 1 highlights was Ward Cunningham&#8217;s lecture did you attend that?<\/p>\n","parent":0},{"id":2699,"name":"Anon","url":"","date":"2004-10-28 18:19:42","content":"<p>GME has been around for a long time &#8211; your comments display a patronizing attitude.  If I were Gan I nmight very well say it&#8217;s nice to finally see DSL support from Industry.<\/p>\n","parent":0},{"id":2700,"name":"Anon","url":"","date":"2004-10-30 02:44:02","content":"<p>If all Microsoft has got to offer is a highly bespoke VS specific tool that is based on XML to VS translation, then this is a weak effort indeed, and certainly not the vision of DSL&#8217;s that people had in mind.<\/p>\n<p>Metatools such as GME and EMF and standards such as MOF have emerged because DSL development is very much dependent on a technology independent meta-data foundation. Because MS has chosen to ignore this, it will end up producing tools that are ultimately constrained by what they can offer the community.<\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["d48de680-85be-482e-b403-be3885717050"],"dasblog_compressedtitle":["OOPSLA+Day+1"],"dasblog_compressedtitleunique":["2004\/10\/27\/OOPSLA+Day+1"]}},"previous_url":"http:\/\/devhawk.net\/2004\/10\/26\/oopsla-welcome-reception\/","next_url":"http:\/\/devhawk.net\/2004\/10\/27\/and-now-for-something-completely-different\/"}