{"status":"ok","post":{"id":726,"type":"post","slug":"the-annoying-c-3-0-unsupported-version-dialog","url":"http:\/\/devhawk.net\/2006\/03\/17\/the-annoying-c-3-0-unsupported-version-dialog\/","status":"publish","title":"The Annoying C# 3.0 &#8220;Unsupported Version&#8221; Dialog","title_plain":"The Annoying C# 3.0 &#8220;Unsupported Version&#8221; Dialog","content":"<p>I am sick and tired of the warning dialog box for the <a href=\"http:\/\/download.microsoft.com\/download\/4\/7\/0\/4703eba2-78c4-4b09-8912-69f6c38d3a56\/linq%20preview.msi\">C# 3.0 preview<\/a>. Every time you launch VS it pops up a dialog reading &#8220;This is an unsupported version of Microsoft Visual C# 3.0. As such many features may not work as expected.&#8221; You know, this isn&#8217;t my first time working with alpha or beta quality software. I&#8217;m also running <a href=\"http:\/\/msdn.microsoft.com\/windowsvista\/downloads\/getthebeta\/default.aspx\">WinFX Feb CTP<\/a>, <a href=\"http:\/\/download.microsoft.com\/download\/b\/3\/1\/b3141ee3-4a13-4061-a96e-4ae3c37ea0e0\/LINQ%20VB%20Preview%20(Jan%202006).msi\">VB 9.0 Jan CTP<\/a> and the <a href=\"http:\/\/www.microsoft.com\/products\/expression\/en\/interactive_designer\/id_free_trial.aspx\">Expression Interactive Designer March CTP<\/a>. None of them feel the need to constantly remind me that they&#8217;re unsupported. <\/p>\n<p>Who suddenly thought C# developers need hand holding?<\/p>\n","excerpt":"<p>I am sick and tired of the warning dialog box for the C# 3.0 preview. Every time you launch VS it pops up a dialog reading &#8220;This is an unsupported version of Microsoft Visual C# 3.0. As such many features may not work as expected.&#8221; You know, this isn&#8217;t my first time working with alpha [&hellip;]<\/p>\n","date":"2006-03-17 14:41:45","modified":"2006-03-17 14:41:45","categories":[{"id":204,"slug":"development","title":"Development","description":"","parent":0,"post_count":165}],"tags":[{"id":229,"slug":"lanugages","title":"Lanugages","description":"","post_count":43}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2336,"name":"Cyrus Najmabadi","url":"http:\/\/blogs.msdn.com\/cyrusn","date":"2006-03-25 23:20:23","content":"<p>Hi Devhawk!  I&#8217;m Cyrus, a developer on the C# team primarily responsible for IntelliSense.  I wanted to explain why you&#8217;re getting this dialog and what our reasoning was for designing the preview this way.<\/p>\n<p>You brought up some counter examples of preview software that doesn&#8217;t behave the same way, however there&#8217;s a subtle distinction i see between them and the preview we&#8217;ve released.  Simply put, it all comes down to support and &#8220;version numbers&#8221;.  What do i mean by that?  Well, when you&#8217;re running the WinFX February CTP there&#8217;s absolutely no confusion for you or Product Support Services as to what you&#8217;re running and what the support policy is for it.  If you contact PSS and say &#8220;i&#8217;m having a problem with the [insert product name]&#8220;, they&#8217;ll say &#8220;please go to [some location] and get the version number by looking at [something]&#8220;.  This method works with all the many preview releases.  However, with the C# 3.0 preview we did things slightly different.  Notice that you&#8217;re not pulling down an entirely new version of VS.  Instead, we&#8217;re providing the preview &#8220;in place&#8221;.  And, in actuality, all that happens is that exactly one dll on your machine is replaced with one of ours.  <\/p>\n<p>As it turns out, this can lead to quite a support nightmare.  To both the user and the support teams this &#8220;frankenbuild&#8221; scenario is practically indistinguishable from the actual RTM release of Visual Studio 2005 (version 50727.42).  And, while you might remember that this is preview software for a while, after using it for several months will you still remember?  And, once you&#8217;ve forgotten, and you later on experience a crash (due to the highly alpha nature of this release) will you realize what&#8217;s up?  Or will you contact PSS and go through a bunch of expensive rigamarole until, weeks later, someone finally realizes what&#8217;s going on and why something is only happening on your machine and not on any others. <\/p>\n<p>Of course, when i say &#8220;you&#8221; i&#8217;m actually referring to the larger developer community out there.  *You* may actually be fine without the prompt, however we have to consider the larger group of developers out there that we&#8217;re targetting.<\/p>\n<p>We may consider removing the prompt in the future (or making it user configurable).  However, i have a distinct worry that people will download the preview, install it and later on totally forget that they&#8217;ve done this.  And when that happens and the user experiences crashes, instability, and data loss in a product that looks virtually indistinguishable from VS2005 then there can be a lot of angst and anger that can easily be avoided with just a simple dialog.<\/p>\n<p>If you&#8217;d like to talk more about this, feel free to contact me through my blog (there&#8217;s a &#8220;contact&#8221; link on that page).<\/p>\n<p>In short, there was a conscious decision made around this and we did feel that this behavior was warrented since our preview was sufficiently different from others that MS has released.<\/p>\n<p>Thanks for the feedback!<\/p>\n<p>             &#8212; Cyrus<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["1f3ac744-fd2b-435b-b379-3d98a451ecb7"],"dasblog_compressedtitle":["The+Annoying+C+30+Unsupported+Version+Dialog"],"dasblog_compressedtitleunique":["2006\/03\/17\/The+Annoying+C+30+Unsupported+Version+Dialog"]}},"previous_url":"http:\/\/devhawk.net\/2006\/03\/16\/update-on-live-toolbar\/","next_url":"http:\/\/devhawk.net\/2006\/03\/19\/overheard-at-spark\/"}