{"status":"ok","post":{"id":1028,"type":"post","slug":"hawkeye-on-office-communicator-2007","url":"http:\/\/devhawk.net\/2007\/08\/15\/hawkeye-on-office-communicator-2007\/","status":"publish","title":"Hawkeye on Office Communicator 2007","title_plain":"Hawkeye on Office Communicator 2007","content":"<p>I&#8217;ve been running <a href=\"http:\/\/office.microsoft.com\/en-us\/communicator\/HA102037151033.aspx\" target=\"_blank\">Office Communicator 2007<\/a> (aka OC07) and the <a href=\"https:\/\/polycom.centercode.com\/callout\/default.html?callid=DF8E7030197849A39746014B5BB00670\" target=\"_blank\">Polycom CX200 phone<\/a> for a couple of weeks now. Here are a few thoughts on the experience.<\/p>\n<ul>\n<li><u><strong>Multiple Points of Presence<\/strong><\/u>. I&#8217;ve got OC07 installed on both my desktop and laptop. Unlike <a href=\"http:\/\/get.live.com\/messenger\/overview\" target=\"_blank\">WL Messenger<\/a> with it&#8217;s &#8220;you&#8217;ve signed in on another machine&#8221; messages, OC07 happily lets me log in both places. If I get an IM, it pops up on both screens. If my phone rings, I can answer it on either machine.  <\/li>\n<li><strong><u>Simultaneous Ring<\/u><\/strong>: When I get a call, both my machines and my mobile phone ring. I can answer in whatever place I want. For the most part, people know my mobile phone number, so I&#8217;ll need to get out the word to call my work number instead. (First step: re-program my work number in my wife&#8217;s phone.) I can also choose to forward my work calls directly to my mobile phone, though I tend to be better about checking work voice mail so I doubt I&#8217;ll use that feature.  <\/li>\n<li><strong><u>Outlook Integration<\/u><\/strong>: The <a href=\"http:\/\/office.microsoft.com\/en-us\/communicator\/HA102027031033.aspx\" target=\"_blank\">previous version of OC<\/a> had PBX system integration and Outlook. So you could call someone simply by right clicking on their name in Outlook, OC would talk to your PBX system to place the call. Unfortunately, when we moved offices we also got new IP phones that didn&#8217;t integrate with OC05. Now that I&#8217;m on OC07, my computer <em>is<\/em> my phone and all the Outlook integration works again.  <\/li>\n<li><strong><u>Status Indicator on the Phone<\/u><\/strong>: It&#8217;s minor, but the USB handset has the OC logo that lights up the same as your status. If you&#8217;re available, the logo is green. Busy? The logo is red. Do Not Disturb? Logo flashes red. Nice touch.  <\/li>\n<li><strong><u>Missed Conversations<\/u><\/strong>: The other day when I was in training, a colleague IMed me but I was away from my desk and my laptop was turned off. The IM conversation ended up in my inbox like an email. Doesn&#8217;t help for &#8220;You there?&#8221; IMs, but when he realized I wasn&#8217;t there, he just wrote the information he wanted me to know and I got it the next time I logged in.  <\/li>\n<li><strong><u>No Clock<\/u><\/strong>: A very minor sticking point, but the old phone system had a clock on the phone so you could easily see what time it is, even if your machine is locked. The USB handset doesn&#8217;t have a clock and I miss it. Not nearly enough to go back to my old phone, but enough that I&#8217;m going to go buy a little desk clock.  <\/li>\n<li><strong><u>No Keypad<\/u><\/strong>: I didn&#8217;t miss it right off the bat, but the lack of a keypad is a hassle. If I have to look a phone number up, having the ability to place the call inside of Outlook is slick. If I know the number off the top of my head (home, wife&#8217;s cell phone, helpdesk) then having to type it into Communicator is a pain. Also, if you&#8217;re calling one of those automated systems, keying the numbers on the software keypad is a real hassle.  <\/li>\n<li><strong><u>IM to Phone<\/u><\/strong>: Since I have to look my wife up in Communicator to call her anyway, I can shoot her an IM before  call her. The kids nap in the afternoon, so if I catch her online, it avoids a potentially waking ring.  <\/li>\n<li><strong><u>Extra Speaker<\/u><\/strong>: When you set up the USB phone, it sets itself up as the default speaker. That&#8217;s typically not what you want, but it&#8217;s easy enough to change in the sound control panel. However, when my earphones broke and I found myself sans audio, I changed it back until I could get new earphones. The only problem with this approach is that in a cube environment (like I work in), the noise from the phone speaker is a bit loud. You can pick up the receiver and listen that way without bugging your neighbors, but after about 20 seconds, it reverts back to speaker phone for no apparent reason.<\/li>\n<\/ul>\n","excerpt":"<p>I&#8217;ve been running Office Communicator 2007 (aka OC07) and the Polycom CX200 phone for a couple of weeks now. Here are a few thoughts on the experience. Multiple Points of Presence. I&#8217;ve got OC07 installed on both my desktop and laptop. Unlike WL Messenger with it&#8217;s &#8220;you&#8217;ve signed in on another machine&#8221; messages, OC07 happily [&hellip;]<\/p>\n","date":"2007-08-15 09:43:38","modified":"2007-08-15 09:43:38","categories":[],"tags":[{"id":205,"slug":"office","title":"Office","description":"","post_count":5}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2570,"name":"Tommy Delan","url":"http:\/\/groups.msn.com\/dir99999\/","date":"2007-08-22 06:06:12","content":"<p>very nice site<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["247ebae7-911e-4bee-aaff-12aeb1be5669"],"dasblog_compressedtitle":["Hawkeye+On+Office+Communicator+2007"],"dasblog_compressedtitleunique":["2007\/08\/15\/Hawkeye+On+Office+Communicator+2007"]}},"previous_url":"http:\/\/devhawk.net\/2007\/08\/15\/morning-coffee-110\/","next_url":"http:\/\/devhawk.net\/2007\/08\/16\/morning-coffee-111\/"}