{"status":"ok","post":{"id":757,"type":"post","slug":"hawk-eye-on-xbox-360","url":"http:\/\/devhawk.net\/2006\/06\/19\/hawk-eye-on-xbox-360\/","status":"publish","title":"Hawk Eye on Xbox 360","title_plain":"Hawk Eye on Xbox 360","content":"<p>Last weekend, I finally got around to picking up an <a href=\"http:\/\/www.xbox.com\/en-US\/hardware\/xbox360\/\">Xbox 360<\/a>. Things have been a little busy this week so I haven’t had a ton of time to play it. I bought <a href=\"http:\/\/www.xbox.com\/en-US\/games\/theelderscrollsIVoblivion\/\">Oblivion<\/a> and <a href=\"http:\/\/www.xbox.com\/en-US\/games\/kameo\">Kameo<\/a>, but have spent most of my time playing <a href=\"http:\/\/www.xbox.com\/en-US\/games\/livearcadexbox360\">Xbox Live Arcade<\/a>. Seems sort of stupid to shell out $400 to play <a href=\"http:\/\/www.xbox.com\/en-US\/games\/hexichdlivearcadexbox360\/\">Hexic<\/a> and <a href=\"http:\/\/www.xbox.com\/en-US\/games\/unolivearcadexbox360\/\">UNO<\/a>, but it actually a compelling experience for a number of reasons. First off, they’re games you can play for 10-15 minutes at a time. Playing Oblivion for 15 minutes is pointless, but it’s perfect for a Live Arcade game. With two kids, 15 minutes of play time is much more common than 2 hours. Second, you don’t have to get up to put in a game disc. Sure it’s lazy, but aren’t we all lazy sometimes? Third, I can play them in front of my kids. Fourth, they’re cheap and easy to download on <a href=\"http:\/\/www.xbox.com\/en-US\/live\/marketplace\/\">Xbox Live Marketplace<\/a>.<\/p>\n<p>Marketplace is a thing of genius. My son Patrick’s favorite is the <a href=\"http:\/\/disney.go.com\/disneypictures\/cars\/\">Cars movie<\/a> trailer in HD. Being able to download demos is awesome, rather than keeping track of the discs that come with <a href=\"http:\/\/www.officialxboxmagazine.com\/\">OXM<\/a>. For example, I’ve downloaded every racing game demo there is so Patrick can play them. He hasn’t got the hang of it yet (he is only three) but since it’s a demo it doesn’t matter. He doesn’t care that he keeps racing the same car on the same track. (He did see the new <a href=\"http:\/\/www.xbox.com\/en-US\/games\/c\/cars\">Cars game<\/a> at Blockbuster the other day, but it’s for the original Xbox and not on the <a href=\"http:\/\/www.xbox.com\/en-US\/games\/backwardcompatibilitygameslist.htm\">back compat<\/a> list.)<\/p>\n<p>Finally, the ability to play music and look at pictures from a standard XP machine is pretty cool. The User Experience for lots of photos and music isn’t great, but the end result is worth it. My wife quipped “I could watch this all night” as we looked at a slide show of photos we’ve taken over the past three years while listening to some of custom tunes. I don’t have a Media Center as I’ve been waiting for HD cable support. However, I know the MCE experience for navigating thousands of songs and photos is much better than Xbox 360’s, so I might make the switch early. Plus, I would also get support for remote video viewing – something Xbox 360 doesn’t support for reasons that escape me.<\/p>\n<p>All in all, I&#8217;m really digging the Xbox 360. Only downside is not enough time to play. <\/p>\n","excerpt":"<p>Last weekend, I finally got around to picking up an Xbox 360. Things have been a little busy this week so I haven’t had a ton of time to play it. I bought Oblivion and Kameo, but have spent most of my time playing Xbox Live Arcade. Seems sort of stupid to shell out $400 [&hellip;]<\/p>\n","date":"2006-06-19 00:28:50","modified":"2006-06-19 00:28:50","categories":[],"tags":[{"id":185,"slug":"games","title":"Games","description":"","post_count":18},{"id":189,"slug":"xbox-360","title":"Xbox 360","description":"","post_count":54}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2367,"name":"Jesse Ezell","url":"http:\/\/weblogs.asp.net\/jezell","date":"2006-06-19 16:09:37","content":"<p>Forget hexic and uno, geometry wars is where it&#8217;s at!<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["8838d950-2fe2-4802-867f-ed8bfc6e63af"],"dasblog_compressedtitle":["Hawk+Eye+On+Xbox+360"],"dasblog_compressedtitleunique":["2006\/06\/19\/Hawk+Eye+On+Xbox+360"]}},"previous_url":"http:\/\/devhawk.net\/2006\/06\/15\/really-not-the-biggest-job-change-news\/","next_url":"http:\/\/devhawk.net\/2006\/06\/21\/alpha-release-of-ruby-net\/"}