{"status":"ok","post":{"id":1299,"type":"post","slug":"the-soa-manifesto-pointlessness-manifested","url":"http:\/\/devhawk.net\/2009\/10\/27\/the-soa-manifesto-pointlessness-manifested\/","status":"publish","title":"The SOA Manifesto &#8211; Pointlessness Manifested","title_plain":"The SOA Manifesto &#8211; Pointlessness Manifested","content":"<p><a href=\"http:\/\/www.agilemanifesto.org\/\"><img style=\"border-right-width: 0px; display: inline; border-top-width: 0px; border-bottom-width: 0px; margin-left: 0px; border-left-width: 0px; margin-right: 0px\" border=\"0\" align=\"right\" src=\"http:\/\/www.agilemanifesto.org\/background.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group1299\" width=\"240\" height=\"180\" \/><\/a>You know what the <a href=\"http:\/\/www.agilemanifesto.org\/\">Agile Manifesto<\/a> doesn’t have? Video of a “very formal ceremony” announcing said manifesto. Instead, we just have <a href=\"http:\/\/www.agilemanifesto.org\/background.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group1299\">artistically rendered picture<\/a> of what sure looks like <a href=\"http:\/\/www.martinfowler.com\/\">Martin Fowler<\/a> pointing at a white board while some of the other original signatories look on. Sure, it’s a cool picture, but wouldn’t it have been much cooler if they had captured that moment on video instead? Especially if it was video of them all standing around looking vaguely uncomfortable while photographers took their picture and someone gravely read the manifesto to give it artificially inflated importance. <\/p>\n<p>I only watched ten seconds of the <a href=\"http:\/\/soa-manifesto.org\/\">SOA Manifesto<\/a><a href=\"http:\/\/www.youtube.com\/watch?v=TCg16oTZSV0\">announcement video<\/a> before I realized there’s nothing to see here, move along, just a bunch of navel gazing from the <a href=\"http:\/\/thomaserl.com\/\">usual SOA suspects<\/a>. <\/p>\n<p>Seriously, if you having a big announcement about how cool, earth shattering, significant or, hell, even interesting your manifesto is, then it’s not any of those things. It’s a waste of my time.<\/p>\n<p>Then I noticed that my previous manager and personal friend <a href=\"http:\/\/blogs.msdn.com\/jdevados\/\">John deVadoss<\/a> is one of the signatories. I have metric tons of respect for John, so I gave the SOA Manifesto a second chance. <\/p>\n<p>It lost me at the second sentence. <\/p>\n<blockquote><p>Service orientation is a paradigm that frames what you do. <strong>Service-oriented architecture (SOA) is a type of architecture that results from applying service orientation. <\/strong>We have been applying service orientation to help organizations consistently deliver sustainable business value, with increased agility and cost effectiveness, in line with changing business needs.<\/p>\n<\/blockquote>\n<p>Are you frakking kidding me? “Service-oriented architecture (SOA) is a type of architecture that results from applying service orientation.” Who the hell came up with that? I didn’t realize the <a href=\"http:\/\/soasymposium.com\/\">International SOA Symposium<\/a> had a Department of Redundancy Department. <\/p>\n<p>When you define SOA in terms of SO, then you can’t possibly score well on the practicality quotient.<\/p>\n<p>The rest of the manifesto isn’t much better. What made the Agile manifesto great IMO was that it ran counter to “common” beliefs like “changing requirements late in the process is bad” and “shipping software cycles should take years”. Sure, we all realize how right those Agile manifesto guys were <em><u>now<\/u><\/em>, but at the time it was the next best thing to heresy for many organizations. Those guys were agents of change. And I mean real change, not “this will help me sell books” change.<\/p>\n<p>SOA manifesto on the other hand is basically repackaged common sense. Stuff like “Recognize that SOA ultimately demands change on many levels” and “The scope of SOA adoption can vary. Keep efforts manageable and within meaningful boundaries” Any help figuring out what that change is or what the scope should be? Nope. Thanks for the advice guys, but I had your so called “Guiding Principles” figured out long ago. <\/p>\n<p>But hey, I’m sure the manifesto will help Thomas Erl et. al. sell more SOA books. So, I guess from that perspective it’s mission accomplished.<\/p>\n","excerpt":"<p>You know what the Agile Manifesto doesn’t have? Video of a “very formal ceremony” announcing said manifesto. Instead, we just have artistically rendered picture of what sure looks like Martin Fowler pointing at a white board while some of the other original signatories look on. Sure, it’s a cool picture, but wouldn’t it have been [&hellip;]<\/p>\n","date":"2009-10-27 17:31:37","modified":"2009-10-27 17:31:37","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2290,"name":"Henrik Liliendahl S&#248;rensen","url":"http:\/\/liliendahl.wordpress.com\/","date":"2009-10-28 00:10:56","content":"<p>Harry, I follow you. You may very easy make the common sense of the SOA manifesto into a reusable ZYZ manifesto component as blogged <a href=\"http:\/\/liliendahl.wordpress.com\/2009\/10\/26\/universal-pearls-of-wisdom\/<br \/>\n\" rel=\"nofollow\">here<\/a>.<\/p>\n","parent":0},{"id":2291,"name":"ilanchelian","url":"","date":"2009-11-03 08:36:00","content":"<p>punching article. nice.<\/p>\n","parent":0},{"id":2292,"name":"W. Kevin Hazzard","url":"http:\/\/www.gotnet.biz\/Blog","date":"2009-11-07 10:36:59","content":"<p>Hear, hear. SOA became a joke not when the has-beens realized they could sell books by repackaging common sense. It became a joke when the major software vendors decided that competing with common sense principles was more important than innovation and competency.<\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["5b689c6b-a26f-4f71-8a1a-fe2f1e876e42"],"dasblog_compressedtitle":["The+SOA+Manifesto+Ndash+Pointlessness+Manifested"],"dasblog_compressedtitleunique":["2009\/10\/28\/The+SOA+Manifesto+Ndash+Pointlessness+Manifested"]}},"previous_url":"http:\/\/devhawk.net\/2009\/10\/27\/ironpython-2-0-3-and-2-6-rc2\/","next_url":"http:\/\/devhawk.net\/2009\/12\/07\/job-opening-on-my-team\/"}