{"status":"ok","post":{"id":613,"type":"post","slug":"dad-getting-some-link-love","url":"http:\/\/devhawk.net\/2005\/06\/29\/dad-getting-some-link-love\/","status":"publish","title":"Dad getting some link love","title_plain":"Dad getting some link love","content":"<p>After a six month silence, <a href=\"http:\/\/halpierson.blogspot.com\/\">Dad<\/a> posted about what he called <a href=\"http:\/\/halpierson.blogspot.com\/2005\/06\/business-orient-architecture-boa.html\">Business Oriented Architecture (BOA?)<\/a>:<\/p>\n<blockquote><p>If I had to guess what a service oriented architecture will eventually look like, I would guess that it would reflect the business architecture – Business Oriented Architecture (BOA).<span><\/span>Business organizations have evolved over many centuries into a number of common “departments” – sales, accounting, personnel, etc.<span><\/span>Perhaps that is a good starting place for services.<\/p>\n<\/blockquote>\n<p><a href=\"http:\/\/blogs.msdn.com\/jevdemon\">John<\/a> forwarded me a <a href=\"http:\/\/www.veryard.com\/so\/2005\/06\/business-oriented-architecture.htm\">post<\/a> from Richard Veryard where he comments on Dad&#8217;s post:<\/p>\n<blockquote><p>The issues addressed in my book are now becoming mainstream as the technological agenda of service-oriented architecture (SOA) starts to converge with the strategic agenda of the service-based business (SBB). This implies an approach to business strategy that involves dynamically managing the geometry of the business. (To achieve a fully adaptive enterprise we typically need to implement a variable geometry.) We can find elements of this thinking in some of the methodologies coming out of IBM and Microsoft, although from what I&#8217;ve seen so far I don&#8217;t think any of these methodologies go far enough.<\/p>\n<p>Hal calls this Business Oriented Architecture. If anything, I&#8217;d prefer to call it Architecture-Oriented Business. As Hal indicates, this calls for architectural thinking at the business level, which need to be aligned with architectural thinking at the information\/software level.<\/p>\n<\/blockquote>\n<p>This comes back around to the whole SOA top-down vs. bottom-up argument. Something I&#8217;ll comment further on when I&#8217;m not up to my armits in moving boxes. <\/p>\n","excerpt":"<p>After a six month silence, Dad posted about what he called Business Oriented Architecture (BOA?): If I had to guess what a service oriented architecture will eventually look like, I would guess that it would reflect the business architecture – Business Oriented Architecture (BOA).Business organizations have evolved over many centuries into a number of common [&hellip;]<\/p>\n","date":"2005-06-29 16:34:17","modified":"2005-06-29 16:34:17","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["dd828e65-884c-4ed6-af31-f2f9781ad3a1"],"dasblog_compressedtitle":["Dad+Getting+Some+Link+Love"],"dasblog_compressedtitleunique":["2005\/06\/29\/Dad+Getting+Some+Link+Love"]}},"previous_url":"http:\/\/devhawk.net\/2005\/06\/25\/real-world-gat-nunit-converter\/","next_url":"http:\/\/devhawk.net\/2005\/07\/05\/the-inform-language\/"}