{"status":"ok","post":{"id":1007,"type":"post","slug":"wired-for-sound","url":"http:\/\/devhawk.net\/2007\/07\/16\/wired-for-sound\/","status":"publish","title":"Wired for Sound","title_plain":"Wired for Sound","content":"<p>One of the cool things about my house is that it has built in speakers in four rooms and the back deck. Shortly after we first moved in two years ago, we had a combination house warming and Rileyanne&#8217;s christening party. As you might expect, one of the top priorities for said party was music, so I hooked up both my main surround sound receiver plus an old receiver I&#8217;ve had forever and we had tunes pumping everywhere except the dining room (which no one was in anyway).<\/p>\n<p>Then, sometime this past winter, I got tired of NOT having surround sound for my HDTV so I redid the sound system. You might be surprised that it took me over a year to get to that, but remember the part about above about &#8220;Rileyanne&#8217;s christening&#8221;? I had other priorities. Anyway, I hooked up the surround sound, including the set of built-in rear speakers in the TV room, and banished the old receiver back to the garage.<\/p>\n<p>Now, it&#8217;s summer again. We spend lots of time outside and on the back deck, but now sans tunes. So I&#8217;m re-configuring the sound system again, this time so I can get both surround sound and music in the house. Given that it&#8217;s a fairly custom speaker setup, I don&#8217;t think there&#8217;s an affordable off-the-shelf solution that works for this house. <\/p>\n<p>In the long run, I&#8217;m thinking of building a custom amplifier that can drive four sets of speakers (one of the sets in the house is the back surround sound speakers, so they&#8217;re already taken care of) plus some type of UPnP AV client device. <a href=\"http:\/\/www.diyaudioprojects.com\/Chip\/chip.htm\">Gainclone chip amplifiers<\/a> look fairly <a href=\"http:\/\/\">simple to build<\/a> &#8211; three resistors, two capacitors and the chip itself times eight + a power supply. As for the AV client, I haven&#8217;t really investigated yet, but whatever solution I go with has to have high <a href=\"Wife acceptance factor\">WAF<\/a>.<\/p>\n<p>Of course, building a custom amplifier takes time, so I figured in the short run I&#8217;d dust off the old banished receiver and use it to drive two sets of speakers. I also have an old laptop with a bad battery circuit. It can&#8217;t roam, but it can sit there by the TV and pull music off my loft computer and play feed it into said old receiver just fine. It&#8217;s not a high WAF solution, but it&#8217;s something I could put together with parts I had at home + one 1\/8&#8243; to RCA cable from Radio Shack. I figured I could get this up and running over the weekend. Almost, but not quite. <\/p>\n<p>I hit one snag with <a href=\"http:\/\/www.microsoft.com\/windows\/windowsmedia\/knowledgecenter\/mediaadvice\/0109.mspx\">WMP 11 for XP<\/a>. My office machine and my laptop are both running Vista. All my music is on my office machine, but I use WMP 11&#8242;s media sharing capabilities (previously known as <a href=\"http:\/\/www.microsoft.com\/windows\/windowsmedia\/devices\/wmconnect\/default.aspx\">Windows Media Connect<\/a>) to make that media available on my Xbox. I figured I could do the same with the old laptop, using WMP 11 as the AV client. Being an old laptop it can&#8217;t run Vista so I installed a fresh copy of XP instead. However, while WMP 11 XP can share media, it <a href=\"http:\/\/www.microsoft.com\/windows\/windowsmedia\/player\/faq\/sharing.mspx#q20:1\">can&#8217;t consume shared media<\/a> the way WMP 11 Vista can. Best laid plans and all that.<\/p>\n<p>The <a href=\"http:\/\/www.eggheadcafe.com\/software\/aspnet\/30221382\/play-wmp-shared-media-fro.aspx\">workaround<\/a> is to expose the media via file sharing. Simple enough, except now you have to make sure the security is correctly configured between the two machines. Since it&#8217;s a single function device, I hadn&#8217;t bothered to set up a password for the default user. Now, in order to access files off the network, I guess I&#8217;ll have to. <\/p>\n<p>Once I fix this little file sharing and security problem, I think I&#8217;m going to start by looking for a better AV client solution. I know I need a custom amplifier if I want to drive all my speakers, but with my old amp I get music in the kitchen and on the back deck which is where we want it most. On the other hand, the AV Client is the main user experience, so perhaps I should pay it more attention. I&#8217;d love to have a solution that is drivable on the TV via the remote while also isn&#8217;t built on a seven year old slightly busted laptop. <\/p>\n<p>Any suggestions?<\/p>\n","excerpt":"<p>One of the cool things about my house is that it has built in speakers in four rooms and the back deck. Shortly after we first moved in two years ago, we had a combination house warming and Rileyanne&#8217;s christening party. As you might expect, one of the top priorities for said party was music, [&hellip;]<\/p>\n","date":"2007-07-16 11:44:05","modified":"2007-07-16 11:44:05","categories":[{"id":223,"slug":"general-geekery","title":"General Geekery","description":"","parent":0,"post_count":35}],"tags":[{"id":330,"slug":"diy","title":"DIY","description":"","post_count":1},{"id":331,"slug":"home-electronics","title":"Home Electronics","description":"","post_count":1},{"id":248,"slug":"music","title":"Music","description":"","post_count":20}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2548,"name":"Marc Brooks","url":"http:\/\/musingmarc.blogspot.com","date":"2007-07-18 13:29:26","content":"<p>One thing to watch out for when doing WMP11 sharing is that it sends all packets out with TTL value of 1, so they will only cross one router on the way to the other devices.  Additionally, it will only stream to devices on the same subnet, so you might want to switch to the Class B private IP addresses (172.16.0.0 – 172.31.255.255) to insure you&#8217;re not getting hosed by that.  More very useful information is available in the Microsoft document about building WMP11 compatible devices.<\/p>\n<p><a href=\"http:\/\/www.microsoft.com\/whdc\/device\/media\/NetCompat_WMP11.mspx\" rel=\"nofollow\">http:\/\/www.microsoft.com\/whdc\/device\/media\/NetCompat_WMP11.mspx<\/a><\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["1f519169-d2e0-4f8e-9b58-0967796c2da8"],"dasblog_compressedtitle":["Wired+For+Sound"],"dasblog_compressedtitleunique":["2007\/07\/16\/Wired+For+Sound"]}},"previous_url":"http:\/\/devhawk.net\/2007\/07\/13\/ovechkin-as-superman\/","next_url":"http:\/\/devhawk.net\/2007\/07\/18\/morning-coffee-102\/"}