{"status":"ok","post":{"id":693,"type":"post","slug":"more-on-xsfp","url":"http:\/\/devhawk.net\/2006\/02\/14\/more-on-xsfp\/","status":"publish","title":"More on XSFP","title_plain":"More on XSFP","content":"<p><a href=\"http:\/\/gonze.com\/weblog\/\">Lucas Gonze<\/a> left me a <a href=\"http:\/\/devhawk.net\/CommentView,guid,32bca2ee-e564-4151-af30-e1d23e7f517e.aspx#85758f3a-8ba4-431e-8efe-77370dc7d4a9\">comment<\/a> indicating they had in fact <a href=\"http:\/\/gonze.com\/rss_plus_time.html\">investigated using RSS<\/a> for XSFP instead of starting from scratch. Good to know they considered the possibility. Unfortunately, it looks like they were using RSS 1.0 so it has all the extra RDF stuff which really hasn&#8217;t caught on. The document doesn&#8217;t really go into the reasons they chose to go a different way, though Lucas does say the following:<\/p>\n<blockquote><p>RSS didn&#8217;t make sense for a lot of reasons. We were paving cowpaths, and RSS for playlists was very much not a cowpath. Playlists are about sequence, while RSS has no concept of sequence except reverse chronological order. We needed abstractions to deal with the fact that music and movies frequently don&#8217;t have URLs, and RSS didn&#8217;t have them. If not starting from scratch was critical, HTML preceded RSS and would be the default to work from. <\/p>\n<\/blockquote>\n<p>I&#8217;m not sure I get Lucas&#8217; point about sequence. Both RSS and XSFP have sequence. Sure, RSS is typically describing web site content, thus it&#8217;s a reverse chronological order. But the RSS spec doesn&#8217;t mandate and specific meaning to the items in the feed. In fact, the items typically have a pubDate element making the order in the feed somewhat irrelevant. According to the <a href=\"http:\/\/www.xspf.org\/xspf-v1.html\">spec<\/a>, XSFP uses the order of the tracks in the file as the implicit playback order. Why that wouldn&#8217;t work with RSS is a mystery to me. <\/p>\n<p>As for the &#8220;needed abstractions&#8221; missing from RSS, I&#8217;d be curious to know what those are and why they couldn&#8217;t be added via <a href=\"http:\/\/www.rssboard.org\/rss-2-0#extendingRss\">RSS extensions<\/a>. <\/p>\n<p>Lucas, please don&#8217;t take these comments as criticisms. I&#8217;m new in this space and I&#8217;m trying to get my head around stuff. Furthermore, if the success of RSS proves anything, it&#8217;s that number of users matters a lot more than the perceived technical merit of a given approach.<\/p>\n","excerpt":"<p>Lucas Gonze left me a comment indicating they had in fact investigated using RSS for XSFP instead of starting from scratch. Good to know they considered the possibility. Unfortunately, it looks like they were using RSS 1.0 so it has all the extra RDF stuff which really hasn&#8217;t caught on. The document doesn&#8217;t really go [&hellip;]<\/p>\n","date":"2006-02-14 16:09:57","modified":"2006-02-14 16:09:57","categories":[],"tags":[{"id":248,"slug":"music","title":"Music","description":"","post_count":20},{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2902,"name":"Lucas Gonze","url":"http:\/\/gonze.com","date":"2006-02-15 18:26:56","content":"<p>RSS is not about lists so much as it&#8217;s about reverse-chronological journals.  There are assumptions about the weblog form buried deep in the format, for example the idea that all entries would have some sensible reason to have a pubDate.<\/p>\n<p>We could indeed do playlists as an RSS extension, and at the time we started on XSPF some people were experimenting with that.  Those experiments didn&#8217;t work out for three reasons.  One, many RSS features just weren&#8217;t applicable to playlists and would create needless verbosity.  Two, many playlist features weren&#8217;t already in RSS and would have to be invented no matter what we did.  Three, our target user base was developers of MP3 players, who would be actively turned off by having to deal with RSS.  XSPF is much much much simpler than RSS.  On the whole, an RSS-based approach would have been buggier, harder, and hard to sell.  <\/p>\n<p>Now my question for you: why are you looking at multimedia through RSS-colored glasses?  Why should web logs be the model for playlists?<\/p>\n","parent":0},{"id":2903,"name":"DevHawk","url":"","date":"2006-02-16 10:39:41","content":"<p>I believe your understanding of RSS to be flawed. If you read the 2.0 spec, you&#8217;ll notice that there are no assumptions baked into the spec. Sure, it&#8217;s primarily used for weblogs, but RSS doesn&#8217;t mandate weblogs. For example, your point about pubDate is incorrect. PubDate, like all other defined item elements, is optional. <\/p>\n<p>From the link you left in your last post, it&#8217;s pretty clear you were looking at the 1.0 version of the RSS spec which was significantly more verbose. Have you looked at the 2.0 spec?<\/p>\n<p>I&#8217;m not looking at multimedia through RSS-colored glasses. I&#8217;m seeing yet another list format that is semantically similar but syntactically different from RSS. That means that instead of using well known (and well tested) RSS libraries to process playlist feeds, I have to write everything from scratch. That creates more bugs, not less.<\/p>\n<p>Given the popularity of podcasting &#8211; which of course uses RSS as the feed format &#8211; RSS for multimedia seems to be working well already. From my reading of the spec, an XPSF feed is basically an RSS feed without some of the elements that are optional in RSS anyway. <\/p>\n","parent":0},{"id":2904,"name":"Lucas Gonze","url":"http:\/\/gonze.com","date":"2006-02-16 11:54:34","content":"<p>That&#8217;s XSPF, not XPSF.<\/p>\n<p>It is silly to say that there are no assumptions baked into the spec.<\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["72f184eb-d99a-47f3-b395-182314447338"],"dasblog_compressedtitle":["More+On+XSFP"],"dasblog_compressedtitleunique":["2006\/02\/15\/More+On+XSFP"]}},"previous_url":"http:\/\/devhawk.net\/2006\/02\/14\/reinventing-the-list\/","next_url":"http:\/\/devhawk.net\/2006\/02\/16\/introducting-devhawk-designs\/"}