{"status":"ok","post":{"id":910,"type":"post","slug":"answering-dr-nicks-questions-on-ssb-wcf","url":"http:\/\/devhawk.net\/2007\/03\/15\/answering-dr-nicks-questions-on-ssb-wcf\/","status":"publish","title":"Answering Dr. Nick&#8217;s Questions on SSB &#038; WCF","title_plain":"Answering Dr. Nick&#8217;s Questions on SSB &#038; WCF","content":"<p>Nick Allen <a href=\"http:\/\/blogs.msdn.com\/drnick\/archive\/2007\/03\/15\/looking-for-sql-service-broker-users.aspx\">asked on his blog<\/a> about how people would like to see SSB and WCF work together. He&#8217;s already heard these from me, but I figured I&#8217;d put them out there for everyone to see and debate. Plus, I had several beers last night at the MVP dinner, so this is likely to be more coherent than I was yesterday! <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" class=\"grouped_elements\" rel=\"tc-fancybox-group910\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n<p>1. Are you interested in SSB because you&#8217;d like to have your service closer to the database? How close is close enough to the database?<\/p>\n<blockquote><p>I&#8217;ve first blogged about the <a href=\"http:\/\/devhawk.net\/2004\/04\/22\/The+Endangered+MiddleTier+Part+2.aspx\">endangered middle tier<\/a> almost three years ago. My point at the time was that as you break your monolithic system up into services, the vast majority of those services won&#8217;t need to scale out. You performance gets better the closer you are to the data. If you don&#8217;t need to scale out, why not get the maximum boost by running in the database process itself?<\/p>\n<p>Furthermore, in large IT shops, the database files are stored out on the SAN rather than on hard drives attached to the database server itself. That means the database server is effectively stateless. Why add a second stateless tier if you don&#8217;t need scale out? If you need more performance in a given service, you can detach the database file from it&#8217;s current SQL server box and attach it on another more beefy SQL server box without physically moving the database files at all. This enables what I call the &#8220;Star Trek Effect&#8221;, where you can shift computing power where it is needed most (more power to the payroll system!). <\/p>\n<p>Of course, if you&#8217;re going to move the service, you do need to bring it down for a short time. That implies a need for durable messaging so that service consumers aren&#8217;t affected by the brief service interruption. Which brings us to&#8230;<\/p>\n<\/blockquote>\n<p>2. Are you interested in SSB because you need durable, duplex messaging between two services? Do you need exactly-once-in-order message delivery?<\/p>\n<blockquote><p>Yes. SSB has a bunch of other nice features, but durable duplex messaging is what I need the most. Exactly-once-in-order is also fairly critical, though there may be scenarios where it&#8217;s not really necessary. Those are the exception, not the rule however. <\/p>\n<p>Doesn&#8217;t WS-RM already do EOIO already?<\/p>\n<\/blockquote>\n<p>3. Are you interested in using SSB from WCF because you want a better asynchronous messaging experience than MSMQ? What makes you prefer SSB to other queuing products?<\/p>\n<blockquote><p>My primary problem with MSMQ for the problems I&#8217;m tasked with solving is that MSMQ is one way while SSB supports duplex messaging. You could do duplex messaging with MSMQ if you didn&#8217;t mind managing multiple queues (one for each side of the conversation) but SSB does this for you for free. I&#8217;m sure there are scenarios where pure one-way messaging are useful, but they are few and far between in my day job.<\/p>\n<p>Furthermore, SSB has the explicit idea of a service instance (they call it a conversation group) which MSMQ lacks. SSB&#8217;s implementation is conceptually similar to the new WCF\/WF integration work in the latest Orcas CTP.<\/p>\n<p>Finally, SSB uses logical naming. You have conversations between services, but services get mapped to physical addresses at the routing layer. This allows services to move around more easily (see the &#8220;Star Trek Effect&#8221; in #1 above). Both MSMQ and WCF use physical addresses, which makes them much more difficult to move.<\/p>\n<\/blockquote>\n<p>4. Are you interested in having your data contracts defined in WCF, SQL, or both?<\/p>\n<blockquote><p>I like WCF&#8217;s data contract infrastructure. We did a early prototype long-running service with both WCF and SSB. the messaging stack code was obviously different, but we used the exact same data contract code. I even wrote some code to automatically deserialize the SSB message by mapping the SSB message type to a data contract.<\/p>\n<p>I want my services to run inside the database, but that doesn&#8217;t mean I want to write them in T-SQL. Personally, I&#8217;m much more productive in C# and\/or WF. So WCF data contracts are fine by me.<\/p>\n<\/blockquote>\n","excerpt":"<p>Nick Allen asked on his blog about how people would like to see SSB and WCF work together. He&#8217;s already heard these from me, but I figured I&#8217;d put them out there for everyone to see and debate. Plus, I had several beers last night at the MVP dinner, so this is likely to be [&hellip;]<\/p>\n","date":"2007-03-15 11:44:30","modified":"2007-03-15 11:44:30","categories":[],"tags":[{"id":320,"slug":"service-broker","title":"Service Broker","description":"","post_count":14},{"id":313,"slug":"wcf","title":"WCF","description":"","post_count":31}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2466,"name":"Arnon Rotem-Gal-Oz","url":"http:\/\/www.rgoarchitects.com\/blog","date":"2007-03-16 23:32:19","content":"<p>Regarding your point #1<br \/>\nIt does look that SQL 2005 has almost everything to become an application server (I wrote about it Jul 2005:<br \/>\n<a href=\"http:\/\/www.rgoarchitects.com\/blog\/PermaLink,guid,4dcc5298-e9ff-4a9a-880a-aa886d143f9e.aspx\" rel=\"nofollow\">http:\/\/www.rgoarchitects.com\/blog\/PermaLink,guid,4dcc5298-e9ff-4a9a-880a-aa886d143f9e.aspx<\/a>)<br \/>\nBut it seems that Microsoft got cold feet somewhere along the way and never really promoted this as an option. <\/p>\n<p>Also in regard to SSB. It offers some great features but having only an SQL API (I know you can createa C# facade &#8211; been there, done that, got the t-shirt) and a proprietary transport directs it into a niche instead of main-stream<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["1f926b66-cbeb-457a-83bb-568ee05448fb"],"dasblog_compressedtitle":["Answering+Dr+Nicks+Questions+On+SSB+Amp+WCF"],"dasblog_compressedtitleunique":["2007\/03\/15\/Answering+Dr+Nicks+Questions+On+SSB+Amp+WCF"]}},"previous_url":"http:\/\/devhawk.net\/2007\/03\/15\/morning-coffee-45\/","next_url":"http:\/\/devhawk.net\/2007\/03\/15\/im-wrong-because-ruby-and-powershell-are-mainstream\/"}