{"status":"ok","post":{"id":388,"type":"post","slug":"teched-sessions-online","url":"http:\/\/devhawk.net\/2004\/06\/25\/teched-sessions-online\/","status":"publish","title":"TechEd Sessions Online","title_plain":"TechEd Sessions Online","content":"<p>Streaming producer presenations from TechEd US have been posted. However, the streaming presenation site has the same <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=7933dc2b-d9ae-46d0-8827-f67e7a884b39\">lack-of-url-addressability<\/a> issue that TechEd Breakout session list had. Is it so hard to just post a simple HTML file with a list of all the sessions in a track? &lt;sigh&gt;<\/p>\n<p>Anyway, here are links to the top 5 sessions from this year&#8217;s architecture track. For those who could not make it to TechEd (or were there, but missed these sessions) enjoy!<\/p>\n<ol>\n<li>Realizing SOA by <a href=\"http:\/\/blogs.msdn.com\/jdevados\">John deVadoss<\/a> &amp; <a href=\"http:\/\/blogs.msdn.com\/RJacobs\/\">Ron Jacobs<\/a><\/li>\n<li>Data in SOA by Harry Pierson (i.e. yours truly)\n<\/li>\n<li>Patterns in the Enterprise by <a href=\"http:\/\/www.enterpriseintegrationpatterns.com\/ramblings.html\">Gregor Hohpe<\/a><\/li>\n<li>Improving Application Perf &amp; Scale by <a href=\"http:\/\/www.vergentsoftware.com\/blogs\/ckinsman\/\">Chris Kinsman<\/a><\/li>\n<li>Building Apps with P&amp;P App Blocks by Wojtek Kozaczynski<\/li>\n<\/ol>\n<p><strong>UPDATE<\/strong> &#8211; The streaming site has been taken down, so none of the links work anymore. Sorry about that. We will be updating the <a href=\"http:\/\/msdn.microsoft.com\/architecture\/overview\/series\">Architecture Strategy Series<\/a> at some point in the future with at least the Realizing SOA and Data in SOA talks.<\/p>\n","excerpt":"<p>Streaming producer presenations from TechEd US have been posted. However, the streaming presenation site has the same lack-of-url-addressability issue that TechEd Breakout session list had. Is it so hard to just post a simple HTML file with a list of all the sessions in a track? &lt;sigh&gt; Anyway, here are links to the top 5 [&hellip;]<\/p>\n","date":"2004-06-25 10:19:21","modified":"2004-06-25 10:19:21","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":213,"slug":"community","title":"Community","description":"","post_count":81},{"id":340,"slug":"patterns","title":"Patterns","description":"","post_count":7},{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2625,"name":"Steve Hall","url":"","date":"2004-06-25 14:50:58","content":"<p>Worse than lack of a list of URLs is the lack of downloadable video files.  Every chance I&#8217;ve had in the past 4-5 years, I&#8217;ve begged and begged everyone and anyone involved with various video &#8220;feeds&#8221; to consider the plight of the poor developers (read:  me!) who CANNOT &#8220;waste time&#8221; at work (according to my managers) by watching streaming video (for hours on end).  (Managers see this as two things:  an abhorred non-ROI expense, since they hate all things &#8220;training&#8221;-like, and slipped schedules.)<\/p>\n<p>I&#8217;am also unfortunately broadband-challenged at home (no access in my neighborhood), so the idea of watching streaming video at home won&#8217;t work either.<\/p>\n<p>Each time I&#8217;ve brought this up (the last time was about a series of videos on the Architecture portal&#8230;which were never made available for download), I&#8217;ve been told &#8220;we&#8217;re working on it&#8221;&#8230;but the downloadable files never appear.<\/p>\n<p>A third reason for downloadable video files is that there a quite a few developers here in Silicon Valley that are in &#8220;enemy camps&#8221;:  companies filled with Java and Linux bigots&#8230;&#8230;and find it extremely hard to pass on information, unless its in the form of a DVD they can view at their leisure.<\/p>\n<p>And, of course, a fourth reason for downloadable video files is that The DotNet Show and MSDN TV are downloadable.<\/p>\n<p>Having said all this, while at the PDC03 I once again asked over a dozen people about downloadable files for all the breakout sessions (even though I&#8217;d already paid for the conference video DVDs), and was happy to find out they were doing just that, which set a new low-bar standard for conference coverage.<\/p>\n<p>Thus, can we expect the same for TechEd04?  Who do I need to beg this time?  (You certainly shouldn&#8217;t have to be posting URLs to individual breakout sessions&#8230;)<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["1b59570f-eb5b-41cd-8a87-0e2d548c498a"],"dasblog_compressedtitle":["TechEd+Sessions+Online"],"dasblog_compressedtitleunique":["2004\/06\/25\/TechEd+Sessions+Online"]}},"previous_url":"http:\/\/devhawk.net\/2004\/06\/25\/back-on-email\/","next_url":"http:\/\/devhawk.net\/2004\/06\/27\/welcome-maddy\/"}