[
  {
    "author-name": "Darrell",
    "author-email": "darrellnorton@yahoo.com",
    "author-url": "http://dotnetjunkies.com/weblog/darrell.norton/",
    "date": "2004-01-04T21:19:16-08:00",
    "content": "Funny you feel that way.  But all coaches agreed at the beginning of the season to play by the BCS rules, which means the BCS rankings are non-contestable.\n\nMaybe feedback from this year will make the BCS better, but the #1 team will be LSU (having just watched them beat OU)."
  },
  {
    "author-name": "Harry",
    "author-email": "",
    "author-url": "",
    "date": "2004-01-05T17:22:54-08:00",
    "content": "True, but the general consensus from the articles I've read is that the BCS really screwed up on this one. The fact is that the coaches were forced to vote LSU, rather than being allowed to honestly vote their opinion. I wonder how many coaches would have droped USC to #2 if they had had any choice in the matter.\n\nThough, truth be told, I'm glad LSU won. I didn't think OU deserved to be there and based on what I've read about the game, they proved that on the field. "
  },
  {
    "author-name": "Bryan Daneman",
    "author-email": "",
    "author-url": "http://bryan.daneman.org/",
    "date": "2004-01-06T10:40:33-08:00",
    "content": "What I found most interesting about the final coaches poll is that 3 coaches actually broke from their contractual obligation and voted for USC as #1.  \n\nA couple of weeks ago I heard an interview with Grant Teaff, the Executive Director of the American Football Coaches Association, which is the group that does the coaches poll and agreed to name the BCS champion as their champion, and he claimed that on the final ballot they only had slots for 2-25 -- that they truly couldn't vote for #1 even if they wanted to.  So I wonder what those three coaches did, or was Teaff just blowing smoke?\n\nMore interesting would be to find out who those three coaches were and see if they are invited to participate next year."
  }
]