{"status":"ok","post":{"id":716,"type":"post","slug":"ray-ozzie-on-simple-bridge-building","url":"http:\/\/devhawk.net\/2006\/03\/07\/ray-ozzie-on-simple-bridge-building\/","status":"publish","title":"Ray Ozzie on Simple Bridge Building","title_plain":"Ray Ozzie on Simple Bridge Building","content":"<p>Ray has <a href=\"http:\/\/spaces.msn.com\/rayozzie\/blog\/cns!FB3017FBB9B2E142!285.entry\">posted extensively<\/a> about his session this morning, but if you haven’t read it the basic idea is “How do we bring the copy and paste paradigm to the web?” Sure, for this crowd he might have been better off saying “the UNIX pipe paradigm”, but the result is the same. How do have a simple way of letting an end user connect systems together? The idea of using the clipboard paradigm is brilliant in its simplicity.<\/p>\n<p>The coolest part of the demo IMO was the integration between the Live Clipboard (of course, it’s branded <a href=\"http:\/\/www.live.com\">Live<\/a>) and the desktop. Copy an event out of <a href=\"http:\/\/eventful.com\/\">Eventful<\/a>, paste into <a href=\"http:\/\/office.microsoft.com\/en-us\/FX010857931033.aspx\">Outlook<\/a>. Copy an image out of <a href=\"http:\/\/www.flickr.com\">Flickr<\/a>, paste into the file system. Even cooler: Paste an image feed out of Flickr and paste into a folder in the file system with integration into the <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/FeedsAPI\/rss\/rss_entry.asp\">Feeds API<\/a> to keep the local folder in sync with the Flickr feed (OK, the Feed API integration wasn’t done in time to demo). This was the best demo of the all the keynotes.<\/p>\n<p>I need to think more about the implications of this. First off is the importance of data formats. I’ve written about <a href=\"http:\/\/devhawk.net\/2006\/02\/14\/Reinventing+The+List.aspx\">RSS as the generic list<\/a> semantics on top of XML, but I’m thinking <a href=\"http:\/\/www.microformats.com\">microformats<\/a> will be huge when combined with Live Clipboard. Also, there’s the implication of user driven integration. <a href=\"http:\/\/pathelland.com\">Pat Helland<\/a> derides the clipboard in <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/dnmaj\/html\/aj2metrop.asp\">Metropolis<\/a>, but the support for structured data eliminates the Pat’s primary issues with the clipboard as an integration medium. Finally, there’s huge implication in the enterprise for this, but I’m not sure how positive it is. IT shops are already struggling with thousands of shadow applications built on Office running in the wild. If I can copy structured data out of an enterprise app and paste it into Excel without losing the schema, it will encourage still more of these shadow apps. IT will hate it, but users will love it. <\/p>\n","excerpt":"<p>Ray has posted extensively about his session this morning, but if you haven’t read it the basic idea is “How do we bring the copy and paste paradigm to the web?” Sure, for this crowd he might have been better off saying “the UNIX pipe paradigm”, but the result is the same. How do have [&hellip;]<\/p>\n","date":"2006-03-07 23:44:59","modified":"2006-03-07 23:44:59","categories":[],"tags":[{"id":297,"slug":"etech","title":"ETech","description":"","post_count":15},{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["cc1f65f1-3b1e-423e-b79e-2aa76c5ba6de"],"dasblog_compressedtitle":["Ray+Ozzie+On+Simple+Bridge+Building"],"dasblog_compressedtitleunique":["2006\/03\/08\/Ray+Ozzie+On+Simple+Bridge+Building"]}},"previous_url":"http:\/\/devhawk.net\/2006\/03\/07\/etech-day-two\/","next_url":"http:\/\/devhawk.net\/2006\/03\/07\/felipe-cabrera-on-amazons-mechanical-turk\/"}