{"status":"ok","post":{"id":198,"type":"post","slug":"first-day-on-the-new-job","url":"http:\/\/devhawk.net\/2003\/09\/22\/first-day-on-the-new-job\/","status":"publish","title":"First Day on the New Job","title_plain":"First Day on the New Job","content":"<p>Not much accomplished, but it was only my first day. I hear this rumble of the coming avalanche of stuff to do but it&#8217;s not here yet. We had a team meeting where we did introductions. The team is pretty much evenly split between people who I knew before today and people who&#8217;s names I haven&#8217;t learned yet. First meeting with the boss is tomorrow so I&#8217;m guessing that&#8217;s when I&#8217;ll get buried in work.<\/p>\n<p>One of my new teammates is <a href=\"http:\/\/simonguest.com\/\">Simon Guest<\/a>, who gave me a shout on his blog today and added me to his very exclusive blogroll. I&#8217;m making some big changes to my blog tool (more on that later) but I&#8217;ll return the favor soon. In the meantime, check out Simon&#8217;s new book: <a href=\"http:\/\/www.microsoft.com\/MSPress\/books\/6711.asp\">.NET and J2EE Interop Toolkit<\/a>. Everyone on this team seems to have a niche, Simon&#8217;s is .NET\/J2EE interop. Not sure what mine will be yet (other than community, natch).<\/p>\n<p>Over the weekend, I had an email discussion with <a href=\"http:\/\/www.jnsk.se\/weblog\/\">Jimmy Nilsson<\/a> that started when he asked if I&#8217;ll be working more with application architecture or interop architecture. As far as I understand, I&#8217;m responsible for fostering community for all types of architects. This would include at least strategic, applicaiton, interop, data, infrastructure and security architects with others added as appropriate. (For example, do we need to call out a unique messaging architect or is that just part of infrastructure?) However, we got a little confused over the use of the term &#8220;application&#8221;. <\/p>\n<p>I&#8217;m going to try and use the terms from our <a href=\"http:\/\/msdn.microsoft.com\/architecture\/application\/default.aspx?pull=\/library\/en-us\/dnea\/html\/eaappconland.asp\"> Application Architecture Conceptual View<\/a> (written by two more of my new teammates Maarten Mullender and Mike Burner). Part of the issue is the overloading of terms like &#8220;service&#8221; and &#8220;process&#8221;. In particular, I&#8217;ll be using the following terms from the <a href=\"http:\/\/msdn.microsoft.com\/architecture\/application\/default.aspx?pull=\/library\/en-us\/dnea\/html\/eaappconapplications.asp\"> Application section<\/a> of the conceptual view:<\/p>\n<ul>\n<li>Business Service &#8211; A service exposing mission critical enterprise data. In crude terms, take a typical three tier <a href=\"http:\/\/msdn.microsoft.com\/architecture\/application\/default.aspx?pull=\/library\/en-us\/dnbda\/html\/AppArchCh2.asp\"> architecture<\/a>, and replace the presentation layer with a service façade. I&#8217;ve been known to call this a &#8220;data-oriented&#8221; service.<\/li>\n<li>Process Service &#8211; A service that ties together other services into a larger business process. These services could be business services or other process services. I&#8217;ve been known to call this a &#8220;task-oriented&#8221; service since business process is typically tied to business tasks.<\/li>\n<li>User Interface &#8211; A system that is designed to interact with a user and leverages one or more services on the back end. I&#8217;d like to call this an application, but I&#8217;m worried people will think I&#8217;m talking about a tightly coupled system rather than a UI on top of a set of loosely coupled services.<\/li>\n<\/ul>\n<p>Maybe, as a community, we can come up with standard definitions or even better names for some of these elements.<\/p>\n<p>BTW, just because I&#8217;m avoiding the use of the word &#8220;application&#8221; doesn&#8217;t mean that application architecture goes away. If you look at books like <a href=\"http:\/\/www.martinfowler.com\/books.html#eaa\">P of EAA<\/a>, there are patterns for building user interfaces (such as web presentation and session state) and patterns for building business services (such as domain logic and data source). Even if the business services and user interfaces are separate and loosely coupled, these patterns are still entirely relevant.<\/p>\n","excerpt":"<p>Not much accomplished, but it was only my first day. I hear this rumble of the coming avalanche of stuff to do but it&#8217;s not here yet. We had a team meeting where we did introductions. The team is pretty much evenly split between people who I knew before today and people who&#8217;s names I [&hellip;]<\/p>\n","date":"2003-09-22 17:28:18","modified":"2003-09-22 17:28:18","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["35863c4c-b12f-4d2f-b09c-3ba617637ae4"],"dasblog_compressedtitle":["First+Day+On+The+New+Job"],"dasblog_compressedtitleunique":["2003\/09\/23\/First+Day+On+The+New+Job"]}},"previous_url":"http:\/\/devhawk.net\/2003\/09\/19\/today-is-the-last-day-of-my-life-so-far\/","next_url":"http:\/\/devhawk.net\/2003\/09\/23\/geek-dinner-alert\/"}