{"status":"ok","post":{"id":90,"type":"post","slug":"xml-is-not-just-a-deserialized-object-graph","url":"http:\/\/devhawk.net\/2003\/05\/15\/xml-is-not-just-a-deserialized-object-graph\/","status":"publish","title":"XML Is Not Just a Deserialized Object Graph","title_plain":"XML Is Not Just a Deserialized Object Graph","content":"<p>One of the things I did in my latest version of <a href=\"prj_sharepointsynd.aspx\">WSS RSS<\/a> was add a configuration file. I didn&#8217;t just use web.config since WSS has a tendency to overwrite it when you upgrade a new virtual server to support WSS. However, I didn&#8217;t go the usual route of parsing the XML configuration information into objects via serialization or some other mechanism. Instead, I just loaded up an XmlDocument and queried it with XPath whenever I need to read configuration information. I do this multiple times per web request (once per web and list in the feed). <\/p>\n<p>This leads me to my point &#8211; I&#8217;m beginning to think the whole idea of XML serialization is off base. Given an object graph, I can serialize it into XML and then deserialize it into an identical object graph. However, I don&#8217;t think I can take an arbitrary XML document and always be able to deserialize it into an object graph. XML concepts like derivation by restriction are difficult to model in a strongly typed object model like CLR&#8217;s. And since I have XPath, I don&#8217;t think I want to always deserialize my XML into objects &#8211; it was much simpler to execute XPath queries than it would have been to manually traverse the object graph or build my own query mechanism.<\/p>\n","excerpt":"<p>One of the things I did in my latest version of WSS RSS was add a configuration file. I didn&#8217;t just use web.config since WSS has a tendency to overwrite it when you upgrade a new virtual server to support WSS. However, I didn&#8217;t go the usual route of parsing the XML configuration information into [&hellip;]<\/p>\n","date":"2003-05-15 08:30:13","modified":"2003-05-15 08:30:13","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["5643b052-f1f2-4c53-ac33-e33d0910f917"],"dasblog_compressedtitle":["XML+Is+Not+Just+A+Deserialized+Object+Graph"],"dasblog_compressedtitleunique":["2003\/05\/15\/XML+Is+Not+Just+A+Deserialized+Object+Graph"]}},"previous_url":"http:\/\/devhawk.net\/2003\/05\/14\/the-matrix-is-reloading\/","next_url":"http:\/\/devhawk.net\/2003\/05\/16\/cool-sql-tool\/"}