{"status":"ok","post":{"id":649,"type":"post","slug":"grady-booch-sez-throw-models-away","url":"http:\/\/devhawk.net\/2005\/11\/07\/grady-booch-sez-throw-models-away\/","status":"publish","title":"Grady Booch sez &#8220;Throw Models Away&#8221;","title_plain":"Grady Booch sez &#8220;Throw Models Away&#8221;","content":"<p>I wasn&#8217;t there, but apparently <a href=\"http:\/\/www-128.ibm.com\/developerworks\/blogs\/dw_blog.jspa?blog=317\">Grady Booch<\/a> made a comment at <a href=\"http:\/\/www.oopsla.org\/2005\">OOPSLA<\/a> last month that throwing away models is a good thing. <a href=\"http:\/\/www.metacase.com\/blogs\/jpt\/blogView\">Juha-Pekka&#8217;s<\/a><a href=\"http:\/\/www.metacase.com\/blogs\/jpt\/blogView?showComments=true&amp;entry=3308396982\">account<\/a> of the <a href=\"http:\/\/www.oopsla.org\/2005\/ShowEvent.do?id=304\">Design and Modern Software Practices Panel<\/a> has Grady saying &#8220;when the project gets closer to the delivery you normally throw away UML models. This is a natural choice since the efforts needed for keeping the design &#8211; user view, dynamics, behavior, interaction etc. &#8211; linked with the implementation are simply too high.&#8221; <a href=\"http:\/\/ivan.truemesh.com\/\">Ivan Moore<\/a><a href=\"http:\/\/ivan.truemesh.com\/archives\/000542.html\">has Grady saying<\/a> &#8220;I often throw models away but tend not to throw away the source code.&#8221; <\/p>\n<p>I&#8217;ve gotta believe that this comment was somehow taken out of context and that the Grand Poobah of the <a href=\"http:\/\/devhawk.net\/2004\/12\/10\/Booch+On+DSLs+Round+3.aspx\">Common Semantic Model<\/a> doesn&#8217;t actually believe that tossing the model at the end o the project is a good thing. If we view these comments thru the lens of <a href=\"http:\/\/devhawk.net\/2005\/10\/05\/Code+Is+Model.aspx\">Code is Model<\/a>, you realize this is a major violation of the &#8220;Models must be Intrinsic to the Development Process&#8221; tenet. Since code is model, it seems silly to throw out the UML model and keep the code model. The only reason I could think to do that, is because the UML model has no value.<\/p>\n<p>And this leaves me wondering, exactly how much benefit does Grady Booch get from his UML model if he&#8217;s willing to throw them away near the end of the project.<\/p>\n","excerpt":"<p>I wasn&#8217;t there, but apparently Grady Booch made a comment at OOPSLA last month that throwing away models is a good thing. Juha-Pekka&#8217;saccount of the Design and Modern Software Practices Panel has Grady saying &#8220;when the project gets closer to the delivery you normally throw away UML models. This is a natural choice since the [&hellip;]<\/p>\n","date":"2005-11-07 15:57:58","modified":"2005-11-07 15:57:58","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2867,"name":"Tomas Restrepo","url":"http:\/\/www.winterdom.com\/weblog","date":"2005-11-08 03:09:35","content":"<p>Well, to me the UML diagrams are just a tool, a means to an end, but not the end itself. They are very nice to quickly visualize and start thinking about the relationships in the code and it&#8217;s behavior, but there comes a moment at which code is just so much better at it that it might not be useful to keep synching them by hand. <\/p>\n<p>What I mean is that, at that point, the UML diagrams become useful as a visualization tool, and no longer as useful as a design tool (though by no means useless); and that&#8217;s where model generation from code becomes far more interesting.<\/p>\n","parent":0},{"id":2868,"name":"CatoTheElderII","url":"","date":"2005-11-09 14:39:36","content":"<p>I think what they are saying is that you should use the UML at first to design the system, but since UML tools do not do a good job of making it easy to keep code and UML models in synch you get to a point where the maintenance is no longer worth the benefit, and therefore they toss the UML models in the trash after that point is reached.  There would be no point in keeping them unless you intend to keep them up to date with the code, and since that becomes very burdensome after a while, it is more economical to throw them away.  This, of course, has nothing to do with wether or not UML models are useful, of course they are.  It has everything to do with the failure of the tools to provide an easy means of syncrhonizing code and models.  Makes sense to me.  If the tools vendors make the link then you will find the &#8220;throw them away&#8221; rule abandonned and people will then say, &#8220;Keep them&#8221;.   That&#8217;s my take.<\/p>\n","parent":0},{"id":2869,"name":"Peter Provost","url":"http:\/\/www.peterprovost.org\/","date":"2005-11-12 15:21:48","content":"<p>If Code-Is-Model is really an accurate statement, then throwing away the non-code model (the UML) is a completely legitimate thing to do as soon as it loses its value or gets in the way of maintaining the model that matters (the code).<\/p>\n<p>I think Grady&#8217;s point here (I wasn&#8217;t there) had to be something like this: Use a UML model (or whatever other high abstraction language you choose) when it has value and throw it away the moment it gets in your way or become an intolerable tax on your project.<\/p>\n<p>This is why I&#8217;ve always felt that all &#8220;code-as-model&#8221; modeling tools should use the code as the serialization format for the model. This is what the old Together tool did and that is why people liked it so much. The UML was just a way to visualize your code. There was no such thing as round tripping because there was only one thing&#8230;<\/p>\n<p>The code.<\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["4aa1697c-9cab-4c62-be7d-c805cbd4c1c3"],"dasblog_compressedtitle":["Grady+Booch+Sez+Throw+Models+Away"],"dasblog_compressedtitleunique":["2005\/11\/07\/Grady+Booch+Sez+Throw+Models+Away"]}},"previous_url":"http:\/\/devhawk.net\/2005\/11\/04\/deploying-databases-with-sql-server-express\/","next_url":"http:\/\/devhawk.net\/2005\/11\/08\/thoughts-on-architecture-journal-5\/"}