{"status":"ok","post":{"id":707,"type":"post","slug":"assorted-remaining-etech-day-two-keynotes-sessions","url":"http:\/\/devhawk.net\/2006\/03\/08\/assorted-remaining-etech-day-two-keynotes-sessions\/","status":"publish","title":"Assorted Remaining ETech Day Two Keynotes &#038; Sessions","title_plain":"Assorted Remaining ETech Day Two Keynotes &#038; Sessions","content":"<p><strong><u>Jeff Han on Multi-Touch Interfaces <br \/><\/u><\/strong>This was a cool demo, but was basically a live version of the <a href=\"http:\/\/mrl.nyu.edu\/~jhan\/ftirtouch\/\">associated video<\/a> that made the rounds on the web a few weeks ago. There’s huge potential here, but he kept doing the same zoom in and out demo over an over. Can’t wait to see practical availability of this type of device.<\/p>\n<p><strong><u>Cory Ondrejka on Second Life<br \/><\/u><\/strong>I’d heard of <a href=\"http:\/\/secondlife.com\">Second Life<\/a> before, but I had never really seen it before today. Wow. I hacked around with <a href=\"http:\/\/en.wikipedia.org\/wiki\/MUSH\">MUSHes<\/a> back in college, so it was a little familiar. But I didn’t realize there were people <a href=\"http:\/\/www.wired.com\/news\/technology\/0,70153-0.html\">making real livings<\/a> in Second Life. Who knew you could make $150k a year <a href=\"http:\/\/www.anshechung.com\/\">prospecting virtual real estate<\/a>? Cory only had 15 minutes to talk, so we only got a taste of Second Life. He’s got a full session tomorrow, so I’ll post more then.<\/p>\n<p><strong><u>Linda Stone on Attention, the “Real” Aphrodisiac<br \/><\/u><\/strong>Unlike the other talks on attention, this one didn’t try and frame it as an economy, so that’s a good start. Linda talked about this state of “constant partial attention” that we’re all pretty much in all the time these days. Her meta point is to value technology based on how it improves the quality of your life – which of course most technology doesn’t do today. She also had a great quote: “Email is an attention chipper shredder. Think <a href=\"http:\/\/www.imdb.com\/title\/tt0116282\/\">Fargo<\/a>”. Heh.<\/p>\n<p><strong><u>Mark Pilgrim on GreaseMonkey<br \/><\/u><\/strong>Maybe I’ve been living under a rock, but I’ve never used <a href=\"http:\/\/greasemonkey.mozdev.org\">GreaseMonkey<\/a> so I wanted to see what it was all about. Mark’s a great presenter, so it was a fun session though it wasn’t as much about GreaseMonkey as you might expect. Mark spent a significant amount of time on how to become an expert and when to write (while you’re still filled with wonder and before you become an expert). Great advice, but at best tangentially related to the topic at hand. He also spent a bunch of time on how they dealt with some security issues he discovered. That did lead to some discussion about how GreaseMonkey works with respect to sandboxing and the like. I guess I’ll just need to download it and play with it.<\/p>\n","excerpt":"<p>Jeff Han on Multi-Touch Interfaces This was a cool demo, but was basically a live version of the associated video that made the rounds on the web a few weeks ago. There’s huge potential here, but he kept doing the same zoom in and out demo over an over. Can’t wait to see practical availability [&hellip;]<\/p>\n","date":"2006-03-08 00:08:14","modified":"2006-03-08 00:08:14","categories":[],"tags":[{"id":297,"slug":"etech","title":"ETech","description":"","post_count":15},{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["be7f5439-3202-42f0-95ee-83765d72fcf2"],"dasblog_compressedtitle":["Assorted+Remaining+ETech+Day+Two+Keynotes+Sessions"],"dasblog_compressedtitleunique":["2006\/03\/08\/Assorted+Remaining+ETech+Day+Two+Keynotes+Sessions"]}},"previous_url":"http:\/\/devhawk.net\/2006\/03\/08\/the-so-called-attention-economy\/","next_url":"http:\/\/devhawk.net\/2006\/03\/08\/rod-smith-on-do-it-yourself-it\/"}