[
  {
    "id": 2925,
    "author-name": "Rory",
    "author-email": "",
    "author-url": "http://www.neopoleon.com",
    "date": "2003-12-09T23:40:49-08:00",
    "content": "It would have been cool for you to come down, but this...\n\n\"the truth is that I've got an early morning all-hands division meeting to see Return of the King and I'd like to get more than three hours of sleep.\"\n\n...is a *very* honorable excuse :)",
    "parent-id": 244,
    "RowKey": "20031209-234049"
  },
  {
    "id": 2926,
    "author-name": "DonXML Demsak",
    "author-email": "don@donxml.com",
    "author-url": "http://www.donxml.com",
    "date": "2003-12-10T17:12:57-08:00",
    "content": "Harry,\n\nActually, you did meet Rory at the PDC, but it was a quick intro, and most of the PDC is a blur for us anyway.  I introduced you to him, but you were eating an ice cream bar.  You wicked your fingers, wiped them off, and then went to shake Rory's hand.  Stuart, Bliz and me almost lost it, knowing how Rory is with shaking hands in the first place, no less hands that were just covered in ice cream, and then cleaned by the mouth.  It was priceless, and we all wished we had a video of it.  The both of you then agreed to a virtual handshake from about 3 feet away.\n\nDon",
    "parent-id": 244,
    "RowKey": "20031210-171257"
  },
  {
    "id": 2927,
    "author-name": "Rory",
    "author-email": "",
    "author-url": "http://www.neopoleon.com",
    "date": "2003-12-10T22:02:56-08:00",
    "content": "Thanks, Don :)\n\nI was hoping he'd forgotten about that...\n\nYup - The truth comes out! I'm the crazy guy who's scared of shaking hands!",
    "parent-id": 244,
    "RowKey": "20031210-220256"
  },
  {
    "id": 2928,
    "author-name": "Stuart",
    "author-email": "",
    "author-url": "http://www.bistrotech.net",
    "date": "2003-12-12T12:43:03-08:00",
    "content": "Oh crap!  I had all but forgotten about that!  Yep, \"priceless.\"  That's the perfect description of that moment.  :)",
    "parent-id": 244,
    "RowKey": "20031212-124303"
  },
  {
    "id": 2929,
    "author-name": "Harry",
    "author-email": "",
    "author-url": "http://devhawk.net",
    "date": "2003-12-16T18:11:38-08:00",
    "content": "Yeah, I remember that. It's a regular problem for me. Today I spilled BBQ sauce from my lunch all down the front of my shirt. Very messy. I imagine Rory wouldn't come within 10 feet of me now.",
    "parent-id": 244,
    "RowKey": "20031216-181138"
  }
]