[
  {
    "id": 2721,
    "author-name": "Baldrick Jameson",
    "author-email": "bj@hotmail.com",
    "author-url": "",
    "date": "2004-11-17T15:06:22-08:00",
    "content": "Candidates don't come to us \"second and third hand\" anymore because of TV, so Mencken's analysis doesn't apply. So how did we get this \"downright moron\"? The same old culprit; the elephant in the room; ... religion.",
    "parent-id": 483,
    "RowKey": "20041117-150622"
  },
  {
    "id": 2722,
    "author-name": "Greg Baker",
    "author-email": "g.a.baker@gmail.com",
    "author-url": "",
    "date": "2004-11-18T07:11:15-08:00",
    "content": "Just wondering what the solution to all this is? Is socialism really a better alternative? Because these religious nuts are messing things up, should we, as Garrison Kellior suggested, prevent christians from voting since \"Heaven\" is their real home? How do we deprogram religious peoople? Then again, how do we explain the tens of millions of people killed under the banner of atheism in WWII? Was religion the elephant in the room there? I'm sooo confused by all this...",
    "parent-id": 483,
    "RowKey": "20041118-071115"
  },
  {
    "id": 2723,
    "author-name": "Steve Hiner",
    "author-email": "spamhole@gmail.com",
    "author-url": "",
    "date": "2004-11-18T09:15:24-08:00",
    "content": "This \"downright moron\" as you call him scored higher on his SATs and IQ tests that the guy that lost.  How do you explain that?  Were this premise true the country would have elected the lesser intellect but we didn't.  A persons ability to speak elequently is not always an indicator of their intelligence.\n\nBesides that, being smart isn't the only requirement for being a good President.  It might not even be the primary requirement.  Jimmy Carter was arguably the smartest President we've ever had but it would be very hard to argue that he was the best one.\n\nReligion is not the elephant in the room.  People aren't supposed to talk about the proverbial \"elephant in the room\" but they certainly talked a lot about religion at the end of the Presidential race.  Even Kerry started pretending that it was important to him.  Despite what you might think, a very large percentage of this country still considers themselves religious and will likely keep voting Presidents that respect religious people.  The Dems as a party seem to think religion is for weak minded people then they wonder why these people they pity don't vote for them.  Hmmmmmm.",
    "parent-id": 483,
    "RowKey": "20041118-091524"
  },
  {
    "id": 2724,
    "author-name": "DevHawk",
    "author-email": "harry@devhawk.net",
    "author-url": "",
    "date": "2004-11-18T10:35:32-08:00",
    "content": "I disagree with your point Baldrick about the TV eliminating the second or third had problem - I think it makes it much much worse. We elect a president based much more on what the candidates surrogates say - esp. in the case of the Repulicans since so much of the mass media today is conservative. Other than the debates, all we hear from the candidates directly are stump speechs and sound bites. \n\nAs for solutions, I don't know. I certainly don't think socialism or denying anyone the right to vote is the right choice. Remember, I'm for election reform - I want EVERYONE to vote, even if they vote against the candidate I support.",
    "parent-id": 483,
    "RowKey": "20041118-103532"
  }
]