{"status":"ok","post":{"id":631,"type":"post","slug":"max-enhancements-needed","url":"http:\/\/devhawk.net\/2005\/09\/18\/max-enhancements-needed\/","status":"publish","title":"Max Enhancements Needed","title_plain":"Max Enhancements Needed","content":"<p>So I had a little time to play on a recently reimaged partition so I decided to install <a href=\"http:\/\/www.microsoft.com\/max\">Max<\/a> to play with. Very cool stuff. Sort of PhotoStory-esque. For someone with little kids and tons of pictures, it&#8217;s a great tool. However, I see two immediate issues that need to be rectified.<\/p>\n<ul>\n<li>No Save or Export Capability. I&#8217;ve got Max running on a clean image, but I know I&#8217;ll want to reimage it again soon when there&#8217;s a later drop of WinFX or VS or LINQ that I want to play with. However, Max doesn&#8217;t have any way to save a picture list to the hard drive. Everything (and I mean everything) is stored in an XML file in the C:Documents and Settings&lt;userName&gt;Local SettingsApplication DataMicrosoftMicrosoft Codename Max directory. Spelunking the code with Reflector, I see a locally defined namespace called System.Storage. I&#8217;m guessing this is a stub WinFS library with the intention of migrating to the real deal at some point in the future. But since it&#8217;s just a stub, there&#8217;s no simple way to get stuff in and out of that file. I tried cutting and pasting of the XML, but Max told me the store was corrupted and I had to rebuild my photo list. Please add some way to save photo lists outside of Max!\n<\/li>\n<li>No Downlevel experience. I showed my wife the photo list I built and her first response was &#8220;can you send me that?&#8221; Sadly, no I can&#8217;t. I realize that Max is supposed to be an example of the new-fangled WinFX stuff, but my wife, her best friend, my mother, my mother-in-law, etc. are NOT going to install the Sept. CTP of WinFX in order to run Max. Most of the cool Avalon stuff is in the authoring experience. Couldn&#8217;t you export a photo list to DHTML or something?<\/li>\n<\/ul>\n","excerpt":"<p>So I had a little time to play on a recently reimaged partition so I decided to install Max to play with. Very cool stuff. Sort of PhotoStory-esque. For someone with little kids and tons of pictures, it&#8217;s a great tool. However, I see two immediate issues that need to be rectified. No Save or [&hellip;]<\/p>\n","date":"2005-09-18 14:00:21","modified":"2005-09-18 14:00:21","categories":[],"tags":[{"id":213,"slug":"community","title":"Community","description":"","post_count":81}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2846,"name":"Shmuel","url":"http:\/\/spaces.msn.com\/members\/shmuel","date":"2005-09-27 11:08:55","content":"<p>Microsoft® Codename Max is not like any other product. That&#8217;s because it&#8217;s not a product—it&#8217;s your opportunity to try an exciting new user experience from Microsoft. So basicly it is not suppsoed to be a product. it is a concept to show how easy it is to make avalon applications. you were at the PDC you should know that.<br \/>\nProject M is supposed to be the product. and god only knows what that is.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["a769d738-fd8c-4e30-8f68-f20a47f71120"],"dasblog_compressedtitle":["Max+Enhancements+Needed"],"dasblog_compressedtitleunique":["2005\/09\/18\/Max+Enhancements+Needed"]}},"previous_url":"http:\/\/devhawk.net\/2005\/09\/14\/pdc-quick-hits\/","next_url":"http:\/\/devhawk.net\/2005\/09\/19\/new-dev-partition-contents\/"}