{"status":"ok","post":{"id":5,"type":"post","slug":"disruptive-programming-language-technologies","url":"http:\/\/devhawk.net\/2003\/01\/17\/disruptive-programming-language-technologies\/","status":"publish","title":"Disruptive Programming Language Technologies","title_plain":"Disruptive Programming Language Technologies","content":"<p>At one of my first programming jobs out of college, I was working at company that shall remain nameless. I was part of a small 4 person dev staff building a client\/server app that ran with a variety of back end databases &#8211; abstraction of said databases provided primarily by ODBC. However, ODBC was a <a href=\"http:\/\/www.joelonsoftware.com\/articles\/LeakyAbstractions.html\">leaky abstraction<\/a>, and different DB vendors had varying levels of support. In particular, at the time Informix supported multiple left outer joins in one query and Oracle did not. I know this because one of my coworkers (who was later fired for drug use and attempted workers comp fraud) wrote some of the worst code I had ever seen. He duplicated large portions of the code &#8211; once using multiple left outer joins and once using multiple queries . If the multiple join query failed, he used the multiple query version. Besides the obvious questions of code modularity, readability, reusability, etc. one massive question stuck out to me like a sore thumb: &#8220;Since it always works, why not just use the multi-query version all the time?&#8221;. The answer: &#8220;Performance&#8221;. He wanted to squeeze every ounce of performance out of the app, so he wanted to avoid multiple database roundtrips. The fact that he made the code essentially unworkable in the process was of little concern. This was the biggest example of the &#8220;only performance matters&#8221; mentality, but his code was littered with such &#8220;optimizations&#8221;. I inherited the code when he got the boot, and we eventually scrapped the app completely because it was so bad.<\/p>\n<p>At the time, I thought that optimizing for performance above all else was a bad policy. Things like development time and cost count too. (Now, I assert they count more.) But I never really had a name for it until someone pointed out &#8220;Proebstring&#8217;s Law&#8221; to me: <\/p>\n<blockquote><p>&#8220;Moore&#8217;s Law&#8221; asserts that advances in hardware double computing power every 18 months. I (immodestly) assert &#8220;Proebsting&#8217;s Law&#8221;, which says that advances in compiler optimizations double computing power every 18 <em>years<\/em>. [<a href=\"http:\/\/research.microsoft.com\/~toddpro\/\">Todd Proebsting&#8217;s Home Page<\/a>]<\/p>\n<\/blockquote>\n<p align=\"left\">Todd is a Senior Researcher at <a href=\"http:\/\/research.microsoft.com\">Microsoft Research<\/a>. His law basically means that in the face of Moore&#8217;s Law, optimizing compilers (and by extension, applications) is mostly irrelevant and that compiler (and application) developer&#8217;s time would be better spent focused on other types of optimizations &#8211; primarily developer productivity. In a talk that he calls Disruptive Programming Language Technologies, (<a href=\"http:\/\/research.microsoft.com\/~toddpro\/papers\/disruptive.ppt\">ppt<\/a> and <a href=\"http:\/\/stanford-online.stanford.edu\/courses\/ee380\/020424-ee380-100.asx\"> video<\/a>) he points out that recently adopted languages &#8211; such as Visual Basic, Java and Perl &#8211; were all very slow compared to the dominant language at the time: C\/C++. They were also devoid of &#8220;academic&#8221; innovation. Yet each of these languages provided solutions to real world problems that C\/C++ couldn&#8217;t match. And today, they are in wide adoption with VB easily outpacing C++ in terms of number of developers. Todd goes on to list a series of disruptive technologies that he predicts will be incorporated into future languages. These include: Application Crash Analysis, Checkpoints\/Undo, Database Access, Parsing, XML Manipulation, Constraint Solving and Distributed Programming. <\/p>\n<p align=\"left\">There are a few conclusions I draw from this:<\/p>\n<ul>\n<li>\n<p align=\"left\"> If there is going to be future language innovation that will make my life easier as a develop, I&#8217;m going to want to use a platform that is designed to support multiple languages. Obviously, I&#8217;m thinking CLR here &#8211; JVM&#8217;s &#8220;me too&#8221; approach to multiple language support just doesn&#8217;t cut it. <\/p>\n<\/li>\n<li>\n<p align=\"left\">These language innovations will probably <i>not<\/i> include &#8220;typical&#8221; programming language elements such as if\/then and for\/next loops. We have great languages such as C#, Visual Basic and Java that already include all that stuff. With CLR&#8217;s true language interoperability, there&#8217;s no point in duplicating those elements in each new language. I can build a disruptive technology into a language that exposes classes to the CLR. Then I can use C#, VB or even J# to provide the glue logic. This makes the language design and compiler building much easier, meaning the &#8220;barrier to entry&#8221; for innovative language design has dropped significantly. <\/p>\n<\/li>\n<li>\n<p align=\"left\">Code generation will be replaced with disruptive programming languages. There used to be code generation wizards in VC++ for building event handlers. In VB, you didn&#8217;t need them. Technologies where code generation is used extensively (such as database access) are ripe for a disruptive programming language.<\/p>\n<\/li>\n<li>\n<p align=\"left\">I want to learn more about language design and compiler development. <a href=\"http:\/\/www.microsoft.com\/mspress\/books\/5771.asp\">These<\/a><a href=\"http:\/\/search.barnesandnoble.com\/textbooks\/booksearch\/isbnInquiry.asp?isbn=0130622966\"> books<\/a> are a good start, plus there&#8217;s the <a href=\"http:\/\/www.ssw.uni-linz.ac.at\/Research\/Projects\/Coco\/CSharp\/\">Coco\/R toolkit<\/a> for building parsers in C#.<\/p>\n<\/li>\n<li>\n<p align=\"left\">Performance is almost irrelevant. I mean, you can&#8217;t ignore it completely. However, in the face of other factors &#8211; such as time and money &#8211; performance is low on the priority list. I&#8217;d rather optimize for developer productivity than performance. After all, I can get more hardware cheaper and easier than I can get more developers. <\/p>\n<\/li>\n<\/ul>\n","excerpt":"<p>At one of my first programming jobs out of college, I was working at company that shall remain nameless. I was part of a small 4 person dev staff building a client\/server app that ran with a variety of back end databases &#8211; abstraction of said databases provided primarily by ODBC. However, ODBC was a [&hellip;]<\/p>\n","date":"2003-01-17 10:44:13","modified":"2003-01-17 10:44:13","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["896fcfbd-dede-4c62-8f59-24aece862218"],"dasblog_compressedtitle":["Disruptive+Programming+Language+Technologies"],"dasblog_compressedtitleunique":["2003\/01\/17\/Disruptive+Programming+Language+Technologies"]}},"previous_url":"http:\/\/devhawk.net\/2003\/01\/16\/using-ashx-files\/","next_url":"http:\/\/devhawk.net\/2003\/01\/20\/wsdl-soapaction-issues\/"}