{"status":"ok","post":{"id":527,"type":"post","slug":"outlook-connector","url":"http:\/\/devhawk.net\/2005\/01\/31\/outlook-connector\/","status":"publish","title":"Outlook Connector","title_plain":"Outlook Connector","content":"<p>I recently had to repave my main machine. Among other things I installed <a href=\"http:\/\/join.msn.com\/?pgmarket=en-us&amp;page=byoa\/prem\">MSN Premium<\/a> which I use to manage my <a href=\"mailto:harrypierson@hotmail.com\">hotmail<\/a> and <a href=\"mailto:harry@devhawk.net\">DevHawk<\/a> emails. However, this time I installed the <a href=\"http:\/\/join.msn.com\/?pgmarket=en-us&amp;page=features\/connector\">Outlook Connector for MSN<\/a>, which enables you to use Outlook 2002 or later to manage your hotmail account. Calendar, contacts, tasks, notes, everything. Very very cool. Now, there&#8217;s no need to install the MSN Premium client at all&#8230;or is there? <\/p>\n<p>The coolest feature of the Outlook Connector is that it delivers all of my personal hotmail to a totally different top level folder inside Outlook. Does anyone know how to do that for POP3 mailboxes? I tried using Outlook to manage my DevHawk email, but then all that mail gets mingled together with my work email. I want the exact same experience for my DevHawk email inside Outlook as I get for my hotmail. However, it appears that while you can have multiple PSTs, you have to designate one as the new mail delivery location default for <em>all<\/em> accounts. I.e. it doesn&#8217;t appear that you can configure this on a per-account basis. I&#8217;m guessing the Outlook Connector is overriding this for my hotmail.<\/p>\n<p>Anyone have any ideas on how to deliver email from two different accounts to two different locations? (Other than the obvious “use rules” &#8211; I had issues with that approach.)<\/p>\n","excerpt":"<p>I recently had to repave my main machine. Among other things I installed MSN Premium which I use to manage my hotmail and DevHawk emails. However, this time I installed the Outlook Connector for MSN, which enables you to use Outlook 2002 or later to manage your hotmail account. Calendar, contacts, tasks, notes, everything. Very [&hellip;]<\/p>\n","date":"2005-01-31 22:47:13","modified":"2005-01-31 22:47:13","categories":[{"id":223,"slug":"general-geekery","title":"General Geekery","description":"","parent":0,"post_count":35}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2768,"name":"mearls@hotmail.com (Michael Earls)","url":"http:\/\/www.cerkit.com\/","date":"2005-02-01 07:50:23","content":"<p>I use client-side rules to move items from a particular account to another PST.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["54dfda84-aada-4b5a-aecb-996de6123661"],"dasblog_compressedtitle":["Outlook+Connector"],"dasblog_compressedtitleunique":["2005\/02\/01\/Outlook+Connector"]}},"previous_url":"http:\/\/devhawk.net\/2005\/01\/29\/atlas-brand-view-wabi-sabi-and-devhawk\/","next_url":"http:\/\/devhawk.net\/2005\/02\/01\/patternshare\/"}