{"status":"ok","post":{"id":412,"type":"post","slug":"slight-nomad-issue-solved","url":"http:\/\/devhawk.net\/2004\/08\/03\/slight-nomad-issue-solved\/","status":"publish","title":"Slight Nomad Issue Solved","title_plain":"Slight Nomad Issue Solved","content":"<p>I&#8217;ve had my Nomad Zen for <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=cf03b637-f3fb-41eb-8e6f-bd4feb78295d\">just over a month<\/a> now. I&#8217;ve loaded almost 6500 tracks from 525 albums and it&#8217;s only about half full. However, I did have a slight issue with it. Walking across campus the other day, I tripped over my own damn feet. Luckily, the Nomad broke my fall :(. I ripped the protective case and scuffed the LCD screen, but otherwise it didn&#8217;t seem any the worse for wear. However, when I fired it up on the flight to Sydney it wouldn&#8217;t work. It would boot and claim to be playing, but no music came out. If I selected a new song, it would freeze and needed a hard reboot or battery removal in order to shut down. I tried the reset button and reloading the firmware, no luck. Today, I searched Creative Labs&#8217; <a href=\"http:\/\/ask.americas.creative.com\/SRVS\/CGI-BIN\/WEBCGI.EXE?New,Kb=creative_cli_us,U={B8F60310-DA4F-11D3-94F4-00500463020E},Company={CB344281-E2C7-4902-86F5-B8611142F879},d=1062520186265,VARSET=ws:http:\/\/us.creative.com\/\">knowledge base<\/a>, searched for &#8220;zen xtra crash&#8221; and found an <a href=\"http:\/\/dmzweb4.europe.creative.com\/SRVS\/CGI-BIN\/WEBCGI.EXE\/,\/?St=799,E=0000000000020220752,K=2283,Sxi=0,Case=obj(10943),Kb=creative_cli_us\">article<\/a> on the Zen&#8217;s Rescue Mode. This allows you to Clean Up, Format All and Reload OS. Clean Up took a while &#8211; around 15 minutes &#8211; but it did the trick. I guess the rapid deceleration caused some temporary issue to the internal hard drive, but there don&#8217;t seem to be any residual effects. Even the song that I was listening to when I fell is fine.<\/p>\n<p align=\"left\">Of course, no device is perfect. In addition to &#8220;Make Rescue Mode Easily Discoverable&#8221;, I have two minor quibbles with the device. First, it doesn&#8217;t draw power from the USB connection. With Red Chair&#8217;s <a href=\"http:\/\/www.redchairsoftware.com\/notmad\/\">Notmad Explorer<\/a>, I can play the music from the Zen thru my computer&#8217;s speakers. I also use Notmad Explorer to convert my music from WMA lossless to WMA 96k when it transfers to the Zen. In both of these cases, the Zen is connected to the computer for a long period of time. It would be nice if I didn&#8217;t have to plug in both power and USB. Second (and more likely to be addressed as it&#8217;s a software issue) is that when you&#8217;re listening to a song, you can get it&#8217;s track details, displaying the artist and album names. It would be nice to be able to jump directly to the artist or album in the music library from the track details screen. <\/p>\n<p align=\"left\">Minor quibbles aside, this is an awesome device. <\/p>\n","excerpt":"<p>I&#8217;ve had my Nomad Zen for just over a month now. I&#8217;ve loaded almost 6500 tracks from 525 albums and it&#8217;s only about half full. However, I did have a slight issue with it. Walking across campus the other day, I tripped over my own damn feet. Luckily, the Nomad broke my fall :(. I [&hellip;]<\/p>\n","date":"2004-08-03 21:25:56","modified":"2004-08-03 21:25:56","categories":[],"tags":[{"id":248,"slug":"music","title":"Music","description":"","post_count":20}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2646,"name":"Marshall","url":"http:\/\/www.arcaner.com","date":"2004-08-13 20:59:57","content":"<p>I just got a 30gb zen about a month ago as well. I&#8217;ve been loving the hell out of it.. the only beef I had was the inability to use it as an external hard drive. Notmad is a must have for any zen user IMO, the web streamer and winamp media library plugin that come with it are worth the $25 alone.<\/p>\n<p>Have you ever tried hooking up your zen to your car stereo? I currently use a headphone->tape adapter that works ok, but the  stereo sound seems to come in kinda weak on the back channel. I&#8217;ve also tried streaming the mp3 player over a local FM transmiiter (ala iRock!) and experienced extremely muffled audio. I&#8217;m thinking about replacing my in-dash unit with a receiver that takes a line input for better quality. Any suggestions?<\/p>\n","parent":0},{"id":2647,"name":"DevHawk","url":"","date":"2004-08-13 21:15:06","content":"<p>I haven&#8217;t hooked up the Zen to the car stereo yet. I don&#8217;t have a tape deck and the FM transmitter stinks. My stereo has a line in, but it uses a custom cable and I haven&#8217;t tracked one down yet.<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["1f8696c5-fcc7-44a1-9425-72d2cfd842df"],"dasblog_compressedtitle":["Slight+Nomad+Issue+Solved"],"dasblog_compressedtitleunique":["2004\/08\/04\/Slight+Nomad+Issue+Solved"]}},"previous_url":"http:\/\/devhawk.net\/2004\/08\/03\/nz-is-done-off-to-australia\/","next_url":"http:\/\/devhawk.net\/2004\/08\/04\/done-in-australia\/"}