{"status":"ok","post":{"id":1142,"type":"post","slug":"ironpython-2-0-beta-2","url":"http:\/\/devhawk.net\/2008\/05\/02\/ironpython-2-0-beta-2\/","status":"publish","title":"IronPython 2.0 Beta 2","title_plain":"IronPython 2.0 Beta 2","content":"<p>We pushed out the <a href=\"https:\/\/www.codeplex.com\/Release\/ProjectReleases.aspx?ProjectName=IronPython&amp;ReleaseId=11566\">latest beta<\/a> of IronPython 2.0 this morning. From the <a href=\"http:\/\/www.codeplex.com\/IronPython\/Wiki\/View.aspx?title=v2.0%20Beta%202%20Release%20Notes&amp;referringTitle=Home\">release notes<\/a>:<\/p>\n<blockquote><p>We’re pleased to announce the release of IronPython 2.0 Beta 2. In addition to the usual bug fixes (~25 reported on CodePlex and ~50 reported internally), this release has been partially focused on improving the performance of IronPython, in particular startup perf. Another focus of this release was improving upon our traceback support which had regressed quite a bit in 2.0B1 and had largely been broken in the 2.0 Alphas. Our traceback support should now be superior to that of IronPython 1.1!<\/p>\n<p>We’ve also made a minor change to our packaging by adding a Microsoft.Scripting.Core.dll in addition to the Microsoft.Scripting.dll that’s been around since the start of 2.0. We are doing this purely as an architectural layering cleanup. Microsoft.Scripting.Core contains DLR features that are essential to building dynamic languages. Microsoft.Scripting will contain language implementation helpers that can either be re-used (e.g., BigInts) or copied (possibly e.g., the default binder). This process is all about our work to get the DLR architecture right and shouldn’t have any noticeable IronPython impact except that there’s now one more DLL to include in any package.<\/p>\n<p>As a consequence of the new DLL, the deprecated file IronPython2005.sln is broken. This is the last release that will include this .sln file in the source zip file. Of course the Visual Studio 2008 version of this file, IronPython.sln, still builds.<\/p>\n<p>We’d like to thank everyone in the community who reported these: kevgu, oldman, christmas, brucec, scottw, fuzzyman, haibo, Seo Sanghyeon, grizlupo, J. Merrill, perhaps, antont, 05031972, Jason Ferrara, Matt Beckius, and Davy Mitchell.<\/p>\n<\/blockquote>\n<p>The full release notes have details about the bugs we fixed. Congrats to the team and thanks again to the community members for their assistance. <\/p>\n","excerpt":"<p>We pushed out the latest beta of IronPython 2.0 this morning. From the release notes: We’re pleased to announce the release of IronPython 2.0 Beta 2. In addition to the usual bug fixes (~25 reported on CodePlex and ~50 reported internally), this release has been partially focused on improving the performance of IronPython, in particular [&hellip;]<\/p>\n","date":"2008-05-02 11:45:54","modified":"2008-05-02 11:45:54","categories":[{"id":252,"slug":"ironpython","title":"IronPython","description":"","parent":0,"post_count":99}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["826dfa82-652e-43b0-bb59-48cf46a4e15e"],"dasblog_compressedtitle":["IronPython+20+Beta+2"],"dasblog_compressedtitleunique":["2008\/05\/02\/IronPython+20+Beta+2"]}},"previous_url":"http:\/\/devhawk.net\/2008\/04\/28\/importing-static-methods-with-ipy\/","next_url":"http:\/\/devhawk.net\/2008\/05\/05\/rare-insight-into-the-ipy-team\/"}