[
  {
    "author-name": "Sam Gentile",
    "author-email": "sgentile@gmail.com",
    "author-url": "http://codebetter.com/blogs/sam.gentile/",
    "date": "2007-03-22T14:05:35-07:00",
    "content": "No New and Notable 150 Link??? -)"
  },
  {
    "author-name": "Mike Clark",
    "author-email": "mike@clarkmichael.com",
    "author-url": "http://blog.clarkmichael.com",
    "date": "2007-03-22T20:47:04-07:00",
    "content": "W would have been better cast in the role?  Republican politicians are no worse at the kind of dissent-stifling than Democratic politicians.  One good example is the \"Fairness Doctrine.\"  The R's aren't particularly interested in the concept (because it's the *conservative* talk shows that are the target of such legislation, natch), but the D's would dearly love to stifle that kind of dissent, and so the FD is a perennial topic among them.  Just like those fine folks who appear to want to make dissent on Global Warming into some kind of crime.\n\nHarry, they are mostly all of them demogogues and afraid to death of dissent.  Some of them are just better at hiding it.\n\nOh, and by the way, the guy who got fired for this was fired by his employer, who is definitely D.  Of course, considering that they have an economic stake in the D's, it is completely understandable.  An R-related firm would have done the same."
  },
  {
    "author-name": "DevHawk",
    "author-email": "harry@devhawk.net",
    "author-url": "",
    "date": "2007-03-23T08:15:23-07:00",
    "content": "Mike, everyone's entitled to their own opinions. Nice to know people can enjoy my blog while disagreeing with my political opinions.\n\nHowever, I wanted to correct one thing in your comment: Phil de Villis - the guy that made the video - wasn't fired by his employer, he resigned by choice. From the blog post I linked to above (that he wrote): \"The company had no idea that I'd created the ad, and neither did any of our clients. But I've decided to resign anyway so as not to harm them, even by implication.\""
  }
]