{"status":"ok","post":{"id":1260,"type":"post","slug":"microsoft-and-open-source","url":"http:\/\/devhawk.net\/2009\/05\/18\/microsoft-and-open-source\/","status":"publish","title":"Microsoft and Open Source","title_plain":"Microsoft and Open Source","content":"<div><a href=\"http:\/\/s3.amazonaws.com\/devhawk_images\/WindowsLiveWriter\/af4c4ff204c4_C655\/clip_image001_2.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group1260\"><img style=\"display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;\" title=\"clip_image001\" src=\"http:\/\/s3.amazonaws.com\/devhawk_images\/WindowsLiveWriter\/af4c4ff204c4_C655\/clip_image001_thumb.jpg\" border=\"0\" alt=\"clip_image001\" width=\"240\" height=\"144\" align=\"right\" \/><\/a>In a couple of weeks, I‘m participating in an internal “Presentation Idol”competition. It’s a contest of presentation skills against impressive competition (I can’t name names, but rest assured it’s a strong group) being judged by Microsoft executives (again, I can’t name names, but this time it’s because I don’t know who’s judging) in front of what I assume will be a large technical internal Microsoft audience. To top it off, we each only get three minutes and thirty three seconds each to deliver our presentations.<\/div>\n<div>So yeah, no pressure.<\/div>\n<div>The topic we’re all presenting is “What is the one thing we should do to improve Microsoft?” For those who know me, it should come as little surprise that I picked a variant of “more open source” for my presentation. More specifically, I’m planning to present the following:<\/div>\n<ol>\n<li>Any product Microsoft gives away for free should also be Open Source.<\/li>\n<li>Open Source Microsoft products should accept contributions from the community.<\/li>\n<\/ol>\n<div>I realize that many people consider this separation between “source availability” and “community contributions” completely artificial. Sure, the <a href=\"http:\/\/opensource.org\/docs\/osd\">accepted definition of Open Source<\/a> only addresses the availability and distribution of source code, but most Open Source advocates consider the ability to collaborate and contribute – what Wikipedia calls “<a href=\"http:\/\/en.wikipedia.org\/wiki\/Commons-based_peer_production\">Commons-based peer production<\/a>” &#8211; a critical aspect of Open Source. For example, with respect to the <a href=\"http:\/\/weblogs.asp.net\/scottgu\/archive\/2009\/04\/01\/asp-net-mvc-1-0.aspx\">announcement<\/a> that ASP.NET MVC would be released under the <a href=\"http:\/\/opensource.org\/licenses\/ms-pl.html\">Ms-PL<\/a>, Keith Elder <a href=\"http:\/\/twitter.com\/keithelder\/status\/1438253992\">tweeted<\/a>:<\/div>\n<blockquote>\n<div>“Giving someone your source code is NOT open source. So although Asp.Net MVC&#8217;s source code is out there for download, not open source.”<\/div>\n<\/blockquote>\n<div><a title=\"DevHawk on DFB\" href=\"http:\/\/deepfriedbytes.com\/podcast\/episode-32-being-dynamic-about-ironpython-with-harry-pierson-ndash-part-2\/\"><img style=\"display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;\" title=\"image\" src=\"http:\/\/deepfriedbytes.com\/files\/media\/image\/WindowsLiveWriter\/Media_8AE9\/image_thumb_4.png\" class=\"grouped_elements\" rel=\"tc-fancybox-group1260\" border=\"0\" alt=\"image\" width=\"240\" height=\"98\" align=\"right\" \/><\/a>In what now seems like a huge coincidence, Keith and his co-host <a href=\"http:\/\/twitter.com\/cwoodruff\">Chris “Woody” Woodruff<\/a> interviewed me later that day for their podcast <a href=\"http:\/\/deepfriedbytes.com\/\">Deep Fried Bytes<\/a>. As you might imagine, while we started with <a href=\"http:\/\/deepfriedbytes.com\/podcast\/episode-31-being-dynamic-about-ironpython-with-harry-pierson-ndash-part-1\/\">talking about IronPython<\/a>, we eventually started discussing <a href=\"http:\/\/deepfriedbytes.com\/podcast\/episode-32-being-dynamic-about-ironpython-with-harry-pierson-ndash-part-2\/\">open source at Microsoft<\/a> more generally. It was a great conversation, and we found lots of common ground.<\/div>\n<div>Personally, I think Microsoft is making small steps in the right direction when it comes to Open Source. Not only have some high profile Microsoft projects go Open Source like ASP.NET MVC and <a href=\"http:\/\/codebetter.com\/blogs\/glenn.block\/archive\/2008\/10\/02\/mef-going-ms-pl-the-little-engine-that-could.aspx\">MEF<\/a>, but we’ve even started taking baby steps for including external intellectual property. Releasing ASP.NET MVC under Ms-PL is a big deal, but I think <a href=\"http:\/\/weblogs.asp.net\/scottgu\/archive\/2008\/09\/28\/jquery-and-microsoft.aspx\">including jQuery “in the box”<\/a> is a much, <em>much<\/em> bigger deal. It remains to be seen if it’s a one-time-only deal or if it’s a new trend inside Microsoft.<\/div>\n<div>Obviously, I hope it’s a trend. Going from “include jQuery in ASP.NET” to “accept community contributions in ASP.NET” seems like a relatively achievable goal.<\/div>\n<div>Now, here’s where I need <span style=\"text-decoration: underline;\"><strong>your<\/strong><\/span> help.<\/div>\n<div>I can easily fill three and a half minutes talking about Open Source community collaboration. But since my presentation is about taking contributions from the community, I decided to put my money where my mouth is and crowdsource it:<\/div>\n<div><span style=\"font-size: medium;\"><strong>What is the elevator pitch *you* would make for including community contributions in Microsoft Open Source products?<\/strong><\/span><\/div>\n<div>Leave me a comment, send me an email, tweet it, whatever – I’ll be keeping an eye out for responses. Please remember that I only have three and a half minutes to present, so keep your ideas short and sweet.<\/div>\n","excerpt":"<p>In a couple of weeks, I‘m participating in an internal “Presentation Idol”competition. It’s a contest of presentation skills against impressive competition (I can’t name names, but rest assured it’s a strong group) being judged by Microsoft executives (again, I can’t name names, but this time it’s because I don’t know who’s judging) in front of [&hellip;]<\/p>\n","date":"2009-05-18 14:23:28","modified":"2011-04-17 20:48:07","categories":[{"id":223,"slug":"general-geekery","title":"General Geekery","description":"","parent":0,"post_count":35}],"tags":[{"id":232,"slug":"microsoft","title":"Microsoft","description":"","post_count":31},{"id":247,"slug":"open-source","title":"Open Source","description":"","post_count":8}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2208,"name":"Greg Leonardo","url":"http:\/\/www.devenvy.com\/","date":"2009-05-18 15:20:31","content":"<p>In the simplest of terms many of the good ideas are overlooked or understated simply because I company is too tied up in maintaining its propriety code and updating it for the community.  I have found the biggest enhancements come from the simplest ideas and from those that don&#8217;t look at the code or products everyday.  The biggest point behind open source is the ability to contribute and become a part of the process &#8211; empower the user empower the change.  Look though-out technologies history and you will see how empowering the user has create vast advancements in technology as a whole.  Most of Microsoft&#8217;s community have had a say in the &#8220;direction&#8221; of Microsoft products, now you will just give them the stirring wheel and allow them to fix their own car.<\/p>\n","parent":0},{"id":2209,"name":"Greg Leonardo","url":"http:\/\/www.devenvy.com\/","date":"2009-05-18 15:24:21","content":"<p>In the simplest of terms many of the good ideas are overlooked or understated simply because the company is too tied up in maintaining its propriety code and updating it for the community. I have found the biggest enhancements come from the simplest ideas and from those that don&#8217;t look at the code or products everyday. The biggest point behind open source is the ability to contribute and become a part of the process &#8211; empower the user empower the change. Look thoughout technologies history and you will see how empowering the user has created vast advancements in technology as a whole. Most of Microsoft&#8217;s community have had a say in the &#8220;direction&#8221; of Microsoft products, now you will just give them the stirring wheel and allow them to fix their own car.<\/p>\n<p>Sorry the post above had some mistakes that I corrected but did not get posted &#8211; sorry for the repost.<\/p>\n","parent":0},{"id":2210,"name":"Ruiyi Zhang","url":"","date":"2009-05-18 19:52:00","content":"<p>You may want to listen to the latest Herding Code episode interviewing DotNetNuke co-founder Joe Brinkman (<a href=\"http:\/\/herdingcode.com\/?p=183\" rel=\"nofollow\">http:\/\/herdingcode.com\/?p=183<\/a>). Even though the main topic is about webforms vs asp.net mvc. Towards the end of the show, he did address his experiences and thoughts on maintaining a large-scale open source project.<\/p>\n<p>To summarize his ideas around the issues of accepting community contributions in large scale open source projects backed by commercial companies:<\/p>\n<p>* Community contributions are generally welcomed, or even begged, when a project is small.<br \/>\n* When project grows bigger, the cost and risk of accepting community contributions become prohibitively high.<br \/>\n* A community contributor usually doesn&#8217;t have the big picture of the project in mind when he\/she contributes his\/her patches.<\/p>\n<p>This is really a poor summary (mainly due to my broken English) of the things discussed in the show. So be sure to listen to the original podcast.<\/p>\n<p>To make your presentation more interesting than political rallies, I believe it will do more impact if you could focus the presentation on proposing some constructive resolutions to the many known hurdles a commercial company backed open source project faces in accepting community contributions. After all, the Internet doesn&#8217;t lack blank arguments of urging Microsoft to be more open.<\/p>\n","parent":0},{"id":2211,"name":"stacy","url":"http:\/\/www.uncall.com","date":"2009-05-18 20:14:05","content":"<p>This is not a time to be elegant with words. Push it to them VERY hard. Either Microsft stops being an island, or lose developers to open source, probably forever. It&#8217;s just that simple. The steps they have taken to date may seem like a big deal to Microsoft, but it&#8217;s no more a bigger-deal than spitting in the ocean. The entire massive growth of the Internet is due to community involvement, not a single company. <\/p>\n<p>Microsoft has defined open source as its enemy. Everybody feels that. Balmer projects that often. So even though high-profile MVC is released, developers know deep down that there&#8217;s not one ounce of &#8220;corporate&#8221; passion behind those bits. Let them know that we know that. Let them know we are looking at open source stacks right now. <\/p>\n","parent":0},{"id":2212,"name":"Kevin Gregg","url":"http:\/\/infination.info\/contacts","date":"2009-05-19 02:53:32","content":"<p>After 30 years of profit, making (at one point) Bill Gates not only the richest man in America, but also personally owning 40% of the US GDP.  I&#8217;d say it&#8217;s time to give back in a big, big way.  Not to the stockholders.  It&#8217;s time to go back to grassroots, streamlined, security-minded coding&#8211;pure interoperability&#8211;where the focus is not on how much profit can be milked out of a proprietary sale of a technology solution, but rather everyone on the same page and working together to solve the issues that IT faces today.  No arguments; a good product will make the developer profit from his hard work.  It&#8217;s time to take the venom out of the proprietary code and ensure that all pieces of code written work seamlessly on all platforms.  The days of narrow-minded, one-dimensional operating system software should have already been behind us as an IT community. Let&#8217;s embrace the opportunities we have to collaborate and make software work for our nations, our states, and our cities.  The future has been now for over a decade and a half, and yet another development of a new OS is a tired idea.  Let&#8217;s improve the ones we have, all work to make our days go by better, and a sense of pride and honor and integrity will increase the morale of the IT community at-large.  <\/p>\n<p>KG<br \/>\nNetwork Security Research Analyst<br \/>\nInfination Technology Research<br \/>\n<a href=\"mailto:kevin@infination.com\">kevin@infination.com<\/a><br \/>\n662.497.2890<br \/>\n<a href=\"http:\/\/infination.info\/contacts\" rel=\"nofollow\">http:\/\/infination.info\/contacts<\/a><\/p>\n","parent":0},{"id":2213,"name":"Anthony Tarlano","url":"","date":"2009-05-19 08:49:57","content":"<p>I recommend reading Pip Coburn&#8217;s book &#8220;The Change Function&#8221; <\/p>\n<p>But the elevator pitch is simple.. present the change function; i.e.<\/p>\n<p>f(perceived crises vs. total perceived pain of adoption)<\/p>\n<p>You should clearly state that by reducing the TPPA (which includes more than cost, such as system requirements, fear of control, etc) by releasing under Ms-PL you are more likely to have more user-oriented adoption. <\/p>\n<p>And if you can only get one more thing out the door, please put on you slides to release Powershell as Ms-PL for Mono!<\/p>\n<p>Thanks,<\/p>\n<p>Anthony<\/p>\n","parent":0}],"attachments":[],"comment_count":6,"comment_status":"closed","custom_fields":{"dasblog_entryid":["45a06ea2-5414-452e-9e0b-c18ec6519b60"],"dasblog_compressedtitle":["Microsoft+And+Open+Source"],"dasblog_compressedtitleunique":["2009\/05\/18\/Microsoft+And+Open+Source"]}},"previous_url":"http:\/\/devhawk.net\/2009\/05\/07\/checkin-comments-for-ironpython-source\/","next_url":"http:\/\/devhawk.net\/2009\/05\/20\/ironpython-2-6-ctp-for-net-4-0-beta-1\/"}