{"status":"ok","post":{"id":1216,"type":"post","slug":"caps-4-canadians-3-so","url":"http:\/\/devhawk.net\/2009\/02\/18\/caps-4-canadians-3-so\/","status":"publish","title":"Caps 4, Canadians 3 (SO)","title_plain":"Caps 4, Canadians 3 (SO)","content":"<p>I don’t get the chance to see many Caps games, being as I live over 2000 miles away from Washington D.C. I got to see them tonight live and in person for the first time in like four years, and it was awesome. Awesome to be there that is, even if the Caps were less than awesome in the third period. Frankly, I think the Caps were lucky to get one, much less two points in this game. <\/p>\n<p>But before I talk about bad, let’s start with the amazing. Ovechkin’s goal was the most amazing a goal I’ve ever seen live. He leaves Hamrlik in the dust by banking the puck off the boards to himself while he does a 180 to reverse direction. Then he gets knocked down by Chipchura but still manages to slide the puck into the net under Price while lying on his side on the ice before Chipchura’s momentum knocks the net off it’s moorings. You’ve got to see it to believe it.<\/p>\n<p><iframe height=\"289\" src=\"http:\/\/www.nhl.tv\/team\/embed.jsp?hlg=20082009,2,856&amp;event=WSH47\" frameborder=\"0\" width=\"480\" align=\"center\"><\/iframe><\/p>\n<p><a href=\"http:\/\/twitpic.com\/1k73u\"><img style=\"border-right-width: 0px; margin: 0px 0px 0px 5px; display: inline; border-top-width: 0px; border-bottom-width: 0px; border-left-width: 0px\" title=\"Crosby Sucks Caps Jersey\" border=\"0\" alt=\"Crosby Sucks Caps Jersey\" align=\"right\" src=\"http:\/\/s3.amazonaws.com\/devhawk_images\/WindowsLiveWriter\/Caps4Canadians3SO_655\/1k73u-34dd2010d2b88ae59d73e34440148648.499ce477[1]_3.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group1216\" width=\"244\" height=\"184\" \/><\/a>Honestly, I think this is even better than “<a href=\"http:\/\/www.youtube.com\/watch?v=TqCgwpkOpUo\">The Goal<\/a>” from Ovechkin’s rookie season. The goal itself maybe wasn’t quite as amazing, but the bank pass to himself while reversing direction that set up the goal was literally jaw-dropping. That with the knocked down goal in succession was truly a work of art. They showed it about a dozen times on the jumbo-tron, several times on the NHL network highlight show and I’ve watched the embedded video maybe a dozen times while writing this post. Anyone who thinks Ovechkin isn’t the best player in the league is frakking crazy. <\/p>\n<p>Backstom’s <a href=\"http:\/\/www.nhl.tv\/team\/console.jsp?hlg=20082009,2,856&amp;event=WSH212\">give and go with Federov<\/a> for the second goal wasn’t bad either. <\/p>\n<p>But here’s the stat of the game that should give Caps fans nightmares: All three of Montreal’s goals came on the powerplay. Caps did fairly well in the penalty taking department – only taking four penalties on the night. But going 25% on the penalty kill? There’s no way to spin how ugly that is. To add insult to injury, two of the three goals came less than ten seconds into the penalty – Montreal scored before the Caps could even get their kill set up. Ugh. The first was had two Caps getting tied up in the faceoff circle, leaving Higgins open to score. The second I think went off Erskine’s stick and over Theodore. And the third looked like one Theodore should have had. <\/p>\n<p>The third period, the Caps looked totally flat until Steckel’s nice tip in to tie the game. They didn’t seem to be winning any one-on-one battles for the puck. I know the Caps have talent to spare, but they need to win on the boards if they’re going to win on the scoreboard. They picked it up for the last three minutes of the third and Overtime (except for very scary giveaway by I think Nylander near the end of OT that the Habs couldn’t capitalize on). <\/p>\n<p>Giveaways were a problem – Caps had 12 to Montreal’s 6 – and Backstrom got slapped around in the faceoff circle, winning only 6 of 18. Nylander had a bad night on the dot, going 2 of 8. On the plus side, Caps had 17 takeaways to Montreal’s 7 and Gordon, Steckel and Laich and Federov all were over 50% on the faceoffs (team as a whole won 27 of 58, or 47%.)<\/p>\n<p>As I said, I don’t get to see the Caps often, but I hear they aren’t that good in the shootout, which is kinda surprising given the surplus of offensive talent on the team. They were 2-3 in the shootout going into tonight, while the Habs were 7-4. But the Caps were perfect, Semin and Backstrom scoring while Theodore stoned Plekanec and Markov.<\/p>\n<p>In the end, it’s two points which puts us a full game up on the Devils for 2nd in the East and seven games up on Florida who’s technically chasing us for the SouthEast division crown. Not quite in the bag, but making up that much ground in the 24 games remaining is pretty daunting. The Caps trail Boston by four and a half games for the top seed in the east, which is also a daunting task given the amount of season remaining. I’d love to be in first, but I’m pretty happy with where the Caps are right now – except maybe for the PK.<\/p>\n","excerpt":"<p>I don’t get the chance to see many Caps games, being as I live over 2000 miles away from Washington D.C. I got to see them tonight live and in person for the first time in like four years, and it was awesome. Awesome to be there that is, even if the Caps were less [&hellip;]<\/p>\n","date":"2009-02-18 21:27:02","modified":"2011-04-16 22:09:49","categories":[{"id":234,"slug":"sports","title":"Sports","description":"","parent":0,"post_count":50}],"tags":[{"id":215,"slug":"hockey","title":"Hockey","description":"","post_count":34},{"id":192,"slug":"washington-capitals","title":"Washington Capitals","description":"","post_count":43}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["aa56aae7-3ca1-4e9d-81d6-4cadf12eb1e2"],"dasblog_compressedtitle":["Caps+4+Canadians+3+SO"],"dasblog_compressedtitleunique":["2009\/02\/19\/Caps+4+Canadians+3+SO"]}},"previous_url":"http:\/\/devhawk.net\/2009\/02\/15\/ironpython-2-0-1\/","next_url":"http:\/\/devhawk.net\/2009\/02\/21\/avalanche-4-caps-1\/"}