{"status":"ok","post":{"id":1263,"type":"post","slug":"a-somewhat-scary-birthday","url":"http:\/\/devhawk.net\/2009\/05\/22\/a-somewhat-scary-birthday\/","status":"publish","title":"A Somewhat Scary Birthday","title_plain":"A Somewhat Scary Birthday","content":"<p>Yesterday was my 39th birthday. Among other things I got a <a href=\"http:\/\/www.mayoclinic.com\/health\/vasovagal-syncope\/DS00806\">vasovagal syncope<\/a> (aka I fainted), a trip to the hospital and an MRI. <\/p>\n<p>Yeah, I’ve had better birthdays. But I’m feeling much better now.<\/p>\n<p>Since Monday, I’ve been having weird numbness and tingling in my hands, feet and midsection. Ever have your foot fall asleep? You know how it feels when your foot wakes up again? It’s kinda like that. After three days of that, I decided it was time to go see the doctor. My doctor is right by my daughter’s school, so I try and schedule my appointments so I can drop her off and save my wife the trip. But the only appointment they had yesterday was thirty minutes before my daughter’s school starts, so I ended up going alone. That turned out to be a very good thing.<\/p>\n<p>Diabetes is one of the things that can cause this numbness and tingling, so my wife and I figured that I shouldn’t eat anything in case the doctor wanted to check my blood sugar. Sure enough, they wanted to run a few blood tests. My wife called as they were drawing my blood – she had dropped off our daughter and wanted to know if I wanted her to stop by.  I told her to stop by if she wanted, hung up, and promptly fainted. Luckily, Jules had decided she wanted to stop by so she was there when I came to.<\/p>\n<p>Apparently, vasovagal syncope is the most common cause of fainting and having your blood drawn is a common trigger. I’ve never had that reaction to having my blood drawn, though I can’t remember ever having my blood drawn while fasting. But I tell you what, I don’t ever want to go thru that again. All I really remember was trying to get my brain to focus, and it wouldn’t. Pretty scary.<\/p>\n<p>Playing it better safe than sorry, I was sent off to the hospital to spend two hours crammed in the MRI machine to get an scan of my brain and spine done. Also not a pleasant experience, but much better than fainting. There was much more ominous talk like “admitting for observation” and “lumbar puncture”, but apparently the MRI didn’t show anything requiring all that so I was sent home. <\/p>\n<p>I still have the numbness and tingling, though it’s somewhat better today than yesterday. The good news is that it’s not diabetes or my thyroid or anything like that and they don’t think the fainting was related at all. Since the tingling and numbness is a little better today, I’m thinking it’s something like a pinched nerve. My doctor wants me to go see a specialist, so I’ve got an appointment with a neurologist in a couple of weeks. We’ll see how it feels by then &#8211; in the meantime, I’m taking it easy. I even skipped work again today – five day weekend FTW! <\/p>\n<p>As for my birthday, we did decide to postpone my “<a href=\"http:\/\/twitter.com\/JuliannePierson\/status\/1851811876\">FANTASTIC surprise<\/a>”. Jules had arranged for us to go camping on Orcas island over the weekend. I’m really excited for the trip – it’ll be our first real camping trip outside of the back yard &#8211; but I’m not sure if I’ll be up for it this weekend. My parents sent me a bunch of Capitals gear as well as some money for new hockey equipment – I really need a new helmet and elbow pads. My kids both made me awesome cards – Patrick’s new thing is to make pop-up cards. He also made me a paper “cake” crown.<\/p>\n<p>So even though that whole tingling\/vasovagal\/hospital\/MRI thing was a less than fun way to spend the day, I still ended up having a pretty decent birthday. I’m especially thankful for my awesome wife, who does an amazing job taking care of me when I’m sick – much better than I am able to do for her when she’s sick I’m afraid. <\/p>\n","excerpt":"<p>Yesterday was my 39th birthday. Among other things I got a vasovagal syncope (aka I fainted), a trip to the hospital and an MRI. Yeah, I’ve had better birthdays. But I’m feeling much better now. Since Monday, I’ve been having weird numbness and tingling in my hands, feet and midsection. Ever have your foot fall [&hellip;]<\/p>\n","date":"2009-05-22 13:23:07","modified":"2011-04-16 22:07:55","categories":[{"id":352,"slug":"personal","title":"Personal","description":"","parent":0,"post_count":22}],"tags":[{"id":179,"slug":"family","title":"Family","description":"","post_count":33},{"id":282,"slug":"health","title":"Health","description":"","post_count":1}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2214,"name":"Marc Brooks","url":"http:\/\/musingmarc.blogspot.com","date":"2009-05-24 23:04:15","content":"<p>I had a very similar bout of continuous nerve pain (as you&#8217;ve described it) which was finally handled (not cured) by vastly increasing my liquid intake and taking Gabapentin which is an antidepressant, technically, but works awesomely to kill the tingles.<\/p>\n<p>Good luck, and don&#8217;t take &#8220;we&#8217;ll see&#8221; for an answer&#8230; I struggled for 5 years before I got a good doctor.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["9720afea-0387-4ee7-85b6-914d26a40ec7"],"dasblog_compressedtitle":["A+Somewhat+Scary+Birthday"],"dasblog_compressedtitleunique":["2009\/05\/22\/A+Somewhat+Scary+Birthday"]}},"previous_url":"http:\/\/devhawk.net\/2009\/05\/20\/ironpython-2-6-beta-1\/","next_url":"http:\/\/devhawk.net\/2009\/06\/03\/strengthening-the-microsoft-ecosystem-with-source-code\/"}