[
  {
    "id": 2165,
    "author-name": "Ali",
    "author-email": "arsyed@gmail.com",
    "author-url": "",
    "date": "2009-01-21T19:58:58-08:00",
    "content": "\"But wouldn’t the theme to Superman have been more appropriate?\"\n\nYes, Williams screwed up, but the Internets are on top of it ...\n\n<a href=\"http://www.youtube.com/watch?v=sI944RulJD4\" rel=\"nofollow\">http://www.youtube.com/watch?v=sI944RulJD4</a>\n\n\n\n",
    "parent-id": 1212,
    "RowKey": "20090121-195858"
  },
  {
    "id": 2166,
    "author-name": "Heath",
    "author-email": "jheathupton@hotmail.com",
    "author-url": "",
    "date": "2009-01-23T07:44:02-08:00",
    "content": "You seem to be a touch misinformed there. Bush inherited a recession but when he mentioned it he got thrashed by the media. The policies of the Bush administration kept our great country safe and for that I applaud him. We were at war before Bush even took office, but we were simply to naive to realize it. He cared less about his poll numbers and appeasing a hateful media and more about doing what was right and being a man of honor and dignity. As a former soldier and current intelligence professional, I can say with all honesty that President Bush was a great president and THE president that we needed during his 8 years. This election was handed to Obama on a silver platter and he nearly managed to drop it despite that fact. However, if President Obama can be half the man that Bush was and is, he will do quite well and the country will be well served. \n-Heath",
    "parent-id": 1212,
    "RowKey": "20090123-074402"
  },
  {
    "id": 2167,
    "author-name": "DevHawk",
    "author-email": "harry@devhawk.net",
    "author-url": "",
    "date": "2009-01-29T17:10:37-08:00",
    "content": "Heath, your willful ignorance is truely astounding. ",
    "parent-id": 1212,
    "RowKey": "20090129-171037"
  },
  {
    "id": 2168,
    "author-name": "Key",
    "author-email": "keycary@gmail.com",
    "author-url": "",
    "date": "2009-03-03T04:27:24-08:00",
    "content": "Harry, you are an ignorant if you think Bush was a bad president. Most of the problems were caused by the fact that the Dems blocked Bush at every turn. The dems held up regulations to fix Fannie and Freddie. The dems blocked drilling for oil, and then blame Bush for high oil prices. Why is health care expensive? Because dems block tort reform, and push for government solutions rather than free market solutions.\n\nCheck out George Orwell because you are putty in the hands of the media. They said Reagan was a bad president (but now have changed their opinion), and Clinton was a great president (who did nothing). Obama has been on the cover of Time magazine 17 times in one year -- I guess you got the message like a loyal robot.\n\nObama's done nothing his entire career -- would you make an intern the next CEO of Microsoft?\n\nHow's the economy going? The good thing about democracy is that we get to live with the choices we make. It makes for a smarter electorate, over time.",
    "parent-id": 1212,
    "RowKey": "20090303-042724"
  }
]