{"status":"ok","post":{"id":355,"type":"post","slug":"the-endangered-middle-tier-part-2","url":"http:\/\/devhawk.net\/2004\/04\/21\/the-endangered-middle-tier-part-2\/","status":"publish","title":"The Endangered Middle-Tier, Part 2","title_plain":"The Endangered Middle-Tier, Part 2","content":"<p>Among the responses to my <a href=\"http:\/\/devhawk.net\/PermaLink.aspx?guid=950774a9-b33b-4a46-bb2b-a481cf946251\">endangered middle-tier post<\/a> was <a href=\"http:\/\/weblogs.asp.net\/draper\/archive\/2004\/04\/14\/112851.aspx\">this one<\/a> by Ed Draper, architect evangelist for MSFT. While Ed makes some interesting points, on the whole his argument doesn&#8217;t hold much water.<\/p>\n<p>First off, his point about Moore&#8217;s law is accurate, yet irrelevant. While Moore&#8217;s law does relate to CPU speed, I was using it as an example of the rate that overall computing power improves. Storage capacity and network speed improve along a similar trajectory. 64-bit machines are at the early stages of becoming commonplace. And while it&#8217;s true that scalability doesn&#8217;t equal performance, having better performing hardware can significantly improve scalability. <\/p>\n<p>(Side note &#8211; if we&#8217;re going to be truly picky, <a href=\"http:\/\/www.intel.com\/research\/silicon\/mooreslaw.htm\">Moore&#8217;s law<\/a> actually refers to rate of improvement of the number of transistors per IC, which only roughly equates to performance. Intel&#8217;s <a href=\"http:\/\/www.intel.com\/products\/mobiletechnology\/index.htm?iid=ipp_note_proc+highlight_mobiletech&amp;\">Centrino<\/a> technology is all about using those increasing numbers of transistors for other things like wireless networking and battery management.)<\/p>\n<p>Ed spends quite a bit of time covering very low level computing concepts such as threads, locks, instruction cache, registers and the stack. I&#8217;m not sure why he does this. It almost feels like he only read the first part of my post, stopping right before he got to the part where I wrote: &#8220;Of course, it will be a long long time before Moore&#8217;s law can provide a single machine to run a BIG enterprise app&#8221;. In other words, I don&#8217;t expect to run my ERP, SCM, CRM or other BFD enterprise-scale app on one machine!<\/p>\n<p>Ed has missed a basic point of my post that I didn&#8217;t spell out as I thought it was obvious: <b>the independent services that make up a BIG enterprise class app can all run on different machines<\/b>. I&#8217;m guessing he missed that point by the way he ended his post:  <\/p>\n<blockquote><p>&#8220;Yes, distributed computing is a good thing.&#8221;<\/p>\n<\/blockquote>\n<p>As Ted <a href=\"http:\/\/www.neward.net\/ted\/weblog\/index.jsp?date=20040414\">points out<\/a>, it&#8217;s not just a good thing, &#8220;distributed computing is a <i>necessary<\/i> thing.&#8221; And a system of 100&#8242;s or 1000&#8242;s of independent services &#8211; which is what I&#8217;m describing &#8211; is significantly more distributable than the multi-tier monolithic applications we build today. <\/p>\n<p>Of course, it is guaranteed that a small percentage of services will continue to need to use scale out techniques to reach their scalability requirements. For example, it will be a very very long time (if ever) before a single piece of hardware could handle the order processing load Amazon.com generates a week before Christmas or the tax return filing load at the IRS on April 15th. This problem isn&#8217;t unique to application design. To draw a parallel to the database design world, there are a small percentage of tables that benefit from using <a href=\"http:\/\/msdn.microsoft.com\/library\/en-us\/optimsql\/odp_tun_1_2upf.asp\">filegroups<\/a> to isolate them on separate drives from the rest of the database. It happens &#8211; but it doesn&#8217;t <i>always<\/i> happen. It doesn&#8217;t even <i>usually<\/i> happen. I like Josh&#8217;s <a href=\"http:\/\/www.netcrucible.com\/blog\/PermaLink.aspx?guid=ddfa5a46-5c50-43b2-8e52-326c01269739\">comment<\/a> that &#8220;the vast majority of people who think they have workloads which require partition for scale are actually indulging in delusions of grandeur.&#8221;<\/p>\n<p>The point I was making is that computers are going to continue getting faster <strong>and<\/strong> service-oriented systems are likely to consist of boatloads of independent services with only modest scalability requirements. The combination of these two forces drastically reduces the number of scenarios where you need to use multi-tier scale out techniques to achieve the scalability requirements. If you don&#8217;t need a multi-tier deployment, then there is a <i>huge <\/i>performance and scalability benefit to running the service logic in the database process. If you don&#8217;t need to scale-out to achieve your requirement, why would you take the performance and scalability hit to run your code outside the database?<\/p>\n<p>It&#8217;s pointless to argue that computer aren&#8217;t getting faster or that running the code in process with the database doesn&#8217;t perform better. Ed (and Ted and Josh and everyone else reading this), I&#8217;d love to hear you opinions on the following:<\/p>\n<ul>\n<li>Will a service-oriented approach likely result in of boatloads of independent services where today we have one BIG app?\n<\/li>\n<li>If yes, will the vast majority of these boatloads of independent services have modest enough scalability requirements to run on a single piece of hardware in the near future?<\/li>\n<\/ul>\n","excerpt":"<p>Among the responses to my endangered middle-tier post was this one by Ed Draper, architect evangelist for MSFT. While Ed makes some interesting points, on the whole his argument doesn&#8217;t hold much water. First off, his point about Moore&#8217;s law is accurate, yet irrelevant. While Moore&#8217;s law does relate to CPU speed, I was using [&hellip;]<\/p>\n","date":"2004-04-21 23:49:54","modified":"2004-04-21 23:49:54","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2593,"name":"Darrel Miller","url":"","date":"2004-04-27 04:32:12","content":"<p>I can&#8217;t quote you the exact statistics but I think I can safely say 90% of North American companies are less 100 employees.  With that size of company you should easily be able to host a ERP, SCM or CRM type of app on a single server.<br \/>\nA disproportionate amount of media space is consumed by trying to resolve the scalability issues of Amazon and Google!<br \/>\nInterestingly enough, horizontally partitioned departmental applications, each installed on seperate servers starts to make large companies look like many smaller interoperating companies.<\/p>\n","parent":0},{"id":2594,"name":"Tom Vande Stouwe, MCT, MCSD","url":"http:\/\/www.conpro.net","date":"2004-05-11 13:41:06","content":"<p>While I agree with Darrel on the numbrer of &#8216;small&#8217; companies, I disagree with the conclusion. While these companies have low scalability need now, as the quantity and quality og &#8216;network enabled applications&#8217; and the use of Web Services et al, will make scalability and reusability very important topics for the small enterprise.<\/p>\n<p>large organizations are already architecting to scale, but the small company is ignoring it, and they will be the ones that will get caught short. We live in a global economy, and the well connected mud hut in lower Slobinia will take business from Main Street if they present a better electronic face.<\/p>\n<p>My Conclusion? Architecting and scalability is MORE important to the under 100 member comnpanies then to the Fortune 100 companies.  The fact that this represents 90% of American companies just points to the importance to our National economy not to ignore these &#8216;not so low hanging fruit&#8217; companies. <\/p>\n<p>We need to look at small company architecture as more of a structured approach, where processes will more likely impact the companies processes then in big companies where we try to make the systems work like the users, rather then the other way around. We need to start looking at Small enterprises as nothing more then small node on the larger network, and position ourselves and our clients to capitalize on that.<\/p>\n<p>In any case we can be sure that the needs of our small business will be met, either by us, or by our (international and national) competition.<\/p>\n","parent":0},{"id":2595,"name":"Darrel Miller","url":"","date":"2004-05-14 15:58:21","content":"<p>&#8220;While these companies have low scalability need now, as the quantity and quality og &#8216;network enabled applications&#8217; and the use of Web Services et al, will make scalability and reusability very important topics for the small enterprise. &#8221;<\/p>\n<p>I&#8217;m confused!  Why would the quantity or quality of network enabled applications affect the scalabilty requirements of a small business?<\/p>\n<p>Scalability is about the number of transactions, the number of users, the number of clients a company has.<\/p>\n<p>The majority of small companies are not small because they are budding Ebay&#8217;s that are just waiting for their big break.  Many are small because that&#8217;s how the like it, some are small because they don&#8217;t have the management capacity to grow, some are in a business that just naturally doesn&#8217;t scale.<\/p>\n<p>Most companies don&#8217;t fail to grow because their IT infrastructure can&#8217;t handle it.<br \/>\nDon&#8217;t get me wrong, some startups have every intention of becoming big, quickly and need to plan for that.  But that is a small percentage of companies.<\/p>\n<p>Trust me when I say that I will not be ordering pizza over the web from a 10 man outfit in lower Slobenia any time soon!<\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["4c3d4706-8081-488c-a6e9-facd6364a058"],"dasblog_compressedtitle":["The+Endangered+MiddleTier+Part+2"],"dasblog_compressedtitleunique":["2004\/04\/22\/The+Endangered+MiddleTier+Part+2"]}},"previous_url":"http:\/\/devhawk.net\/2004\/04\/20\/broadcasting-music\/","next_url":"http:\/\/devhawk.net\/2004\/04\/22\/new-toy\/"}