{"status":"ok","post":{"id":207,"type":"post","slug":"virtual-dogfooding","url":"http:\/\/devhawk.net\/2003\/10\/14\/virtual-dogfooding\/","status":"publish","title":"Virtual Dogfooding","title_plain":"Virtual Dogfooding","content":"<p>One of the cool things about using VPC to host my dev environment(s) is that I can easily dogfood and experiment. For example, I can run my VPC in &#8220;undo&#8221; mode so that when I shut down, I can choose to merge, keep or throw away all the changes I made to that VPC. This is a great safety net when dogfooding a bunch of different stuff. I&#8217;ve got a VPC with Whidbey and Indigo. Instead of creating a separate VPC for Yukon, I can install it into the Whidbey\/Indigo VPC and see how well they play together. It does mean I have a long merge cycle when I shut down (assuming I don&#8217;t want to rollback the changes) and the VPC is runs slightly slower. But it&#8217;s a heck of a lot easier than finding out after the fact that build of this doesn&#8217;t work with this build of that.<\/p>\n<p>Even for my &#8220;production&#8221; dev environments (I have two &#8211; client and server), I can make a back up of the entire system as easily as copying the multi-GB virtual hard drive file to a safe location. Of course, it helps that I have 1GB of RAM and nearly 85GB of HD space in my laptop.<\/p>\n<p>The only downside is that actually dogfooding <a href=\"http:\/\/www.microsoft.com\/windowsxp\/virtualpc\/\">Virtual PC<\/a> is a bit of a pain. We have prebuilt XP and WS03 images available internally. But since I&#8217;m on a later build of VPC, the additions aren&#8217;t always compatible with my build. Our website lists &#8220;late in calendar year 2004&#8243; for the availability of Virtual PC 2004. So I guess there&#8217;s a light at the end of that dogfood tunnel.<\/p>\n","excerpt":"<p>One of the cool things about using VPC to host my dev environment(s) is that I can easily dogfood and experiment. For example, I can run my VPC in &#8220;undo&#8221; mode so that when I shut down, I can choose to merge, keep or throw away all the changes I made to that VPC. This [&hellip;]<\/p>\n","date":"2003-10-14 15:40:12","modified":"2003-10-14 15:40:12","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["27f8ffe6-b9e8-4610-a443-b5c51df788c9"],"dasblog_compressedtitle":["Virtual+Dogfooding"],"dasblog_compressedtitleunique":["2003\/10\/14\/Virtual+Dogfooding"]}},"previous_url":"http:\/\/devhawk.net\/2003\/10\/14\/give-soap-a-chance-reprise\/","next_url":"http:\/\/devhawk.net\/2003\/10\/16\/lovehate-for-wired\/"}