{"status":"ok","post":{"id":451,"type":"post","slug":"saf-day-2","url":"http:\/\/devhawk.net\/2004\/10\/13\/saf-day-2\/","status":"publish","title":"SAF Day 2","title_plain":"SAF Day 2","content":"<p>I sat through four session yesterday &#8211; two keynotes and two informational presentations. My favorite of the four was the session on Business Architecture by Jack Calhoun, CEO of <a href=\"http:\/\/www.accelare.com\/\">Accelare<\/a>. I can&#8217;t summarize it effectively, so I won&#8217;t try. However, one of the key points I took from the presentation is that the architecture of the business is evolving away from an organizational-based model towards a capability-based model. That&#8217;s fascinating because business capabilities are a natural match to technology services. Jack made a point that SOA isn&#8217;t going to be successful if it&#8217;s just as new technology mechanism &#8211; it also needs to enable to business models. He also introduced a term I had never heard before &#8211; &#8220;<a href=\"http:\/\/en.wikipedia.org\/wiki\/Chaordic\">chaordic<\/a>&#8220;. The term chaordic is a combination of chaotic and ordered and is used to describe the dynamic organization of complex systems (like enterprises). It was coined (I believe) by <a href=\"http:\/\/en.wikipedia.org\/wiki\/Dee_Hock\">Dee Hock<\/a>, former CEO of Visa who wrote a book on the subject called <a href=\"http:\/\/search.barnesandnoble.com\/bookSearch\/isbnInquiry.asp?isbn=1576750744\">Birth of the Chaordic Age<\/a>. Yet another book to add to the tall stack that I&#8217;m still working through.<\/p>\n<p>This morning, I ran a breakout on Refactoring Your Best Practices. I didn&#8217;t bring much presentation material to this session since I&#8217;m not sure we do a great job of this. Actually, we (i.e. Microsoft) do a pretty good job capturing best practices, but we&#8217;re less effective at reusing those practices. One of the reasons we&#8217;re not great at using these practices is because it&#8217;s very hard to capture the context of the best practice. The breakout session was awesome. We had a variety of experiences represented, from a company where best practices have become rigid rules that must be followed blindly, even when they stop making sense, to a company that has a &#8220;Chief Methodologist&#8221; who runs a group of architects who build best practices the way that other groups build products. I thought that the project-esque approach was fascinating. One of the implications is that we need to capture baseline information about the practices, so we can tell if we&#8217;ve improved as we refactor. All in all, it was a great discussion. I think everyone got value from it as we decided to &#8220;keep the conversation going&#8221; on email after the event.<\/p>\n<p>The second morning session was a Q&amp;A with Bill Gates and Eric Rudder. This is one of the high points of this event for the attendees. He was asked about a variety of topics, but the one that caught my attention was Bill&#8217;s opinion of blogs and if he is planning to start his own soon. Not surprisingly, he was very positive about blogging but made no commitment to starting a blog anytime soon. He&#8217;s said he didn&#8217;t want to start a blog unless he had the time to make a commitment to blog regularly. Of course, that&#8217;s exactly what has happened with <a href=\"http:\/\/msdn.microsoft.com\/blogs\/ericr\/\">Eric&#8217;s blog<\/a>. However, in his defense, Eric made a great point &#8211; one of the reasons he started his blog to encourage the employees in his division (Servers &amp; Tools) to blog. I&#8217;d love to see Bill and Eric blog, but I think it&#8217;s the rank-and-file Microsoft bloggers that are really making a difference in the community.<\/p>\n","excerpt":"<p>I sat through four session yesterday &#8211; two keynotes and two informational presentations. My favorite of the four was the session on Business Architecture by Jack Calhoun, CEO of Accelare. I can&#8217;t summarize it effectively, so I won&#8217;t try. However, one of the key points I took from the presentation is that the architecture of [&hellip;]<\/p>\n","date":"2004-10-13 14:51:47","modified":"2004-10-13 14:51:47","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2690,"name":"Dad","url":"","date":"2004-10-14 06:18:27","content":"<p>I told you about Dee Hock years ago!  I have his book.  You can borrow it at Thanksgiving.<\/p>\n<p>   Dad<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["6a4515b1-5ebc-4187-991d-7bcb118df5ef"],"dasblog_compressedtitle":["SAF+Day+2"],"dasblog_compressedtitleunique":["2004\/10\/13\/SAF+Day+2"]}},"previous_url":"http:\/\/devhawk.net\/2004\/10\/12\/wse2-and-wsdl\/","next_url":"http:\/\/devhawk.net\/2004\/10\/13\/more-architect-bloggers\/"}