[
  {
    "author-name": "Dave",
    "author-email": "anderdb@hotmail.com",
    "author-url": "",
    "date": "2008-02-11T16:12:27-08:00",
    "content": "As far as I'm concerned, posting about topics such as politics or religions on a blog that's supposedly about technology is just looking for trouble.  I was willing to overlook this one post until the \"douche bag\" comment.  You've been dropped from my Google Reader subscriptions.  I'm sure I won't be the only one dropping you.  "
  },
  {
    "author-name": "Nick Malik",
    "author-email": "",
    "author-url": "http://blogs.msdn.com/nickmalik",
    "date": "2008-02-11T19:07:17-08:00",
    "content": "I was at the Obama political rally on Friday.  Here's the thing:\nHis campaign announces that there will be a rally at the Key Arena (where the Seattle Supersonics Pro Basketball team plays) on Wednesday.  Not a big announcement.  No advertising.  No radio and TV spots.  Free press only.\n\nBy Friday morning, at 11am, there was a line around the block to get into Key Arena.  After filling the place to capacity (17,000 people), they had to close the doors.  Fire code.\n\n5,000 more people stood outside, in the cold, and waited for three hours.  When Barak came, we heard him on loud speakers.  \n\nHarry: I canvassed for Bill Clinton (twice) and John Kerry as well.  I knocked on doors and attended rallys and stood on street corners reminding voters to Get Out and Vote.  I placed signs and hung banners and, yes, attended rallys.\n\nMost rallys have about 100 people.  Really Big Rallys can draw 1,000 people.\n\n22,000 people is not a rally.  22,000 people, with no advertising, and two day's notice, in a far-away corner of the country, not used to getting any political attention at all... that's historic.\n\nHillary drew 5,000 on the same day, a few hours earlier.\n\nThe fact that she lost by ONLY 2-to-1 in the polls shows that her voters get to the polls far more than they get to the rallys.  \n\nBut she lost.  Big.\n\nI like them both.  Either would make a fine president.  But I'm rooting for Barak.  "
  },
  {
    "author-name": "Rick",
    "author-email": "",
    "author-url": "",
    "date": "2008-02-13T09:03:16-08:00",
    "content": "Yes, you are an idiot and a bigot.\nBye bye."
  },
  {
    "author-name": "Jeff Brown",
    "author-email": "jeff.brn@gmail.com",
    "author-url": "",
    "date": "2008-02-14T13:59:29-08:00",
    "content": "You are another example of the truth:\n'If democrats had any brains they'd be republicans'\n\nidiot"
  },
  {
    "author-name": "Dale Churchward",
    "author-email": "dale.churchward@microsoft.com",
    "author-url": "http://halfmybrain.spaces.live.com/",
    "date": "2008-02-19T11:27:07-08:00",
    "content": "Harry and I come from opposite sides of the political spectrum, but one thing I can say for sure, he is not an idiot. I find it interesting to discuss politics with Harry as he makes me think about why I support certain politicans and issues. While we often disagree I always respect the thought process that led him to the views he takes.\n\nAlso, it is hard for me to accept calling him a bigot. No matter the reason, Harry will likely support either Hillary Clinton or Barak Obama. That in itself should point out that he is not a bigot. As far as him comments about Mitt Romney, they might of been a bit strong, although it was pretty well known that the other candidates for the Republican nomination couldn't stand Mitt. I am LDS, just like Mitt, and I have never felt Harry has treated me any differently then any of his other co-workers. He has even asked me questions about the church, and has not treated me any different because of my religious beliefs.\n\nIn any case, this is Harry's blog. He writes about technology much of the time because he is passionate about it, but he also writes about other areas that interest him such as hockey, movies, and politics. We make the choice to read his thoughts or now, but I will say Harry does a good job tagging his blog entires so you can decide if you wish to read them or not."
  }
]