[
  {
    "author-name": "Julianne Pierson",
    "author-email": "juliannepierson@hotmail.com",
    "author-url": "",
    "date": "2004-11-03T10:51:19-08:00",
    "content": "Husband, I love you. I am sorry that this has been very hard on us all, but I remain hopeful that things will turn out well as long as people remain vigilant."
  },
  {
    "author-name": "Ted Stapleton",
    "author-email": "ted.stapleton@gmail.com",
    "author-url": "",
    "date": "2004-11-03T10:52:44-08:00",
    "content": "Australia also just voted in a conservative in a landslide election.\n\n\"The closest I'm willing to get to politics for a while is is The West Wing.\"\n\nAnd that is _exactly_ why the left is where it is. You'd rather content yourself with a fantasy of how you'd like to it to be in the big bad old world instead of facing it head on.\n"
  },
  {
    "author-name": "Ted Stapleton",
    "author-email": "ted.stapleton@gmail.com",
    "author-url": "",
    "date": "2004-11-03T11:05:22-08:00",
    "content": "Wow.. that's the quickest IP ban I've ever seen... Further proving my point...\n\nI'll piss off now..."
  },
  {
    "author-name": "DevHawk",
    "author-email": "devhawk@outlook.com",
    "author-url": "",
    "date": "2004-11-03T12:45:59-08:00",
    "content": "Ted, you might have seen a server error, but I didn't ban your IP. I don't ban any IP sites on this blog (though I have deleted derogatory comments at times). You're right about the conservative election in Australia and the \"fantasy\" comment. \n\nMy point about increasing voter turnout was not an attempt to swing to vote to the Democrats - as I pointed out in my previous post, we had massive turnout this time (highest since '68 I read somewhere) but the convential wisdom that higher turnout favors Democrats didn't hold. I doubt that a higher turnout could have overcome Bush's 4 million popular vote lead.\n\nAs for the being content with a fantasy, let me make it very clear - I'm not content at all. However, I am burnt out. I need a little R&R before returning to take this head on. But make no mistake, I will be returning.\n\nSorry you thought I banned your IP. We may disagree, but that doesn't mean I want you to piss off.\n\n"
  },
  {
    "author-name": "Ted Stapleton",
    "author-email": "ted.stapleton@gmail.com",
    "author-url": "",
    "date": "2004-11-03T13:17:34-08:00",
    "content": "Point taken. Please accept my apologies."
  }
]