{"status":"ok","post":{"id":1180,"type":"post","slug":"pdc08-day-2","url":"http:\/\/devhawk.net\/2008\/10\/25\/pdc08-day-2\/","status":"publish","title":"PDC08 Day -2","title_plain":"PDC08 Day -2","content":"<p>I’m in Los Angeles for PDC. Now that all the prep work is done, I’m going to to try and get back to regular blogging and I figure that daily reports from PDC is as good a way as any to get started.<\/p>\n<p>I’m in town early for two reasons. We’re doing some last minute dry runs tomorrow afternoon and I wanted to make sure I was in town in case there was any other last minute stuff to do. Additionally, there’s a <a href=\"http:\/\/www.socalcodecamp.com\/\">Code Camp in SoCal<\/a> this weekend, so I volunteered to do my <a href=\"http:\/\/www.socalcodecamp.com\/session.aspx?sid=96fe471e-e96d-4c82-bfa4-a2f7d4d88387\">Pumping Iron<\/a> talk. <\/p>\n<p>The talk went pretty well – the room was mostly full (though small) and many folks stayed as much as 30 minutes over to ask questions. The Code Camp is being held at USC, my alma mater, so it was kind of strange to be standing in the front of the classroom in Vivian Hall rather than taking notes at the back. I made a trip over to the campus bookstore (thought I kept calling it the ‘company store’) for a new T-shirt for me and some SC gear for the kids. <\/p>\n<p>Hung out most of the day with <a href=\"http:\/\/mvasoftware.com\/blogs\/mikev_weblog\">Mike VIncent<\/a> whom I’ve gotten to know over the past couple of years thru his IASA and INETA involvement. He’s doing a talk on <a href=\"http:\/\/www.socalcodecamp.com\/session.aspx?sid=2151c611-844d-4918-bf8d-af0563677baa\">Dynamic Languages and the DLR<\/a> tomorrow at Code Camp, so I’m looking forward to that. Also spent time with <a href=\"http:\/\/blogs.msdn.com\/chrsmith\/\">Chris Smith<\/a> (F# SDET), <a href=\"http:\/\/diditwith.net\/\">Dustin Campbell<\/a> (VB PM), <a href=\"http:\/\/blogs.msdn.com\/charlie\/\">Charlie Calvert<\/a> (C# PM) and ran into <a href=\"http:\/\/donxml.com\/\">DonXML<\/a> as I was heading out.<\/p>\n<p>I headed out early because I’m going up over the hill to Burbank tonight to see some of my old college \/ LA buddies, drink some beer and watch the <a href=\"http:\/\/sports.espn.go.com\/ncf\/preview?gameId=282990012\">SC game<\/a>. With our early loss to Oregon State, we can’t make the Rose Bowl, much less the BCS Championship, without help. If win out but don’t get help, we’ll still probably get a BCS at-large bid. For a team that’s been in the championship hunt for the past five years, it’s disappointing, but it’s also like “no pressure” – at least for me, an non-obsessive alumni fan. (I typically save my obsession for Capitals hockey, but even that takes a back seat to the presidential election for the next 11 days.)<\/p>\n<p>I forget who said it, but someone said today that “Los Angeles was like paradise 50 years ago”. Truer words were rarely ever said. It’s nice to be on campus and see friends and all that, but I can’t wait to go home. Why does PDC <em>always<\/em> have to be in LA? <a href=\"http:\/\/blogs.msdn.com\/mswanson\/\">Mike<\/a>? Well, at least it’s not <a href=\"http:\/\/devhawk.net\/2003\/10\/26\/Stuck+SEATACLike+Everyone+Else.aspx\">on fire this time<\/a>.<\/p>\n","excerpt":"<p>I’m in Los Angeles for PDC. Now that all the prep work is done, I’m going to to try and get back to regular blogging and I figure that daily reports from PDC is as good a way as any to get started. I’m in town early for two reasons. We’re doing some last minute [&hellip;]<\/p>\n","date":"2008-10-25 16:02:53","modified":"2008-10-25 16:02:53","categories":[{"id":252,"slug":"ironpython","title":"IronPython","description":"","parent":0,"post_count":99}],"tags":[{"id":262,"slug":"pdc08","title":"PDC08","description":"","post_count":5},{"id":270,"slug":"usc","title":"USC","description":"","post_count":1}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["0c0fea3c-8f82-4e2f-a017-a989cf25d04c"],"dasblog_compressedtitle":["PDC08+Day+Ndash2"],"dasblog_compressedtitleunique":["2008\/10\/25\/PDC08+Day+Ndash2"]}},"previous_url":"http:\/\/devhawk.net\/2008\/10\/24\/ironpython-2-0-release-candidate\/","next_url":"http:\/\/devhawk.net\/2008\/11\/01\/i-survived-october\/"}