{"status":"ok","post":{"id":1229,"type":"post","slug":"writing-an-ironpython-debugger-debugging-just-my-code","url":"http:\/\/devhawk.net\/2009\/03\/13\/writing-an-ironpython-debugger-debugging-just-my-code\/","status":"publish","title":"Writing an IronPython Debugger: Debugging Just My Code","title_plain":"Writing an IronPython Debugger: Debugging Just My Code","content":"<p>As I wrote last time, in order to make debug stepping actually useful in ipydbg I need to avoid stepping into frames that are part of the IronPython infrastructure. I did something similar when I <a href=\"http:\/\/devhawk.net\/2009\/03\/09\/Writing+An+IronPython+Debugger+Dynamic+Stack+Trace.aspx\">hide infrastructure frames in the stack trace<\/a>. Originally, I had planned to automatically stepping again if we ended up on a frame that didn’t correspond to a python file. However, <a href=\"http:\/\/blogs.msdn.com\/jmstall\/default.aspx\">Mike Stall<\/a> showed me a much cleaner and better performing solution: Just My Code. As I mentioned at the <a href=\"http:\/\/devhawk.net\/2009\/02\/27\/Writing+An+IronPython+Debugger+Introduction.aspx\">start of this series<\/a>, support for JMC is one of the main reasons I wanted to build my own debugger rather than use MDbg.<\/p>\n<p>Enabling JMC in the stepper object is trivial:<\/p>\n<pre class=\"brush: python\">\ndef create_stepper(thread, JMC = True):     \n  stepper = thread.ActiveFrame.CreateStepper()     \n  stepper.SetUnmappedStopMask(CorDebugUnmappedStop.STOP_NONE)     \n  stepper.SetJmcStatus(JMC)  \n  return stepper\n<\/pre>\n<p>If I make that single change and run ipydbg, any step effectively turns into a full continue since none of the code has been marked as “My Code” yet. As you see, the tricky part of JMC isn’t enabling it on the stepper, it’s “painting” the parts of the code where you want JMC stepping to work. You can set JMC status at the <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/ms231586.aspx\">module<\/a>, <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/ms230160.aspx\">class<\/a> or the <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/ms230220.aspx\">method<\/a> level. In the case of ipdbg, it’s easiest to work at the class level:<\/p>\n<pre class=\"brush: python\">\ninfrastructure_methods =  ['TryGetExtraValue',      \n    'TrySetExtraValue',      \n    '.cctor',      \n    '.ctor',      \n    'CustomSymbolDictionary.GetExtraKeys',      \n    'IModuleDictionaryInitialization.InitializeModuleDictionary']     \n\ndef OnClassLoad(self, sender, e):     \n    cmi = CorMetadataImport(e.Class.Module)     \n    mt = cmi.GetType(e.Class.Token)     \n    print \"OnClassLoad\", mt.Name     \n\n    if not e.Class.Module.IsDynamic:     \n      e.Class.JMCStatus = False\n    elif mt.Name.startswith('IronPython.NewTypes'):     \n      e.Class.JMCStatus = False\n    else:     \n      e.Class.JMCStatus = True\n      for mmi in mt.GetMethods():     \n        if mmi.Name in infrastructure_methods:     \n          f = e.Class.Module.GetFunctionFromToken(mmi.MetadataToken)     \n          f.JMCStatus = False\n<\/pre>\n<p>OnClassLoad is where the action is. This event handler is responsible for enabling JMC for all class methods that map to python code. To understand how the logic in OnClassLoad works, you need to understand a little about the .NET types and code that IronPython generates. Note, the following description is for the IronPython 2.0 branch. Code generation evolves from release to release and I know for a fact there are changes in the upcoming 2.6 version. I assume that I’ll eventually have to sniff the IronPython version in order to set JMC correctly.<\/p>\n<p>Today, IronPython generates all code into dynamic modules and methods. Since I want to limit stepping to python code only, I automatically disable JMC for non-dynamic modules. I can imagine a scenario where I want to step into non-dynamically generated code, but I think the best way to handle that would be to disable JMC at the stepper rather than widening the amount of code marked as JMC enabled.<\/p>\n<p>For every module that gets loaded, IronPython generates a type. At a minimum you’re going to load two modules: site.py and whatever python script you ran. If you have the python standard library installed, site.py loads a bunch of other modules as well. Each of these module types have a bunch of standard methods that always get generated. For example, the global scope code in the module is placed in a static method on the module type called Initialize. Any python functions you define get generated static methods with mangled names on the module type [1]. All these methods have corresponding python code and should be JMC enabled. The other standard methods on a module type should not be JMC enabled. So in my debugger, I mark the class as JMC enabled but then iterate over the list of methods and mark any in the list of standard methods (except for Initialize) as JMC disabled.<\/p>\n<p>Of course, you can also <a href=\"http:\/\/docs.python.org\/reference\/compound_stmts.html#class-definitions\">create classes<\/a> in Python. As you might expect, classes in Python are generated as .NET types. However, the semantics of Python classes are very different than .NET types. For example, you can change the inheritance hierarchy of python classes at runtime. That’s obviously not allowed for .NET types. So the .NET types we generate have all the logic to implement Python class semantics. As it turns out, these .NET types *only* have the logic to implement Python class semantics, which is to say they have *none* of Python class methods code. This makes sense when you think about it – since Python can add and remove methods from a class at runtime, IronPython can’t put the method code in the .NET type itself. Instead, Python class methods are generated as static methods on the module type, just like top-level functions are. Since Python class types only contain Python class semantics logic, we never want to enable JMC for Python class types. Python class types get generated in the IronPython.NewTypes namespace, so it’s fairly easy to check the class name in OnClassLoad and automatically disable JMC for classes any in that namespace.<\/p>\n<p>Adding JMC support makes ipydbg significantly more usable. It’s almost like a real tool now, isn’t it? <a href=\"http:\/\/github.com\/devhawk\/ipydbg\/tree\/39eb5ea81b8a493d9605d4cce4b3ef75fec4f327\">Latest bits<\/a> are up on GitHub. <\/p>\n<hr \/>\n<p>[1] FYI, IronPython generates python functions as <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/system.reflection.emit.dynamicmethod.aspx\">dynamic methods<\/a> in release mode and static module class methods in debug mode since you can’t step into dynamic methods. The description above is specific to debug mode since ipydbg exclusively runs in debug mode.<\/p>\n","excerpt":"<p>As I wrote last time, in order to make debug stepping actually useful in ipydbg I need to avoid stepping into frames that are part of the IronPython infrastructure. I did something similar when I hide infrastructure frames in the stack trace. Originally, I had planned to automatically stepping again if we ended up on [&hellip;]<\/p>\n","date":"2009-03-13 16:43:36","modified":"2009-03-13 16:43:36","categories":[{"id":252,"slug":"ironpython","title":"IronPython","description":"","parent":0,"post_count":99}],"tags":[{"id":279,"slug":"debugger","title":"Debugger","description":"","post_count":23}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2178,"name":"David Lawler","url":"","date":"2009-03-19 05:29:22","content":"<p>Very nice!  I&#8217;m looking forward to when you get to being able to set a breakpoint and view locals.  I played with Mdbg a while back and even was able to get it working in an IP project&#8230;but using the &#8216;higher level&#8217; interface, not CorDebug.  This looks like it will be much faster\/better.  I look forward to your updates.<\/p>\n<p>Regards,<\/p>\n<p>David L.<\/p>\n","parent":0},{"id":2179,"name":"David Lawler","url":"","date":"2009-03-19 11:40:17","content":"<p>Hehe &#8211; or I could do an ugly version myself:<\/p>\n<p>add         self.breakpoints = {}   to the run method of IPyDebugProcess<\/p>\n<p>add new method:<br \/>\n    def update_breakpoints(self):<br \/>\n        for key, active in self.breakpoints.items():<br \/>\n            docname, line = key<br \/>\n            if not(active):<br \/>\n                for module, reader in self.symbol_readers.items():<br \/>\n                    for doc in reader.GetDocuments():<br \/>\n                        if doc.URL.endswith(docname):<br \/>\n                            create_breakpoint(doc, line, module, reader)<br \/>\n                            self.breakpoints[key] = True<br \/>\n                            return<\/p>\n<p>and add this to your _input method:<br \/>\n            elif k.Key == ConsoleKey.B:<br \/>\n                ri = raw_input(&#8220;nenter breakpoint (doc line): &#8220;)<br \/>\n                raw = ri.split(&#8221; &#8220;)<br \/>\n                key = (raw[0], int(raw[1]))<br \/>\n                if not key in self.breakpoints.keys():<br \/>\n                    self.breakpoints[key] = False<br \/>\n                self.update_breakpoints()<\/p>\n<p>lastly add         self.update_breakpoints()<br \/>\nin the OnUpdateModuleSymbols method right after self.symbol_readers[e.Module] = reader line and it works!  Probably very ugly&#8230;but who cares for now.  Now I need to allow for breakpoint deletion&#8230;<\/p>\n<p>Oh it&#8217;s killing the formatting in my message!  Too bad.  Thanks for a fun little project!<\/p>\n<p>David<\/p>\n","parent":0},{"id":2180,"name":"DevHawk","url":"","date":"2009-03-21 18:21:37","content":"<p>Wasted formatting or not, I like your code David! Breakpoints and viewing locals are definitely on my radar, so keep watching this space.<\/p>\n","parent":0}],"attachments":[],"comment_count":3,"comment_status":"closed","custom_fields":{"dasblog_entryid":["7a36bcc8-a7cd-4d41-a6f8-7b600699c35e"],"dasblog_compressedtitle":["Writing+An+IronPython+Debugger+Debugging+Just+My+Code"],"dasblog_compressedtitleunique":["2009\/03\/13\/Writing+An+IronPython+Debugger+Debugging+Just+My+Code"]}},"previous_url":"http:\/\/devhawk.net\/2009\/03\/13\/writing-an-ironpython-debugger-stepping-thru-code\/","next_url":"http:\/\/devhawk.net\/2009\/03\/19\/writing-an-ironpython-debugger-showing-source-code\/"}