{"status":"ok","post":{"id":545,"type":"post","slug":"it-has-come-to-this","url":"http:\/\/devhawk.net\/2005\/02\/16\/it-has-come-to-this\/","status":"publish","title":"It Has Come To This","title_plain":"It Has Come To This","content":"<blockquote dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"><p>&#8220;When I stood before you in September, I said NHL teams would not play again until our economic problems had been solved. As I stand before you today, it is my sad duty to announce that because that solution has not yet been attained, it no longer is practical to conduct even an abbreviated season. Accordingly, I have no choice but to announce the formal cancellation of play for 2004-05&#8243; [<a href=\"http:\/\/nhlcbanews.com\/news\/season_cancelled021605.html\">NHL Commissioner Gary Bettman<\/a>]<\/p>\n<\/blockquote>\n<p dir=\"ltr\">I have blogged about the NHL work stoppage several times - I imagine it&#8217;s pretty obvious that I place the blame for the cancellation of the season firmly on the shoulders of the NHL players association. I find it interesting that Gary open his comments today with an apology to the fans while NHLPA exec director Bob Goodenow opened his comments today by slamming the league. In fact, when asked if the NHLPA owes the fans an apology, this was Bob&#8217;s <a href=\"http:\/\/www.nhlpa.com\/Content\/Feature.asp?contentId=3428\">response<\/a>:<\/p>\n<blockquote dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"><p dir=\"ltr\">&#8220;Absolutely an apology to all the fans, and speaking on behalf of all the players up here, they didn&#8217;t want to be locked out. They didn&#8217;t want to be not allowed to entertain the fans. Gary owes an apology because he started the lock out. He put all this in motion, and the proposals that these players have put forward, in particular, the roll back, which would have made the league successful in one fell swoop, very serious steps were taken, and, you know, yes, we apologize to the fans for this situation, this circumstance, and the fans can say, what are you going to do about it? Well, we&#8217;ve done an awful lot, we feel, to get to a fair resolution, and unfortunately, it&#8217;s the other side that we haven&#8217;t been able to make a contact with, and it&#8217;s unfortunate that this situation will continue. That&#8217;s all I can say.&#8221;<\/p>\n<\/blockquote>\n<p dir=\"ltr\">I guess the NHLPA doesn&#8217;t believe they owe me &#8211; the fan &#8211; an apology. Here&#8217;s my response to Bob&#8217;s response:<\/p>\n<blockquote dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"><p dir=\"ltr\">Fuck you, Bob. <\/p>\n<\/blockquote>\n<p dir=\"ltr\">If Bob really believes that the player&#8217;s proposal would have made the league successful, how come they didn&#8217;t accept the league&#8217;s <a href=\"http:\/\/www.nhlcbanews.com\/news\/nhl_compromise020905.html\">offer last week<\/a> to try it the player&#8217;s way, but have a system in place to enforce cost certainty if it didn&#8217;t work? I&#8217;m guessing it&#8217;s because no matter how many times the Bob refers to one of his proposals as &#8220;groundbreaking&#8221; than nobody &#8211; including Bob &#8211; really believes that the 24% rollback would do anything to stem the skyrocketing salaries in the long run. Bob had the nerve to say in his statement today that &#8220;During the last CBA, when revenues went up, so did salaries. When revenues eased, so did salaries. As evidenced by recent signings.&#8221; What a load of bullshit. When revenue growth dropped to around 5% year over year in 01\/02 &amp; 02\/03, salary growth ballooned to almost 12%. And as for &#8220;evidenced by recent signings&#8221;, I guess Bob is just going to gloss over the fact that reason that salaries has eased recently is only because so many players went unsigned last summer since all the teams realized the lockout was looming. <\/p>\n<p dir=\"ltr\">Well I guess if I need a hockey fix, my only choice is catching a <a href=\"http:\/\/www.silvertips.com\/\">Silvertips<\/a> or <a href=\"http:\/\/www.seattle-thunderbirds.com\/\">Thunderbirds<\/a> game.<\/p>\n","excerpt":"<p>&#8220;When I stood before you in September, I said NHL teams would not play again until our economic problems had been solved. As I stand before you today, it is my sad duty to announce that because that solution has not yet been attained, it no longer is practical to conduct even an abbreviated season. [&hellip;]<\/p>\n","date":"2005-02-16 20:19:20","modified":"2005-02-16 20:19:20","categories":[{"id":234,"slug":"sports","title":"Sports","description":"","parent":0,"post_count":50}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2781,"name":"Adwait Ullal","url":"http:\/\/dotnetjunkies.com\/weblog\/adwait","date":"2005-02-17 09:47:23","content":"<p>NHL = No Hockey League (from Tom Peter&#8217;s Log <a href=\"http:\/\/www.tompeters.com\/entries.php?rss=1&#038;note=http:\/\/www.tompeters.com\/blogs\/main\/007478.php\" rel=\"nofollow\">http:\/\/www.tompeters.com\/entries.php?rss=1&#038;note=http:\/\/www.tompeters.com\/blogs\/main\/007478.php<\/a>)<\/p>\n","parent":0},{"id":2782,"name":"Casey","url":"http:\/\/nhl.gongshow.net","date":"2005-02-24 08:45:39","content":"<p>Here&#8217;s another thing to mention about Bob.  The apology that you quote wasn&#8217;t given until the media asked him if he wanted to apologize.<\/p>\n<p>And then he tries to spin the apology to make Bettman look bad.<\/p>\n<p>Brutal.<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["0ceb11bf-65bb-41c0-97f5-bf5bd8ecfb6f"],"dasblog_compressedtitle":["It+Has+Come+To+This"],"dasblog_compressedtitleunique":["2005\/02\/17\/It+Has+Come+To+This"]}},"previous_url":"http:\/\/devhawk.net\/2005\/02\/16\/you-never-owned-any-music\/","next_url":"http:\/\/devhawk.net\/2005\/02\/18\/atom-is-used-more-than-i-thought\/"}