{"status":"ok","post":{"id":242,"type":"post","slug":"delivering-messages-with-sql-service-broker","url":"http:\/\/devhawk.net\/2003\/12\/09\/delivering-messages-with-sql-service-broker\/","status":"publish","title":"Delivering Messages with SQL Service Broker","title_plain":"Delivering Messages with SQL Service Broker","content":"<p><a href=\"http:\/\/www.microsoft.com\/sql\/yukon\/productinfo\/top30features.asp#B\">SQL Service Broker<\/a> is probably the least known new feature of <a href=\"http:\/\/www.microsoft.com\/sql\/yukon\/productinfo\">SQL Server &#8220;Yukon&#8221;<\/a>, but I can&#8217;t wait for it. It makes messages a first class object in the database. If you&#8217;ve ever had multiple processes banging on your database or you&#8217;ve ever used a flag on a row to indicate if it&#8217;s been processed or not, you want SQL Service Broker too.<\/p>\n<p>While there is huge disagreement as to exactly what &#8220;Service-Oriented Architecture&#8221; is, I think there is some general consensus around the fact that it is an asynchronous message driven model rather than a synchronous RPC model. This means that the thread you receive a message on will <i>never<\/i> be the same thread that you process the message on. In fact, typically you will write the message to a persistent data store (hello, Yukon native XML support) in order to be handled by a thread in a different process and probably on a different machine. Today, kicking off the thread to handle the message is a pain in the ass. You probably want lots of threads across lots of machines to handle the incoming messages (assuming you&#8217;re getting lots of incoming messages). In order to synchronize message processing across machines, you need a mechanism to make sure each incoming message is handled once and only once. Today, the closest solution is message queue technology like <a href=\"http:\/\/www.microsoft.com\/msmq\">MSMQ<\/a> (or <a href=\"http:\/\/www.ibm.com\/software\/integration\/mqfamily\/\">MQSeries<\/a>). However, since that&#8217;s a different data store from where the data lives (i.e. the database), now you need two phase distributed transactions to get that done. However, since messaging is going to be such a huge piece of architecture going forward, it makes sense to have the concept of messages baked right into the database.<\/p>\n<p>With Service Broker, when the message is received, it is placed into a service broker queue. (It&#8217;ll probably get stored for archival and retry avoidance reasons, but that&#8217;s a different blog entry.) Now I can have processes that, within the scope of a local transaction, receive the incoming message, make whatever data changes that message implies and send off any new messages. This is both more productive (manually handling local transactions for async processing is this kind of a scenario much easier than using serviced components) as well as more performant. <\/p>\n","excerpt":"<p>SQL Service Broker is probably the least known new feature of SQL Server &#8220;Yukon&#8221;, but I can&#8217;t wait for it. It makes messages a first class object in the database. If you&#8217;ve ever had multiple processes banging on your database or you&#8217;ve ever used a flag on a row to indicate if it&#8217;s been processed [&hellip;]<\/p>\n","date":"2003-12-09 15:39:29","modified":"2003-12-09 15:39:29","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2924,"name":"Benjamin Mitchell","url":"http:\/\/benjaminm.net","date":"2003-12-11 00:58:22","content":"<p>Good to see more information about the Service Broker.  I think many people are confused about the different approaches to messaging that Microsoft are offering and have collected information about the Yukon Service Broker and how it compares to Indigo and MSMQ in my post &#8216;More on the Microsoft Messaging message[1]&#8216;<br \/>\n[1] &#8211; <a href=\"http:\/\/benjaminm.net\/PermaLink.aspx?guid=dceab3fe-5eae-47e1-87a4-c795ca369d2d\" rel=\"nofollow\">http:\/\/benjaminm.net\/PermaLink.aspx?guid=dceab3fe-5eae-47e1-87a4-c795ca369d2d<\/a> <\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["974e04d8-30fe-44ba-9103-b8397a2c7b2e"],"dasblog_compressedtitle":["Delivering+Messages+With+SQL+Service+Broker"],"dasblog_compressedtitleunique":["2003\/12\/09\/Delivering+Messages+With+SQL+Service+Broker"]}},"previous_url":"http:\/\/devhawk.net\/2003\/12\/08\/my-techie-wife\/","next_url":"http:\/\/devhawk.net\/2003\/12\/09\/to-err-is-human\/"}