{"status":"ok","post":{"id":100,"type":"post","slug":"xml-infoset-vs-object-graphs","url":"http:\/\/devhawk.net\/2003\/05\/21\/xml-infoset-vs-object-graphs\/","status":"publish","title":"XML Infoset vs Object Graphs","title_plain":"XML Infoset vs Object Graphs","content":"<p>Following up on my <a href=\"PermaLink.aspx?guid=5643b052-f1f2-4c53-ac33-e33d0910f917\">XML is not a Deserialized Object Graph<\/a> post, I was thinking about entity classes from <a href=\"http:\/\/www.rational.com\/products\/rup\/index.jsp\">RUP<\/a>. The official definition (from the <a href=\"http:\/\/www.amazon.com\/exec\/obidos\/ASIN\/0201571692\/qid=1006990173\/sr=1-1\/ref=sr_1_10_1\/104-0359585-4441512\"> RUP manual<\/a>) for entity classes is: &#8220;An entity class is used to model information that is long-lived and often persistent&#8221; &#8211; i.e. stuff we&#8217;re going to stick in the database, XML files, etc. In weblog terms, entities are posts, comments, trackbacks, etc. In my experience, these entity classes have little business logic &#8211; mostly validation code. The code that will act on this entity are encapsulated within control classes. Control classes are tightly related to use cases. Typically, a one-to-one relationship between use case and control class is a good first order approximation. Again, in weblog terms, the &#8220;create post&#8221; use case would be implemented as a control class that takes an entity class instance and writes it to the persistent store (database, XML file, etc)<\/p>\n<p>If the vast majority of business logic goes into control classes while the entity classes are primarily data containers, why can&#8217;t we just go all the way and make our entity classes conform to the <a href=\"http:\/\/www.w3.org\/TR\/xml-infoset\/\">XML Infoset<\/a>? Expose them via XmlReader\/Writer or XPathNavigator (and some as yet undefined interface XPathUpdatable). This way we&#8217;ll have parity between the entity classes local to our application and the XML messages we send and receive as we interact with other web services. XML serialization attempts to do this by unifying everything as strongly typed objects. But I&#8217;d rather unify around infoset, since that&#8217;s what&#8217;s going to be consistent across platforms, vendors and technologies, rather than typing systems. <\/p>\n","excerpt":"<p>Following up on my XML is not a Deserialized Object Graph post, I was thinking about entity classes from RUP. The official definition (from the RUP manual) for entity classes is: &#8220;An entity class is used to model information that is long-lived and often persistent&#8221; &#8211; i.e. stuff we&#8217;re going to stick in the database, [&hellip;]<\/p>\n","date":"2003-05-21 17:33:41","modified":"2003-05-21 17:33:41","categories":[],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["58fc378e-7811-41dc-b950-0ee2b9096006"],"dasblog_compressedtitle":["XML+Infoset+Vs+Object+Graphs"],"dasblog_compressedtitleunique":["2003\/05\/22\/XML+Infoset+Vs+Object+Graphs"]}},"previous_url":"http:\/\/devhawk.net\/2003\/05\/20\/matrix-desktop-enhancements\/","next_url":"http:\/\/devhawk.net\/2003\/05\/23\/strongly-typed-wmi-and-ad-access\/"}