{"status":"ok","post":{"id":497,"type":"post","slug":"member-management-component-prototype","url":"http:\/\/devhawk.net\/2004\/12\/13\/member-management-component-prototype\/","status":"publish","title":"Member Management Component Prototype","title_plain":"Member Management Component Prototype","content":"<p>How about this for transparency? <\/p>\n<blockquote><p>The Microsoft ASP.NET v1.1 <a href=\"http:\/\/www.asp.net\/Default.aspx?tabindex=6&amp;tabid=41\">Membership Management Component Prototype<\/a> contains classes that allow a developer to more easily authenticate users, authorize users, and store per-user property data in a user profile. The authentication feature validates and stores user credentials which a developer can use to manage user authentication on a web site. The authorization feature lets you treat groups of users as a unit by assigning users to roles such as manager, sales, member, and so on. Combined with ASP.NET&#8217;s built-in authorization functionality, Windows Shared Hosting developers have end-to-end support for maintaining user-to-role mappings and authorizing users based on this information. The profile feature enables you to provide users of your Web site with a custom experience. By defining and using profile properties, you can track any custom information your application requires, including user information and user preferences. <\/p>\n<p><b>Important:<\/b> The functionality provided by this component is a preliminary version of the Membership, Roles, and Profile functionality coming in ASP.NET 2.0 and will change in the final release of ASP.NET 2.0. This means that any ASP.NET v1.1 applications you develop using this component will need to be updated when you migrate to the final release of ASP.NET 2.0. This is also a non Microsoft supported component.<\/p>\n<\/blockquote>\n<p>What I love about this the most is that it really reflects a change in mindset. In the past, I doubt we would have shipped this because it is likey to change before release. Personally, I like this approach &#8211; ship early and often and be honest about the quality and longevity. Sure, you have to deal with a few people who don&#8217;t read things like “will change“ or “not supported“ but the benefits outweigh the issues dramatically.<\/p>\n","excerpt":"<p>How about this for transparency? The Microsoft ASP.NET v1.1 Membership Management Component Prototype contains classes that allow a developer to more easily authenticate users, authorize users, and store per-user property data in a user profile. The authentication feature validates and stores user credentials which a developer can use to manage user authentication on a web [&hellip;]<\/p>\n","date":"2004-12-13 11:24:52","modified":"2004-12-13 11:24:52","categories":[{"id":204,"slug":"development","title":"Development","description":"","parent":0,"post_count":165}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2744,"name":"言情小说","url":"http:\/\/www.readnovel.com\/ch\/2.html","date":"2004-12-14 20:56:52","content":"<p>That question is not easy. Who can find a rather good resolution? If you can, tell me please.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["5eef8774-814a-4f1f-b446-eaf5a039d1b0"],"dasblog_compressedtitle":["Member+Management+Component+Prototype"],"dasblog_compressedtitleunique":["2004\/12\/13\/Member+Management+Component+Prototype"]}},"previous_url":"http:\/\/devhawk.net\/2004\/12\/12\/not-your-average-night-at-the-movies\/","next_url":"http:\/\/devhawk.net\/2004\/12\/13\/netcpu-netcpu\/"}