{"status":"ok","post":{"id":895,"type":"post","slug":"the-information-revolution-is-just-getting-started","url":"http:\/\/devhawk.net\/2007\/02\/23\/the-information-revolution-is-just-getting-started\/","status":"publish","title":"The Information Revolution Is Just Getting Started","title_plain":"The Information Revolution Is Just Getting Started","content":"<\/p>\n<p><em>(Harry is on a secret mission in uncharted space this week, so instead of the daily Morning Coffee post, you get a series of autoposted essays. As this post is about Web 2.0, it&#8217;s obviously from fairly old from his previous role @ Microsoft.<\/em><em>)<\/em><\/p>\n<p>A friend of mine is doing some research into Internet topics, including Web 2.0. After reading dozens of articles each with a different definition, she asked me to sum up Web 2.0 in thirty seconds or less.  <\/p>\n<p><em><strong>Web 2.0 is the latest evolution of our post-industrial society, driven primarily by the ubiquitous access of Internet connected computing devices.<\/strong><\/em><\/p>\n<p>Got it down to just one sentence and it only takes about fifteen seconds to say. The critical thing to notice about that statement is what it doesn’t include:  <\/p>\n<ul>\n<li>No mention of specific technology outside of “Internet” and “computing devices”. That means no acronym laden techno-babble such as AJAX, REST, SOAP or XML.  <\/li>\n<li>No mention of a specific platform or vendor. That means no references to Microsoft, Google, IBM, Yahoo, Sun or Apple. Likewise, there’s no mention of open source software projects like Linux, Apache or Ruby on Rails.  <\/li>\n<li>No mention of <a href=\"http:\/\/www.oreillynet.com\/pub\/a\/oreilly\/tim\/news\/2005\/09\/30\/what-is-web-20.html\">Tim O’Reilly’s principles of Web 2.0<\/a>. That means no web as platform, harnessing collective intelligence or the end of the software release cycle<\/li>\n<\/ul>\n<p>This isn’t to say these technologies, platform vendors and principles aren’t important. They are. However, they aren’t what are happening; they are only pieces of the bigger picture. Exploring these individually without understanding the larger context is like the <a href=\"http:\/\/en.wikisource.org\/wiki\/The_Blindmen_and_the_Elephant\">Blindmen and the Elephant<\/a>.  <\/p>\n<p>I’ve recently been reading Alvin Toffler’s <a href=\"http:\/\/www.toffler.com\/thetofflers\/books\/books_the_third_wave.shtml\">The Third Wave<\/a>. It’s fascinating to read a book about the future that was written twenty five years ago. His opinion is that the industrial age peaked in the mid 1950’s and that the post-industrial age has been building steam ever since. Not coincidently in my opinion, the late fifties saw the first transistor based computers as well as the earliest work on computer networking. It is because of this intertwined history that this post-industrial age is often called the Information Age.  <\/p>\n<p>While it’s been building for half a century, the Information Age is only just getting started when it comes to remaking society. Over the course of three centuries, the Industrial Age saw rise to societal concepts such as the nuclear family, the school system and the corporation. It created the role of the bureaucrat. It separated the producers and consumers, giving rise to the idea of the market. It changed our view of the universe by precisely defining units of time and space. It got its energy from non-renewable sources, such as fossil fuels. In short, the Industrial Age completely remade the world. The Information Age will have equally far reaching effects before it’s done. I believe Web 2.0 is the next step in this evolution.  <\/p>\n<p>Toffler identified six principles of the Industrial Age: Standardization, Specialization, Synchronization, Centralization, Maximization and Concentration. The relevance of each of these principles is dropping rapidly as we shift out the Industrial Age. For example, weblogs represent a massive de-centralization of the news media. Online retailers like Amazon.com replaced the standardized shopping experience with a personalized one. Digital video recorders and online video sharing sites eliminate the synchronization of broadcast TV.  <\/p>\n<p>For each principle of the Industrial Age, there are examples of Web 2.0 companies working against it.<\/p>\n","excerpt":"<p>(Harry is on a secret mission in uncharted space this week, so instead of the daily Morning Coffee post, you get a series of autoposted essays. As this post is about Web 2.0, it&#8217;s obviously from fairly old from his previous role @ Microsoft.) A friend of mine is doing some research into Internet topics, [&hellip;]<\/p>\n","date":"2007-02-23 08:53:23","modified":"2007-02-23 08:53:23","categories":[],"tags":[{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["0a9dc7db-77a4-4d8c-bf8b-f8dbd48b5686"],"dasblog_compressedtitle":["The+Information+Revolution+Is+Just+Getting+Started"],"dasblog_compressedtitleunique":["2007\/02\/23\/The+Information+Revolution+Is+Just+Getting+Started"]}},"previous_url":"http:\/\/devhawk.net\/2007\/02\/22\/morning-doughnuts-5\/","next_url":"http:\/\/devhawk.net\/2007\/02\/23\/the-always-on-internet\/"}