{"status":"ok","post":{"id":689,"type":"post","slug":"web-2-0-evolution","url":"http:\/\/devhawk.net\/2006\/02\/13\/web-2-0-evolution\/","status":"publish","title":"Web 2.0 Evolution","title_plain":"Web 2.0 Evolution","content":"<p>In his <a href=\"http:\/\/www.identity20.com\/\">now-famous talk<\/a>, <a href=\"http:\/\/blame.ca\/dick\/\">Dick Hardt<\/a> describes <a href=\"http:\/\/www.identity20.com\/\">Identity 2.0<\/a> as inevitable. As in &#8220;coming for sure, but not here yet&#8221;. I wonder how much of Web 2.0 is here now, and how much is inevitable? And furthermore, how much can we generalize about the future of Web 2.0 from what is happening now? As in many things, I think the answer isn&#8217;t black and white. <\/p>\n<p>For example, I think we can generalize about the bright future of peer-to-peer based technologies from looking at systems like <a href=\"http:\/\/www.skype.com\/\">Skype<\/a> and <a href=\"https:\/\/www.foldershare.com\/\">FolderShare<\/a>. Naturally, with the power shifting to the edge, I believe it&#8217;s inevitable for more edge machines to communicate directly with each other rather than being mediated by a service in the center. In fact, in many cases I believe were going to want to shift a significant percentage of social computing to the peer-to-peer model. It scales better and doesn&#8217;t have centralized privacy concerns. Furthermore, I think there may be be specific peer-to-peer capabilities that are difficult or impossible to replicate with a centralized model, though so far, I haven&#8217;t them yet. <\/p>\n<p>However, I&#8217;m not sure we can generalize about the future of mashups the same way. This isn&#8217;t to say I think mashups are going away &#8211; far from it. I just think that mashups a year from now will look very different than they do today. <\/p>\n<p>First off, I don&#8217;t think we can  generalize the success of Google Maps. In the <a href=\"http:\/\/www.programmableweb.com\/howto\">Programmable Web how to guide<\/a>, they mention that &#8220;Plotting markers on maps is probably the easiest place to start&#8221;. Apparently, many people are taking that advice because 297 of the <a href=\"http:\/\/www.programmableweb.com\/mashups\">411 mashups listed<\/a> use one of the three major (i.e. GYM) mapping services. However, maps are unique because of the massive amount of data, the extremely simple API and the ubiquity of location information. They are also one of the few mashup API&#8217;s that runs in the browser &#8211; the vast majority of mashup API&#8217;s are back end data type services like <a href=\"http:\/\/www.amazon.com\/gp\/browse.html\/ref=sc_fe_l_2\/102-5580662-4480110?_encoding=UTF8&amp;node=12738641&amp;no=14256891&amp;me=A36L942TSJ2AJA\">Amazon&#8217;s E-Commerce Service<\/a>. How many more in-browser <a href=\"http:\/\/www.programmableweb.com\/apis\">mashup API&#8217;s<\/a> are out there waiting to be built? I&#8217;m not sure, but as I wrote in <a href=\"http:\/\/devhawk.net\/2006\/02\/03\/Browser+As+Virtual+Machine.aspx\">Browser as VM<\/a>, the problem with these in-browser mashup API&#8217;s is that you can&#8217;t protect your IP. <\/p>\n<p>As for back-end service mashup APIs, there needs to be a way for these service providers to make money. Even if the software they use to build the service is free, things like hardware and bandwidth are not. For an Amazon or Ebay, making money on thier services is relatively easy since they are facilitating sales transactions. In the end, they probably won&#8217;t care much if a sales transaction originated on their site or on a site leveraging their APIs. However, if the service provider is ad-funded, the service API effectively routes around the site&#8217;s revenue mechanism. Take, for example, a site for tracking events like <a href=\"http:\/\/www.zvents.com\/\">Zvents<\/a>, <a href=\"http:\/\/eventful.com\/\">Eventful<\/a> or <a href=\"http:\/\/upcoming.org\/\">Upcoming<\/a>. They need to drive users to the actual site in order to drive revenue. So it remains to be seen exactly how the API based access is going to work out. Today, these API&#8217;s are specifically provided for &#8220;non-commercial use only&#8221; so one way would be to charge for access via the API (either flat-rate subscription, a per-use charge or a combination of the two). Alternatively, they could be bought up by a larger company who could then afford to run the business at a loss. Yahoo already bought Upcoming and Google Base already has an event item type, but the other big companies in this space (I&#8217;d guess Microsoft, Amazon, Ebay and maybe Apple) might be interested. Again, I&#8217;m not sure how this evolves either, but it&#8217;s got to evolve beyond &#8220;non-commercial access&#8221;.<\/p>\n","excerpt":"<p>In his now-famous talk, Dick Hardt describes Identity 2.0 as inevitable. As in &#8220;coming for sure, but not here yet&#8221;. I wonder how much of Web 2.0 is here now, and how much is inevitable? And furthermore, how much can we generalize about the future of Web 2.0 from what is happening now? As in [&hellip;]<\/p>\n","date":"2006-02-13 11:39:21","modified":"2006-02-13 11:39:21","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["0e02c2eb-c4c1-471c-aa30-f86a22bcfe07"],"dasblog_compressedtitle":["Web+20+Evolution"],"dasblog_compressedtitleunique":["2006\/02\/13\/Web+20+Evolution"]}},"previous_url":"http:\/\/devhawk.net\/2006\/02\/11\/dennis-miller-has-jumped-the-shark\/","next_url":"http:\/\/devhawk.net\/2006\/02\/13\/the-next-mainstream-programming-language\/"}