{"status":"ok","post":{"id":718,"type":"post","slug":"the-so-called-attention-economy","url":"http:\/\/devhawk.net\/2006\/03\/08\/the-so-called-attention-economy\/","status":"publish","title":"The So-Called Attention Economy","title_plain":"The So-Called Attention Economy","content":"<p>I’m just going to come right out and say I don’t “get” this attention economy. I mean, I understand the problem of information overload which seems to be at the root of this attention stuff. But is it an economy? Whenever someone gets going on attention economy, I think back to the .com days and wonder if anyone ever called that a “traffic economy”. It’s more like the next generation of productivity – Productivity 2.0 if you will. If Productivity 1.0 was about information at your fingertips (to steal an old piece of Microsoft marketing hype), then Productivity 2.0 is about noise filtration. It’s a natural outgrowth of making so much information digitally available. But it’s not an economy.<\/p>\n<p>Today there were to keynotes explicitly about the attention economy. Seth Goldstein is from a company called <a href=\"http:\/\/root.net\/\">Root<\/a>, which is one of these so called attention economy applications. It actually seems to have a lot in common with <a href=\"http:\/\/devhawk.net\/2006\/03\/08\/Felix+Miller+On+The+Musical+Myware.aspx\">Felix’s myware idea<\/a>. Basically, it tracks what you pay attention to and uploads it to a central server. I get why <a href=\"http:\/\/last.fm\">last.fm<\/a> wants my music attention data, because there’s value in aggregating it with other users. But I don’t get how general purpose attention data can be aggregated in such a way that I would consider posting it to some server some where. If I spent two hours surfing Flickr last week, shouldn’t that data be local on my machine (where said surfing occurred) and not up on some server that’s out of my control.<\/p>\n<p>Later we had David Sifry on the Economic Model of Attention. Most of what David talked about I agree with, but I again I don’t appear to draw the same conclusions. Sure, time is scarce and perishable. But I don’t buy that it’s currency. Besides, any economic “model” that claims money isn’t scarce seems fishy to me.<\/p>\n<p>As I said, I don’t get this attention economy stuff.<\/p>\n","excerpt":"<p>I’m just going to come right out and say I don’t “get” this attention economy. I mean, I understand the problem of information overload which seems to be at the root of this attention stuff. But is it an economy? Whenever someone gets going on attention economy, I think back to the .com days and [&hellip;]<\/p>\n","date":"2006-03-08 00:02:41","modified":"2006-03-08 00:02:41","categories":[],"tags":[{"id":297,"slug":"etech","title":"ETech","description":"","post_count":15},{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2329,"name":"Alex Barnett","url":"http:\/\/blogs.msdn.com\/alexbarn","date":"2006-03-08 12:40:29","content":"<p>I agree with you Harry, that the &#8216;Attention Economy&#8217; is not an economy.  My opinion is that users aren&#8217;t interested is selling their data to customers for $. I wrote more on this here: <a href=\"http:\/\/blogs.msdn.com\/alexbarn\/archive\/2006\/01\/11\/511690.aspx\" rel=\"nofollow\">http:\/\/blogs.msdn.com\/alexbarn\/archive\/2006\/01\/11\/511690.aspx<\/a><\/p>\n<p>On the point you make re: having stuff on a server: there is one advantage to this &#8211; I roam. Having email in the cloud (and on local client) rather than *just* on the client is better, no? Having my attention data out in the cloud makes like easier. The question you raise re: data privacy \/ and management of subsets of this data by the user should be in the users control is a key point. But do they care where this data &#8216;lives&#8217;? If it works, is secure and is in their control, do they care?<\/p>\n<p>Re: other forms of &#8216;attention data&#8217; that may be useful to have services key off: one powerful type attention data is my OPML file. Services such as Megite.com, Findory and others are starting to provide personalized views based on this data. They are more than just RSS aggreagtors they&#8217;re really becoming attention filters. If you&#8217;ve got 5 mins before you rush out of the door and want a quick, relevant snapshot of whats going being going on, this is a great tool. Think: Personalized Memeorandum. I did a screencast to show: <a href=\"http:\/\/blogs.msdn.com\/alexbarn\/archive\/2006\/02\/17\/533949.aspx\" rel=\"nofollow\">http:\/\/blogs.msdn.com\/alexbarn\/archive\/2006\/02\/17\/533949.aspx<\/a><\/p>\n<p>What other types of attention data will these services be able to refer to to provide yet more relevant experierences?<\/p>\n<p>Any way, more of my attention throughts here: <a href=\"http:\/\/blogs.msdn.com\/alexbarn\/articles\/510483.aspx\" rel=\"nofollow\">http:\/\/blogs.msdn.com\/alexbarn\/articles\/510483.aspx<\/a><\/p>\n<p>Alex.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["476cdd3e-fa4b-46d8-b3e5-5d801bd4c9e9"],"dasblog_compressedtitle":["The+SoCalled+Attention+Economy"],"dasblog_compressedtitleunique":["2006\/03\/08\/The+SoCalled+Attention+Economy"]}},"previous_url":"http:\/\/devhawk.net\/2006\/03\/07\/felix-miller-on-the-musical-myware\/","next_url":"http:\/\/devhawk.net\/2006\/03\/08\/assorted-remaining-etech-day-two-keynotes-sessions\/"}