[
  {
    "id": 2867,
    "author-name": "Tomas Restrepo",
    "author-email": "tomasr@mvps.org",
    "author-url": "http://www.winterdom.com/weblog",
    "date": "2005-11-08T03:09:35-08:00",
    "content": "Well, to me the UML diagrams are just a tool, a means to an end, but not the end itself. They are very nice to quickly visualize and start thinking about the relationships in the code and it's behavior, but there comes a moment at which code is just so much better at it that it might not be useful to keep synching them by hand. \n\nWhat I mean is that, at that point, the UML diagrams become useful as a visualization tool, and no longer as useful as a design tool (though by no means useless); and that's where model generation from code becomes far more interesting.",
    "parent-id": 649,
    "RowKey": "20051108-030935"
  },
  {
    "id": 2868,
    "author-name": "CatoTheElderII",
    "author-email": "jefffee@yahoo.com",
    "author-url": "",
    "date": "2005-11-09T14:39:36-08:00",
    "content": "I think what they are saying is that you should use the UML at first to design the system, but since UML tools do not do a good job of making it easy to keep code and UML models in synch you get to a point where the maintenance is no longer worth the benefit, and therefore they toss the UML models in the trash after that point is reached.  There would be no point in keeping them unless you intend to keep them up to date with the code, and since that becomes very burdensome after a while, it is more economical to throw them away.  This, of course, has nothing to do with wether or not UML models are useful, of course they are.  It has everything to do with the failure of the tools to provide an easy means of syncrhonizing code and models.  Makes sense to me.  If the tools vendors make the link then you will find the \"throw them away\" rule abandonned and people will then say, \"Keep them\".   That's my take.",
    "parent-id": 649,
    "RowKey": "20051109-143936"
  },
  {
    "id": 2869,
    "author-name": "Peter Provost",
    "author-email": "peter@provost.org",
    "author-url": "http://www.peterprovost.org/",
    "date": "2005-11-12T15:21:48-08:00",
    "content": "If Code-Is-Model is really an accurate statement, then throwing away the non-code model (the UML) is a completely legitimate thing to do as soon as it loses its value or gets in the way of maintaining the model that matters (the code).\n\nI think Grady's point here (I wasn't there) had to be something like this: Use a UML model (or whatever other high abstraction language you choose) when it has value and throw it away the moment it gets in your way or become an intolerable tax on your project.\n\nThis is why I've always felt that all \"code-as-model\" modeling tools should use the code as the serialization format for the model. This is what the old Together tool did and that is why people liked it so much. The UML was just a way to visualize your code. There was no such thing as round tripping because there was only one thing...\n\nThe code.",
    "parent-id": 649,
    "RowKey": "20051112-152148"
  }
]