{"status":"ok","post":{"id":709,"type":"post","slug":"etech-day-one","url":"http:\/\/devhawk.net\/2006\/03\/07\/etech-day-one\/","status":"publish","title":"ETech Day One","title_plain":"ETech Day One","content":"<p>Of course, I my copious notes are on my dead laptop, so this is all from memory. Granted, it was only yesterday and my memory isn&#8217;t THAT bad (yet).<\/p>\n<p><strong><u>Rael Dornfest on the Attention Economy<\/u><br \/><\/strong>You know the old saying if you can&#8217;t say something nice, don&#8217;t say anything at all? The one thing I will say is that it felt like a sales pitch to come to the conference. Given that we we&#8217;re already there, it seemed like an odd choice. I&#8217;ll have more about Attention Economy with my post on today&#8217;s sessions.<\/p>\n<p><strong><u>Tim O&#8217;Reilly on O&#8217;Reilly Radar<\/u><br \/><\/strong>Tim had (not surprisingly) a bunch of interesting things to talk about. Probably the most interesting was the stuff about <a href=\"http:\/\/radar.oreilly.com\/archives\/2006\/03\/bionic_software_1.html\">Bionic Software<\/a> which Tim describes as a system &#8220;that combines the biological and mechanical systems to create an enhanced system that is more powerful than either alone.&#8221; He described this as Intelligence Augmentation, instead of Artificial Intelligence. Bruce Sterling later talked about the importance of how things are named, and IA over AI is a great example of that. <\/p>\n<p>However, Tim also went on at great length about the <a href=\"http:\/\/www.oreillynet.com\/pub\/a\/oreilly\/tim\/articles\/architecture_of_participation.html\">architecture of participation<\/a> and <a href=\"http:\/\/www.oreillynet.com\/pub\/a\/oreilly\/tim\/news\/2005\/09\/30\/what-is-web-20.html?page=2\">harnessing collective intelligence<\/a>. He&#8217;s given many examples of these, however I&#8217;m wondering if he&#8217;s over generalizing based on a few success stories. Companies like Amazon and Ebay are successful because they&#8217;re in the middle of financial transactions. Google&#8217;s been able to monetize the long tail of search to an amazing degree, but the growth of that market is slowing and Google has been unable to significantly monetize any of their other efforts (so far, though I doubt that trend will continue). Sites like del.icio.us and Flickr are great, but I don&#8217;t see evidence of a business plan outside of &#8220;get acquired&#8221;. On the <a href=\"http:\/\/del.icio.us\/about\/info\">del.icio.us about page<\/a>, it specifically says that del.icio.us started as a hobby. Granted, hosting costs these days are such that you can run a hobby site for nearly nothing and cover that cost with Google Ads. But as a business, if there&#8217;s only a few business success stories, why place the importance on the crowd&#8217;s wisdom?<\/p>\n<p><strong><u>Bruce Sterling on The Internet of Things<br \/><\/u><\/strong>I couldn&#8217;t do this talk justice even with my notes, so here are a couple of things that stood out:<\/p>\n<ul>\n<li>The guy introducing Bruce was a little to lavish with his praise. It was actually a little creepy. Bruce even remarked on it.\n<\/li>\n<li>I wish Bruce hadn&#8217;t read so many quotes from other people. It was hard to follow when he was providing his own opinions or someone else&#8217;s. He didn&#8217;t use many slides (yeah!) and the ones he did use didn&#8217;t have bullets (even better!) but when he&#8217;s quoting someone else, I think it makes sense to put the words up on a slide.\n<\/li>\n<li>He seemed to alternate between praising and disrespecting the crowd in the room. For example, he commented that &#8220;hype is an attention interrupt&#8221; which seems validate the work of many Web 2.0 companies even though so many people dismiss it as hype. However, he also made the comment that Web 2.0 was an effort by alpha geeks to wrest control of the web back.\n<\/li>\n<li>The main thrust of his talk was about applying Internet concepts like sorting and searching to the real world by creating links between real-world items and virtual counterparts. So you would never lose your keys again because you could easily Google them. I need to pick up his latest book &#8220;Shaping Things&#8221; for the flight home &#8211; it&#8217;s not like I&#8217;ll be using my computer. <\/li>\n<\/ul>\n<p>Stick around, I&#8217;ll be posting my thoughts on today&#8217;s session a little later.<\/p>\n","excerpt":"<p>Of course, I my copious notes are on my dead laptop, so this is all from memory. Granted, it was only yesterday and my memory isn&#8217;t THAT bad (yet). Rael Dornfest on the Attention EconomyYou know the old saying if you can&#8217;t say something nice, don&#8217;t say anything at all? The one thing I will [&hellip;]<\/p>\n","date":"2006-03-07 20:31:45","modified":"2006-03-07 20:31:45","categories":[],"tags":[{"id":297,"slug":"etech","title":"ETech","description":"","post_count":15},{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2327,"name":"Norman","url":"http:\/\/thinktone.wordpress.com","date":"2006-03-07 22:21:28","content":"<p>Borders in the Gaslamp area (about 4 blks from hotel) appears to have at least one copy of the Shaping Things book in stock.<\/p>\n<p>I will admit a certain degree of disappointment in ETECH. It feels like a conference that is more impressed with itself than actually illuminating ideas for the attendees. The overall staging is pretty poor as well. Not free-for-all as an unconference but not nearly at the standards I would expect for the amount of money paid.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["49a936d6-e997-4edc-8bee-f958c024cbef"],"dasblog_compressedtitle":["ETech+Day+One"],"dasblog_compressedtitleunique":["2006\/03\/08\/ETech+Day+One"]}},"previous_url":"http:\/\/devhawk.net\/2006\/03\/07\/my-dead-laptop\/","next_url":"http:\/\/devhawk.net\/2006\/03\/07\/etech-day-two\/"}