{"status":"ok","post":{"id":369,"type":"post","slug":"teched-days-2-3","url":"http:\/\/devhawk.net\/2004\/05\/27\/teched-days-2-3\/","status":"publish","title":"TechEd Days 2 &#038; 3","title_plain":"TechEd Days 2 &#038; 3","content":"<p>After the first two days left me in a daze, I&#8217;ve been taking it as easy as I can. Most of my time during the day has been spent in the cabaña where the couches are <i>very<\/i> comfy. Of course, time in the cabaña isn&#8217;t exactly &#8220;taking it easy&#8221; &#8211; we may have less traffic than the Dev and Office cabañas on either side, but there are still lots of attendees to sit down and chat about architecture with. I&#8217;ve had several fascinating discussions about SOAP-enabling building control systems (HVAC, Access control, lighting, etc) with the chair of the <a href=\"http:\/\/www.oasis-open.org\/committees\/tc_home.php?wg_abbrev=obix\">Open Building Information Exchange (oBIX) OASIS Technical Committee<\/a>. <\/p>\n<p>Tuesday night was laid back &#8211; dinner @ the hotel pub and a relatively early night. Last night I went to the Office party @ the Hard Rock Cafe. There were a bunch of guys who had come to the Road Rally on Sunday so we hung out for quite a while drinking and talking architecture. Tonight is the big attendee party @ Sea World. I assume it will be much like the attendee party @ PDC &#8211; mostly drinking beer and talking w\/ other attendees.<\/p>\n<p>My final presentation is in 45 minutes as I type this &#8211; Data in Service Oriented Architecture. So far, my scores for the sessions I did Monday are pretty good. The Metropolis overview scored ~7.6 out of 9 and the Metropolis Discussion a ~6.8. These keep changing since the eval systems stay open until the end of the conference. Given the craziness with the last-minute speaker change, I&#8217;m OK with those scores. They give us access to all the anonymous raw scores and comments which is great for improving my performance in later sessions. For example, apparently I spoke too fast on Monday (hey, I was nervous!) so I&#8217;ll be specifically working on that today. <\/p>\n<p>Of course, you can&#8217;t keep everyone happy all the time. A few members commented that they didn&#8217;t like the Metropolis analogy. Apparently, someone who didn&#8217;t like the Metropolis Overview also showed up for the Metropolis Discussion, still didn&#8217;t like it and commented we should &#8220;get off&#8221; the analogy. Why you would show up for the discussion if you didn&#8217;t like the overview? I&#8217;ve also seen several comments that the Architecture track has no code. Not sure how to address that since the lack of code is by design! Of course, such growing pains are to be expected for our first time at TechEd. <\/p>\n","excerpt":"<p>After the first two days left me in a daze, I&#8217;ve been taking it as easy as I can. Most of my time during the day has been spent in the cabaña where the couches are very comfy. Of course, time in the cabaña isn&#8217;t exactly &#8220;taking it easy&#8221; &#8211; we may have less traffic [&hellip;]<\/p>\n","date":"2004-05-27 14:50:44","modified":"2004-05-27 14:50:44","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":213,"slug":"community","title":"Community","description":"","post_count":81}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["ee744c12-35c8-42af-86db-c7de680a53f7"],"dasblog_compressedtitle":["TechEd+Days+2+3"],"dasblog_compressedtitleunique":["2004\/05\/27\/TechEd+Days+2+3"]}},"previous_url":"http:\/\/devhawk.net\/2004\/05\/25\/apparently-nagging-works\/","next_url":"http:\/\/devhawk.net\/2004\/05\/28\/teched-day-4\/"}