{"status":"ok","post":{"id":327,"type":"post","slug":"learning-in-the-hell-of-content-repurposing","url":"http:\/\/devhawk.net\/2004\/03\/09\/learning-in-the-hell-of-content-repurposing\/","status":"publish","title":"Learning in the Hell of Content Repurposing","title_plain":"Learning in the Hell of Content Repurposing","content":"<p>I spent yesterday in content repurposing hell. As part of my community role, I&#8217;m pushing for making as much content available in as many different channels as possible. However, right now, repurposing content for the different channels is handled with an expensive and time consuming manual process. Want a new publishing channel, we need a new manual processes to repurpose the content for it. <\/p>\n<p>Of course, one of the reasons for this is that the data formats used by these programs are proprietary. Even in places where there is a standard, the files don&#8217;t all follow it exactly. For example, I&#8217;m having issues converting a bunch of EPS files to JPG. According to <a href=\"http:\/\/www.ghostscript.com\/\">Ghostscript<\/a>, the files have several structuring errors which is making it difficult to open in other programs. Plus, much of this content was authored on a Mac, so trying to bring things like fonts over to PC is a major pain. It doesn&#8217;t look like any of the XML or web services standardization work has crossed over into content production or graphic design. <\/p>\n<p>However, there is a more fundamental reason that all these processes are manual &#8211; <i>they weren&#8217;t designed any other way<\/i>! Automatic process doesn&#8217;t happen by accident, it needs to be explicitly designed. So while having open data formats would make it easier to go in after the fact, it&#8217;s no substitute for designing the process from the start.  <\/p>\n<p>Going forward, I&#8217;m going to explicitly design a multi-channel publishing process for my different content types. The analogy to enterprise software is obvious &#8211; explicitly design your process for automation and extensibility. It won&#8217;t happen any other way.<\/p>\n","excerpt":"<p>I spent yesterday in content repurposing hell. As part of my community role, I&#8217;m pushing for making as much content available in as many different channels as possible. However, right now, repurposing content for the different channels is handled with an expensive and time consuming manual process. Want a new publishing channel, we need a [&hellip;]<\/p>\n","date":"2004-03-09 10:11:47","modified":"2004-03-09 10:11:47","categories":[],"tags":[{"id":213,"slug":"community","title":"Community","description":"","post_count":81}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["903afb72-e67e-4592-b631-0a9edb383bfe"],"dasblog_compressedtitle":["Learning+In+The+Hell+Of+Content+Repurposing"],"dasblog_compressedtitleunique":["2004\/03\/09\/Learning+In+The+Hell+Of+Content+Repurposing"]}},"previous_url":"http:\/\/devhawk.net\/2004\/03\/04\/misery-loves-company\/","next_url":"http:\/\/devhawk.net\/2004\/03\/09\/looking-for-spsynd-volunteers\/"}