{"status":"ok","post":{"id":469,"type":"post","slug":"cant-sleep-long-election-analysis-post","url":"http:\/\/devhawk.net\/2004\/11\/03\/cant-sleep-long-election-analysis-post\/","status":"publish","title":"Can&#8217;t Sleep &#8211; Long Election Analysis Post","title_plain":"Can&#8217;t Sleep &#8211; Long Election Analysis Post","content":"<p>I&#8217;ll be honest &#8211; I started Election Day feeling cautiously optimistic. Obviously, that feeling as been proved way, way wrong. Now, its 2:30am, I can’t sleep so I’ve been futzing with Excel and written a following long piece on voting tendencies of different age groups.<\/p>\n<p>Regardless of the eventual outcome in Ohio (which I am most certainly <i>not<\/i> optimistic about) Bush has won the popular vote hands down &#8211; by a significantly larger margin than he lost it in 2000. Any way you slice that, it&#8217;s bad for Democrats. Even if Kerry wins Ohio &#8211; and the election &#8211; he faces a hostile Republican majority in the Congress without a national mandate and an increasingly conservative media ready to crucify him at any turn. On the other hand, if Bush wins Ohio &#8211; as I expect will happen eventually &#8211; then we get four &#8220;more of the same&#8221; years &#8211; and the last four year were no picnic. And either way, the likely two week delay in processing Ohio&#8217;s provisional ballots further divides what is an already polarized electorate.<\/p>\n<p>Right now, going back to blissful ignorance of politics is looking mighty tempting. But I won’t do it. Instead, I want to get more involved in issues I care about in order to affect change. For example, one thing I&#8217;d like to see in the coming years is the election reform. I&#8217;m not talking about abandoning the Electoral College &#8211; which isn’t going to happen w\/o a constitutional amendment that has almost zero chance of passing. I’m talking about the changing the low voter turnout that has plagued American elections for decades. Final results won’t be in for a while, what with provisional and absentee ballots, but according to CNN’s current numbers, around 110 million votes have been tabulated, with 95% of the precincts reporting. That means there were around 116 million votes cast (plus the absentee and provisional votes that haven’t been counted yet). However, the US population is <a href=\"http:\/\/factfinder.census.gov\/home\/saff\/main.html?_lang=en\">estimated by the Census Bureau<\/a> to be around 295 million. Excluding the <a href=\"http:\/\/factfinder.census.gov\/servlet\/QTTable?_bm=y&amp;-geo_id=01000US&amp;-qr_name=DEC_2000_SF1_U_QTP1&amp;-ds_name=DEC_2000_SF1_U&amp;-redoLog=false&amp;-_sse=on\">estimated<\/a> 25.7% of the population that is under 18, that leaves nearly 219 million potential voters. Even with this year’s record turnout, we’ve only managed to include 53% of the country in the voting process (maybe low 60’s after with the yet-to-be-counted ballots). While I understand it’s every citizen’s duty to vote, it’s the government’s duty to enable the citizens to do their duty. We should treat the turnout as a grade, and 53% is a failure.<\/p>\n<p>I don’t expect election reform to be a priority of a Republican administration or congress, as conventional wisdom states that larger turnout favors Democrats. Of course, this election’s results fly directly in the face of that idea. However, there are those blogs I read that <a href=\"http:\/\/www.talkingpointsmemo.com\/archives\/003925.php\">have suggested<\/a> that Kerry lost the popular vote because the “much-ballyhooed youth vote simply did not show up”. I thought this too – until I ran the numbers. <\/p>\n<p>The most underrepresented age group in the election (according to the <a href=\"http:\/\/www.cnn.com\/ELECTION\/2004\/pages\/results\/states\/US\/P\/00\/epolls.0.html\">national exit poll<\/a>) was 18-29 years olds – 22% of the voting age population yet only 17% of the voters in the exit poll. And that group overwhelmingly favored Kerry 54%-44%. By comparison, people 60 and older are also around 22% of the voting population but represented 25% of the voters. Not surprisingly, that group favored Bush 53%-46%. However, it’s interesting to note that if the voter turnout age distribution had matched the actual census distribution, Bush would still have won the popular vote 49.6% to 48.8%. In the census-adjusted model, Kerry is negatively effected by the 30-44 age group, that favored Bush by four points and were under represented in the exit polls – 32% of the voting population but only 28% of voters. <\/p>\n<p>(In fairness, the exit poll isn’t completely accurate – based on the voting turnout age distribution, it estimated a 50% &#8211; 48.5% Bush popular vote win and we know Bush won by a wider margin than that. Furthermore, as we are accutely aware, popular vote doesn&#8217;t win the presendency and given the closeness of several state races, the youth vote might have shifted the Electoral College in Kerry’s favor.)<\/p>\n<p>I’d like to do more analysis of this exit poll data. There were certain questions that I think are fascinating. For example, 43% of people thought things are going well in Iraq, and 90% of them voted for Bush. 52% of people thought things are going badly, and 82% of them voted for Kerry. Given that people perception of Iraq is directly effected by the media reporting, it becomes fairly obviously the dramatic role that the media plays in our elections. So there’s another issue for me to get involved in – undoing the damage of media consolidation. <\/p>\n<p>But for now, I’m going to <i>try<\/i> and sleep.<\/p>\n","excerpt":"<p>I&#8217;ll be honest &#8211; I started Election Day feeling cautiously optimistic. Obviously, that feeling as been proved way, way wrong. Now, its 2:30am, I can’t sleep so I’ve been futzing with Excel and written a following long piece on voting tendencies of different age groups. Regardless of the eventual outcome in Ohio (which I am [&hellip;]<\/p>\n","date":"2004-11-03 03:47:10","modified":"2004-11-03 03:47:10","categories":[{"id":219,"slug":"politics","title":"Politics","description":"","parent":0,"post_count":41}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2707,"name":"Rod","url":"http:\/\/www.rodtempleton.net","date":"2004-11-03 08:48:57","content":"<p>While it would never fly in North America, perhaps the U.S. (and Canada, too, I must admit), should look at going the way Australia holds its elections.  Voting is not a right.  Voting is *mandatory*.  If you don&#8217;t vote, you are hit with either a fine or time as a guest of the crown.<\/p>\n","parent":0},{"id":2708,"name":"Steve","url":"","date":"2004-11-03 11:18:02","content":"<p>&#8220;While I understand it’s every citizen’s duty to vote, it’s the government’s duty to enable the citizens to do their duty. We should treat the turnout as a grade, and 53% is a failure.&#8221;<\/p>\n<p>That&#8217;s a faithful Democrat.  Blame the government for people&#8217;s apathy.  Yeah, it&#8217;s Bush&#8217;s fault people don&#8217;t bother to get off their butt and vote.<\/p>\n<p>The Republican party advocates personal responsibility.  Your actions are no one&#8217;s fault but your own.<\/p>\n<p>I&#8217;m not celebrating the low turnout (I&#8217;m certainly celebrating the Bush win and Daschel loss though), I wish everyone legally eligible would vote.  I think it&#8217;s kinda cool that Australia has a mandatory vote but I really don&#8217;t think you can hold the governement responsible for these lame voter turnouts.<\/p>\n","parent":0},{"id":2709,"name":"DevHawk","url":"","date":"2004-11-03 12:41:26","content":"<p>Steve, I&#8217;m not sure where in my post that I said it was &#8220;Bush&#8217;s fault&#8221; or that I &#8220;blamed the goverment for people&#8217;s apathy&#8221;. I was trying to say (note it was almost 3am when I wrote this) that we shouldn&#8217;t be proud of a 58%-60% turnout (estimates have come in since I originally posted). Goverment shouldn&#8217;t be blamed, but it should be thinking of ways to get that number higher.<\/p>\n<p>My comment about voter reform not being a Republican priority was the introduction to my investigation of the conventional wisdom of large turnout favoring Democrats. Honestly, I doubt a 100% voter turnout would have changed the outcome of the popular vote (which is all I looked at). <\/p>\n<p>Do you?<\/p>\n","parent":0},{"id":2710,"name":"Steve","url":"","date":"2004-11-03 14:15:32","content":"<p>Oh, now I understand.  When you said:<\/p>\n<p>&#8220;While I understand it’s every citizen’s duty to vote, it’s the government’s duty to enable the citizens to do their duty. We should treat the turnout as a grade, and 53% is a failure.&#8221; <\/p>\n<p>I took it that since you were saying &#8220;it&#8217;s the government&#8217;s duty&#8221; you were also saying that the government failed.  In fact, it sounds like you meant the people failed.  As the grammar challenged youths of today would say &#8220;My bad.&#8221;  <\/p>\n<p>I think it sucks that nearly half the population didn&#8217;t vote.  I have at least one friend that isn&#8217;t even registered and I&#8217;m pretty annoyed with him.<\/p>\n<p>I don&#8217;t know if voter reform is or is not a republican priority.  I don&#8217;t think I&#8217;ve heard anyone talk about it from either party.  We all lament the low turnout but I&#8217;ve never really heard any politician suggest a government solution.  Maybe we need tax cuts for voters &#8211; that would be more palatable than Australia&#8217;s fines.<\/p>\n<p>I would agree, based on the popular vote distribution with 60% turnout I tend to think 100% turnout would still give the election to Bush.  <\/p>\n","parent":0},{"id":2711,"name":"DevHawk","url":"","date":"2004-11-03 14:38:43","content":"<p>No worries &#8211; I did write this at 3am so I wasn&#8217;t exactly at my best at explaining my meaning.<\/p>\n","parent":0}],"attachments":[],"comment_count":5,"comment_status":"closed","custom_fields":{"dasblog_entryid":["8ee683d6-94ff-4d0f-882f-73ba780ad3d5"],"dasblog_compressedtitle":["Cant+Sleep+Long+Election+Analysis+Post"],"dasblog_compressedtitleunique":["2004\/11\/03\/Cant+Sleep+Long+Election+Analysis+Post"]}},"previous_url":"http:\/\/devhawk.net\/2004\/10\/31\/horror-stories-for-halloween\/","next_url":"http:\/\/devhawk.net\/2004\/11\/03\/at-least-its-over\/"}