{"status":"ok","post":{"id":799,"type":"post","slug":"stateless-stateless","url":"http:\/\/devhawk.net\/2006\/09\/20\/stateless-stateless\/","status":"publish","title":"Stateless != Stateless","title_plain":"Stateless != Stateless","content":"<p>A while back, I blogged that <a href=\"http:\/\/devhawk.net\/2006\/07\/27\/Services+Arent+Stateless.aspx\">Services Aren&#8217;t Stateless<\/a>, in response to some stuff in Thomas Erl&#8217;s <a href=\"http:\/\/www.soabooks.com\/chapters2.asp\">latest book<\/a>. At the time, I mentioned that I was looking forward to discussing my opinions with <a href=\"http:\/\/www.thomaserl.com\/\">Erl<\/a> when I attended his <a href=\"http:\/\/www.soasystems.com\/events151.asp\">workshop<\/a>. I&#8217;ve spent the last two days at said workshop. I&#8217;ll have a full write-up on the workshop later this week, but I wanted to blog the resolution to this stateless issue right away.<\/p>\n<p>At the time, I wrote &#8220;I assume Erl means that service should be stateless in the same way HTTP is stateless.&#8221; Turns out, my assumption was way way wrong. When he addressed this topic in his workshop, he started by talking about dealing with concurrency and scalability, which got me confused at first. Apparently, when Erl says stateless, he&#8217;s referring to minimizing memory usage. That is, don&#8217;t keep service state in memory longer than you need to. So <a href=\"http:\/\/devhawk.net\/2006\/08\/16\/Business+Processes+Are+Services+Too.aspx\">all the stuff about activity data<\/a>, that&#8217;s all fine as per Erl&#8217;s principles, as long as you write it out to database instead of keeping it in memory. In his book, he talks about the service being &#8220;temporarily stateful&#8221; while processing a message. When I read that, I didn&#8217;t get it &#8211; because I was thinking of the HTTP definition of stateless &amp; stateful. But if we&#8217;re just talking about raw memory usage, it suddenly makes sense. <\/p>\n<p>On the one hand, I&#8217;m happy to agree 100% with Erl on another of his principles. Frankly, much of what he talked about in his workshop seems predicated on unrealistic organizational behavior and offer at best unproven promises of cost and time savings in the long run via black box reuse. So to be in complete agreement with him on something was a nice change of pace. Thomas is much more interested in long-running and async services than I originally expected when I first flipped thru his book.<\/p>\n<p>On the other hand, calling this out as a &#8220;principle of service orientation&#8221; hardly seems warranted. I mean, large scale web sites have been doing this for a long time and <a href=\"http:\/\/msdn2.microsoft.com\/en-us\/library\/ms178586.aspx\">SQL Session State<\/a> support has been a part of ASP.NET since v1. Furthermore, using the term &#8220;stateless&#8221; in this way is fundamentally different from the way HTTP and the industry at large uses it, which was the source of my confusion. So while I agree with the concept, I really wish Erl hadn&#8217;t chosen an overloaded term to refer to it.<\/p>\n","excerpt":"<p>A while back, I blogged that Services Aren&#8217;t Stateless, in response to some stuff in Thomas Erl&#8217;s latest book. At the time, I mentioned that I was looking forward to discussing my opinions with Erl when I attended his workshop. I&#8217;ve spent the last two days at said workshop. I&#8217;ll have a full write-up on [&hellip;]<\/p>\n","date":"2006-09-20 15:35:31","modified":"2006-09-20 15:35:31","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["325c0630-3dbc-4292-b9a7-ad509157ffe9"],"dasblog_compressedtitle":["Stateless+Stateless"],"dasblog_compressedtitleunique":["2006\/09\/20\/Stateless+Stateless"]}},"previous_url":"http:\/\/devhawk.net\/2006\/09\/20\/feasible-service-reuse\/","next_url":"http:\/\/devhawk.net\/2006\/09\/21\/revisiting-the-ajax-ecosystem\/"}