[
  {
    "author-name": "Michael Foord",
    "author-email": "fuzzyman@voidspace.org.uk",
    "author-url": "http://www.ironpythoninaction.com/",
    "date": "2009-07-13T10:40:00-07:00",
    "content": "Has your view on architecture as a discipline separate from coding changed since working with dynamic languages?"
  },
  {
    "author-name": "Seo Sanghyeon",
    "author-email": "sanxiyn@gmail.com",
    "author-url": "",
    "date": "2009-07-14T04:37:45-07:00",
    "content": "The Truth Is On The Edge, so true. On the other hand, automatically collected central repository of information in the large scale can be very valuable, e.g. Ohloh."
  },
  {
    "author-name": "Nick Malik",
    "author-email": "",
    "author-url": "http://blogs.msdn.com/nickmalik",
    "date": "2009-07-14T09:56:39-07:00",
    "content": "Hi Harry,\n\nGreat Dilbert.  It is funny partly because it is painfully true.  We do have that repository, and it does contain \"partly valid\" information, and it is expensive and painful to update.\n\nTraditionally, in organizations that want to perform an unpopular activity, they will put that activity into a small team of people who are responsible for doing that activity over and over, in different places.  This is a \"business support function\" and occurs variously in everything from financial audits to investigations for sexual harassment.  Unfortunately, in IT, we didn't develop a single team that had to maintain the repository... we distributed the function, figuring it would be so much more efficient.\n\nAs a result, the pain is distributed.  That means that it never reaches the level of annoyance that someone will invest to fix the pain.  It is also distributed to people who pay the costs of doing the work but, as you noted, reap few of the benefits of the data.  As a result, data quality suffers.  \n\nThere are uses for data such as this, if the data is accurate.  As Dilbert points out, if the person who has to collect the data is NOT the person who benefits from its collection, then you will get mistakes, quality issues, and delays in delivery.\n\nThis is not a data issue.  It is an issue of IT not running like a business.  We do a good job of security in IT, because we have people directly accountable for security who own the teams responsible for delivering security.  \n\nAutomated data collection is a potential solution to a poorly described problem.  Unfortunately, without the team responsibility in place to make the problem visible, and to demonstrate the value of fixing it, no one will invest in that automated data collection.  I cannot even tell you if it is GOOD solution to the problem, because there is no person who can provide a consistent view on what the actual problem is (yet... this is changing).\n\nI believe that MS IT is typical in many of these problems.  \n\nWe are investing to replace that particularly onerous solution with something a bit better, with better support for the actual value-add activites that occur downstream, and with organizational alignment to insure that someone can answer the question \"what are you going to do with the data.\"\n\nThat said, your observation is salient.  Manual data collection is rarely a good long term solution.\n\nGood to chat with you again.\n--- Nick"
  }
]