{"status":"ok","post":{"id":652,"type":"post","slug":"what-is-up-with-the-three-amigos","url":"http:\/\/devhawk.net\/2005\/11\/14\/what-is-up-with-the-three-amigos\/","status":"publish","title":"What Is Up With The Three Amigos?","title_plain":"What Is Up With The Three Amigos?","content":"<p>First, Amigo Grady Booch admits to <a href=\"http:\/\/devhawk.net\/2005\/11\/07\/Grady+Booch+Sez+Throw+Models+Away.aspx\">throwing away models<\/a>. Now, Amigo <a href=\"http:\/\/www.ivarjacobson.com\">Ivar Jacobson<\/a> has signed on as a VSIP partner:<\/p>\n<blockquote dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"><p>Microsoft has tapped Ivar Jacobson, known as one of the fathers of the popular Rational Unified Process (RUP), to lead an effort to deliver a lightweight unified process to the Microsoft Solutions Framework. <\/p>\n<p>&lt;snip&gt;<\/p>\n<p>Jacobson said the first fruits of his company&#8217;s relationship with Microsoft will be through the delivery of the Essential Unified Process (Essential UP), which is based on the Microsoft Solutions Framework and integrated with VSTS.\n<\/p>\n<p>In short, Essential UP is a simplified or lighter-weight alternative to RUP, Jacobson said. Essential UP is an evolution of the unified process Jacobson helped create more than 10 years ago that forms the foundation of RUP, he said. <\/p>\n<p>&lt;snip&gt;<\/p>\n<p>&#8220;We need more lightweight processes,&#8221; Jacobson said, noting that RUP has become too heavyweight and cumbersome. &#8220;We have competition from India, China and the former Soviet Union,&#8221; he said. &#8220;It is not enough to be agile.&#8221;\n<\/p>\n<p>Indeed, Microsoft has done a good job with its Microsoft Solutions Framework, and &#8220;their process agility is a clear differentiator for them,&#8221; Jacobson said.\n<\/p>\n<p>&#8220;Essential UP stands on all the experience we have from RUP, but also offers us a chance to have a fresh start,&#8221; Jacobson said. &#8220;We start in a new way because we&#8217;ve learned what works and what doesn&#8217;t work.&#8221;<\/p>\n<p>&lt;snip&gt;<\/p>\n<p>&#8220;RUP has a lot of good stuff, but it needs a correction,&#8221; [Jacobson] said.<\/p>\n<p>&lt;snip&gt;<\/p>\n<p>However, among the primary problems Jacobson said he has with RUP is that it is &#8220;heavyweight.&#8221;\n<\/p>\n<p>Also, &#8220;the process architecture needs to be refactored,&#8221; Jacobson said. &#8220;It is very difficult to add new practices because it will force a big change in the base. For instance, adding in a streamlined way practices such as EA [Enterprise Architect], SOA [service-oriented architecture], ABD [asset-based development], re-engineering legacy systems and commercial off-the-shelf software would be very difficult, if at all possible. So I believe in starting all over fresh but not throwing away anything that is good.&#8221; <\/p>\n<p>&lt;snip&gt;<\/p>\n<p>&#8220;Having an industry luminary build the next version of his tool for our platform is huge for us,&#8221; [VSTS General Manager Rick] LaPlante said. <\/p>\n<p>[From <span class=\"Article_Title\"><a href=\"http:\/\/www.eweek.com\/article2\/0,1895,1886531,00.asp\">Microsoft Taps Former Rational Heavyweight to Lend Credence to Enterprise Tools Play<\/a>, eWeek]<\/span><\/p>\n<\/blockquote>\n<p dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\">I&#8217;d like to nominate Rick&#8217;s comment for understatement of the year awards. It also gets me wondering what Amigo Jim Rumbaugh is up to these days.<\/p>\n<p dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"> <\/p>\n","excerpt":"<p>First, Amigo Grady Booch admits to throwing away models. Now, Amigo Ivar Jacobson has signed on as a VSIP partner: Microsoft has tapped Ivar Jacobson, known as one of the fathers of the popular Rational Unified Process (RUP), to lead an effort to deliver a lightweight unified process to the Microsoft Solutions Framework. &lt;snip&gt; Jacobson [&hellip;]<\/p>\n","date":"2005-11-14 11:15:04","modified":"2005-11-14 11:15:04","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["ffdb7145-6ab2-4433-95e7-034f620b544e"],"dasblog_compressedtitle":["What+Is+Up+With+The+Three+Amigos"],"dasblog_compressedtitleunique":["2005\/11\/14\/What+Is+Up+With+The+Three+Amigos"]}},"previous_url":"http:\/\/devhawk.net\/2005\/11\/08\/really-simple-code-templates-in-vs05\/","next_url":"http:\/\/devhawk.net\/2005\/11\/22\/i-hate-the-term-mashup\/"}