{"status":"ok","post":{"id":967,"type":"post","slug":"this-isnt-the-droid-im-looking-for","url":"http:\/\/devhawk.net\/2007\/05\/25\/this-isnt-the-droid-im-looking-for\/","status":"publish","title":"This Isn&#8217;t The Droid I&#8217;m Looking For","title_plain":"This Isn&#8217;t The Droid I&#8217;m Looking For","content":"<p>Since David Ing responded to my <a href=\"http:\/\/devhawk.net\/2007\/05\/24\/REST+Is+Neither+CRUD+Nor+CRAP.aspx\">REST\/CRUD\/CRAP<\/a> entry <a href=\"http:\/\/www.from9till2.com\/PermaLink.aspx?guid=2dbee669-07fd-435e-a5f9-51f709ef183f\">on his blog<\/a>, I guess that means I respond to his response here, right?<\/p>\n<p>Actually, this is going to be very short(*) because I mostly agree with what David wrote. For example:<\/p>\n<blockquote><p style=\"MARGIN-RIGHT: 0px\">If we say stuff like &#8216;REST shall\/must replace all foolish WS-* SOAP systems (insert Nelson-style HaHa here)&#8217; then we are just repeating the same lessons as before &#8211; One size won&#8217;t fit all and there is no One Ring to Bind Them illusion in REST as well. If you have something complex that fits the WS-* style then maybe REST isn&#8217;t the droid you are looking for.<\/p>\n<\/blockquote>\n<p>Of course, this begs the question &#8220;what is complex?&#8221; David described complex as &#8220;long running transaction updating multiple distributed stores&#8221;. Personally, I&#8217;d replace &#8220;stores&#8221; with &#8220;systems&#8221; and I hate term &#8220;long running transaction&#8221; so I would have written &#8220;long running operation&#8221; or &#8220;business process&#8221;, but grammatical nitpicking aside that certainly seems like a fair description. Certainly, most of the scenarios I&#8217;m looking at in my day job could be described as being long running and updating multiple systems. David says later that he thinks &#8220;a lot of apps don’t need to be modeled that way&#8221;, but I&#8217;m not aware of the alternatives so I&#8217;ll let him expand on this on his own blog. I&#8217;ll try to get to writing about my thoughts around protocol state next week. <\/p>\n<p>I did disagree with this one point:<\/p>\n<blockquote><p>We may <em>say<\/em> REST is really about a protocol state and not CRUD, but unless the rest of the world gravitates to that view then I&#8217;m afraid it just won&#8217;t be. If, say, through some ongoing groundswell of common usage, people start modelling entities as dereferenceable URI&#8217;s and using POST to do Create and Updates, then REST <em>will<\/em> be about CRUD by default. This is all very unacademic and unjust, but thems the breaks peachy. The lesson from SOAP is not to fight it by trying to re-educate the masses after they get a perception in their head.<\/p>\n<\/blockquote>\n<p>I think it doesn&#8217;t really matter how the rest of the world gravitates, it only matters how you as the the service provider choose to expose your service. If you&#8217;re doing something simple like ATOM publishing, you can probably get away with REST as CRUD. (Would that be hi or lo REST?) If you&#8217;re doing something more complex, either in terms of being long running or needing multiple updates in one atomic operation like <a href=\"http:\/\/pluralsight.com\/blogs\/tewald\/archive\/2007\/04\/27\/47031.aspx\">Tim&#8217;s airline example<\/a>, you&#8217;ll probably need to gravitate towards REST as protocol state. But can&#8217;t the two models can co-exist nicely, even in the same app? No re-education required.<\/p>\n<p>UPDATE &#8211; From <a href=\"http:\/\/www.ics.uci.edu\/~fielding\/pubs\/dissertation\/rest_arch_style.htm\">Fielding&#8217;s Dissertation<\/a>: &#8220;REST relies instead on the author choosing a resource identifier that best fits the nature of the concept being identified&#8221;. My point exactly.<\/p>\n<hr \/>\n<p>(*) Wow, this post wasn&#8217;t that short at all. Can you imagine how long this would have been if I had mostly disagreed with David?<\/p>\n","excerpt":"<p>Since David Ing responded to my REST\/CRUD\/CRAP entry on his blog, I guess that means I respond to his response here, right? Actually, this is going to be very short(*) because I mostly agree with what David wrote. For example: If we say stuff like &#8216;REST shall\/must replace all foolish WS-* SOAP systems (insert Nelson-style HaHa [&hellip;]<\/p>\n","date":"2007-05-25 13:59:52","modified":"2007-05-25 13:59:52","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":181,"slug":"rest","title":"REST","description":"","post_count":18},{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94},{"id":290,"slug":"web-services","title":"Web Services","description":"","post_count":12}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2512,"name":"David Ing","url":"http:\/\/www.from9till2.com","date":"2007-05-26 09:40:04","content":"<p>To save valuable internet space, I&#8217;ll just comment here &#8211; no one wants the tubes blocked any more than they are:<\/p>\n<p>1. &#8216;I think it doesn&#8217;t really matter how the rest of the world gravitates&#8217;. Ooo. Three words Harry, in, ter and op. The nearest thing I had to a point was that if your interpretation of REST is so very different to mine (it isn&#8217;t, but lets go along with this), then aren&#8217;t we making harder to &#8216;walk up and use?&#8217;? The world is full of cutting-edge inspired ideas that no-one now has a clue on how to maintain (or even talk too).<\/p>\n<p>Imagine if people rush to REST and make it an overnight\/14 year success with PUTs\/DELETE&#8217;s on some Entity driven crusade to emulate WebDAV with everything they can find (or APP gData styling it all), then they may find your entityless system harder to interop with (or even to grok) &#8211; especially where it&#8217;s so early in have some formal description of what your valid &#8216;interface&#8217; (states) are?<\/p>\n<p>2. Agreed about transaction\/bizprocess thing &#8211; that was a 11 keystroke spelling error that I must stop doing &#8211; the keys are right next to each other though.<\/p>\n<p>3. We need something like Godwins law, i.e. when anyone ever pulls out a Fielding Disseration link then all bets are off&#8230; <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" \/> <\/p>\n<p>One important point that I forgot before is related to what Dare said about Mike Champions WS-* vibe, are you really *sure* you want to use a Web protocol for something that might not be actually used on the Web? Anyway, typing too much, I should blog at home&#8230;<\/p>\n","parent":0},{"id":2513,"name":"DevHawk","url":"","date":"2007-05-26 22:38:34","content":"<p>Two responses to point #1 above:<\/p>\n<p>First, as I pointed out in my update, Fielding specifically allows the author to choose resource identifiers as they see fit. So I might argue (if it came to down to an argument) that maybe you&#8217;re not &#8220;doing REST&#8221; if you can&#8217;t interop with a REST as Protocol system.<\/p>\n<p>Second, in theory people may find it harder to grok, but in reality are we really worried about that? Is Tim&#8217;s airline example really that much harder to understand than Atom Publishing? I don&#8217;t think so.<\/p>\n","parent":0},{"id":2514,"name":"David Ing","url":"http:\/\/www.from9till2.com","date":"2007-05-27 09:51:49","content":"<p>Trying hard to disagree with you here Harry, but in the interests of the discussion then how about?:<\/p>\n<p>- If I had a wonderful Doughnut Atom Publishing Protocol (APP) based resource on the web that you wanted to use as part of your DeliciousThingsToEat composite app, then don&#8217;t you have to now treat me as a special case, i.e. I&#8217;m not expecting to return a getDetails URI in *my* response &#8211; are you going to have to write a special adaptor to make me fit in as an in-between state for your &#8216;controller&#8217; of your state machine? The world gravitating to the PUT will make a little awkward for you to add to your application with the resources in systems that you didn&#8217;t write? If you don&#8217;t intend to &#8216;promiscuously mashup&#8217; from outside resource-based services (maybe for an internal system that could be Service rather than Resource orientated?) then this point is moot.<\/p>\n<p>- I think the butterflies in my tummy about this issue may be related in that it smells a bit like the days of SOAP Doc\/Lit vs RPC\/Enc chaos, (Cough &#8211; Hey, I know how about Basic Profile 1.0 for REST usage!? Shudder!). The &#8216;you say POST and I say PUT&#8217; chaos is probably a way of life, and maybe if it took us 4 years to figure out not to tunnel the GET through a POST it might take a similar amount of time not tunnel the PUT through POST either. <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" \/> <\/p>\n<p>- Unless Roy is going to come around my house and fix the code for me when I get the wrong interpretation of REST, they I don&#8217;t care\/mind what he wrote on the resource-intpretation issue. <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":-)\" class=\"wp-smiley\" \/>  I could also make an argument that the Real Web isn&#8217;t really REST based in practice either &#8211; and no-one took *their* REST license away&#8230;<\/p>\n<p>(we should blog this, it&#8217;s far too interesting a topic to live in comments)<\/p>\n","parent":0},{"id":2515,"name":"David Ing","url":"http:\/\/www.from9till2.com","date":"2007-05-27 10:40:17","content":"<p>Ug. Couldn&#8217;t resist. Updated the blog here:<br \/>\n<a href=\"http:\/\/www.from9till2.com\/PermaLink.aspx?guid=5f9ac25b-6e8d-412f-9a16-f9f0c0dbf9be\" rel=\"nofollow\">http:\/\/www.from9till2.com\/PermaLink.aspx?guid=5f9ac25b-6e8d-412f-9a16-f9f0c0dbf9be<\/a><br \/>\nSorry.<\/p>\n","parent":0},{"id":2516,"name":"Erik Johnson","url":"http:\/\/appside.blogspot.com","date":"2007-05-29 10:35:50","content":"<p>Me too.<\/p>\n<p><a href=\"http:\/\/appside.blogspot.com\/2007\/05\/harry-david.html\" rel=\"nofollow\">http:\/\/appside.blogspot.com\/2007\/05\/harry-david.html<\/a><\/p>\n","parent":0}],"attachments":[],"comment_count":5,"comment_status":"closed","custom_fields":{"dasblog_entryid":["077a65c2-6dbc-42e5-b927-4be2d6e1ff98"],"dasblog_compressedtitle":["This+Isnt+The+Droid+Im+Looking+For"],"dasblog_compressedtitleunique":["2007\/05\/25\/This+Isnt+The+Droid+Im+Looking+For"]}},"previous_url":"http:\/\/devhawk.net\/2007\/05\/25\/morning-coffee-83\/","next_url":"http:\/\/devhawk.net\/2007\/05\/25\/follow-my-breadcrumbs\/"}