{"status":"ok","post":{"id":756,"type":"post","slug":"really-not-the-biggest-job-change-news","url":"http:\/\/devhawk.net\/2006\/06\/15\/really-not-the-biggest-job-change-news\/","status":"publish","title":"Really Not the Biggest Job Change News","title_plain":"Really Not the Biggest Job Change News","content":"<p><a href=\"http:\/\/www.microsoft.com\/presspass\/press\/2006\/jun06\/06-15CorpNewsPR.mspx\">This<\/a> is even bigger than Scoble leaving, much less me moving to a new role.<\/p>\n<blockquote dir=\"ltr\" style=\"MARGIN-RIGHT: 0px\"><p><strong>Microsoft Announces Plans for July 2008 Transition for Bill Gates<\/strong><\/p>\n<p>Microsoft Corp. today announced that effective July 2008 Bill Gates, chairman, will transition out of a day-to-day role in the company to spend more time on his global health and education work at the Bill &amp; Melinda Gates Foundation. The company announced a two-year transition process to ensure that there is a smooth and orderly transfer of Gates’ daily responsibilities, and said that after July 2008 Gates would continue to serve as the company’s chairman and an advisor on key development projects.<\/p>\n<p>The company announced that Chief Technical Officer Ray Ozzie will immediately assume the title of chief software architect and begin working side by side with Gates on all technical architecture and product oversight responsibilities, to ensure a smooth transition. Similarly, Chief Technical Officer Craig Mundie will immediately take the new title of chief research and strategy officer and will work closely with Gates to assume his responsibility for the company’s research and incubation efforts; Mundie also will partner with general counsel Brad Smith to guide Microsoft’s intellectual property and technology policy efforts. <\/p>\n<\/blockquote>\n<p dir=\"ltr\">Wow.<\/p>\n","excerpt":"<p>This is even bigger than Scoble leaving, much less me moving to a new role. Microsoft Announces Plans for July 2008 Transition for Bill Gates Microsoft Corp. today announced that effective July 2008 Bill Gates, chairman, will transition out of a day-to-day role in the company to spend more time on his global health and education [&hellip;]<\/p>\n","date":"2006-06-15 13:36:52","modified":"2006-06-15 13:36:52","categories":[],"tags":[{"id":309,"slug":"job","title":"Job","description":"","post_count":3},{"id":232,"slug":"microsoft","title":"Microsoft","description":"","post_count":31}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["dafd3ac1-35cd-4fd6-99ea-27e02da918df"],"dasblog_compressedtitle":["Really+Not+The+Biggest+Job+Change+News"],"dasblog_compressedtitleunique":["2006\/06\/15\/Really+Not+The+Biggest+Job+Change+News"]}},"previous_url":"http:\/\/devhawk.net\/2006\/06\/15\/moving-on\/","next_url":"http:\/\/devhawk.net\/2006\/06\/19\/hawk-eye-on-xbox-360\/"}