{"status":"ok","post":{"id":1020,"type":"post","slug":"where-have-all-the-soa-mashups-gone","url":"http:\/\/devhawk.net\/2007\/08\/02\/where-have-all-the-soa-mashups-gone\/","status":"publish","title":"Where Have All the SOA Mashups Gone?","title_plain":"Where Have All the SOA Mashups Gone?","content":"<p>John Heintz <a href=\"http:\/\/johnheintz.blogspot.com\/2007\/08\/rest-serendipity-and-hard-work.html\">responded<\/a> to my <a href=\"http:\/\/devhawk.net\/2007\/07\/31\/Is+Serendipity+The+Heart+Of+The+WSREST+Debate.aspx\">serendipitous reuse post<\/a>. Nice to see I misunderstood his opinions about how easy RESTful systems are to integrate:<\/p>\n<blockquote><p>I didn&#8217;t mean to imply that building RESTful system would lead to magical integration without any hard work. I can see how that came across in my post, and I guess I got the reaction I asked for <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_wink.gif\" alt=\";)\" class=\"wp-smiley\" \/> <\/p>\n<\/blockquote>\n<p>I get the feeling that John would be a good guy to have a beer with. <\/p>\n<p>John spends most of his post writing about the <a href=\"http:\/\/blogs.msdn.com\/jevdemon\/archive\/2007\/07\/20\/soa-in-the-real-world-now-available.aspx\">SOA in the Real World<\/a> book. I&#8217;ve flipped thru it and I&#8217;m familiar with the model (it is my old team after all) but I haven&#8217;t read it so I don&#8217;t really want to comment about the book specifically. But there were two things John mentioned that I did want to comment on.<\/p>\n<p>First, at the end of his post John writes:<\/p>\n<blockquote><p>Can some of the constraints of REST be applied to SOA? Absolutely. I think an asynchronous, message-passing architecture with a uniform interface would be astoundingly interesting! I&#8217;m not the only one: see <a href=\"http:\/\/savas.parastatidis.name\/2005\/01\/29\/544a6902-40e1-47e8-a51c-18776f3dd036.aspx\">MEST<\/a>, <a href=\"http:\/\/www.ampq.com\/\">AMPQ<\/a>, and <a href=\"http:\/\/www.erlang.org\/\">Erlang<\/a>.<\/p>\n<\/blockquote>\n<p>This goes back to <a href=\"http:\/\/devhawk.net\/2007\/06\/05\/A+REST+Question.aspx\">a REST question<\/a> I asked two months ago: is it still REST if you don&#8217;t use HTTP? I&#8217;m guessing John would say yes. <\/p>\n<p>I might be going out on a limb here, I&#8217;ll bet the core of John&#8217;s problem with SOA is how toolkits like WCF all but force you to build RPC style services that can easily be modeled as <a href=\"http:\/\/msdn2.microsoft.com\/en-us\/library\/system.servicemodel.operationcontractattribute.aspx\">method calls<\/a>. That&#8217;s certainly one of <em>my<\/em> problems with SOA. Tim Ewald <a href=\"http:\/\/pluralsight.com\/blogs\/tewald\/archive\/2007\/04\/26\/46984.aspx\">said it best<\/a>:<\/p>\n<blockquote><p>It&#8217;s depressing to think that SOAP started just about 10 years ago and that now that everything is said and done, we built RPC again. I know SOAP is really an XML messaging protocol, you can do oneway async stuff, etc, etc, but let&#8217;s face it. The tools make the technology and the tools (and the examples and the advice you get) point at RPC. And we know what the problems with RPC are. If you want to build something that is genuinely loosely-coupled, RPC is a pretty hard path to take.<\/p>\n<\/blockquote>\n<p>If SOA == RPC and REST == loosely coupled messages, then I&#8217;ll start growing dreadlocks right now. Frankly, as Tim says, I think it&#8217;s a problem with the tools (I&#8217;m looking at you WCF) and not the underlying architecture, but how many people can distinguish the architecture from the tools? Not many, I&#8217;m afraid.<\/p>\n<p>Second, John asks an interesting question:<\/p>\n<blockquote><p>Where are the SOA mashups?<\/p>\n<\/blockquote>\n<p>That&#8217;s easy! They&#8217;re inside the firewall where you can&#8217;t see them! <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_wink.gif\" alt=\";)\" class=\"wp-smiley\" \/>  <\/p>\n<p>Seriously, I&#8217;m not sure about &#8220;SOA&#8221; mashups, but I&#8217;m working with what you might call a huge &#8220;enterprise&#8221; mashup system inside Microsoft. Our Enterprise Data Integration Services push around massive amounts of data to downstream systems. There are over fifty datasets in production, each with scores of tables, millions of rows and hundreds of subscribing systems. One example, our Products dataset, has over 100 tables and nearly 300 subscribing systems.  <\/p>\n<p>Is it &#8220;service oriented&#8221;? No, but then again it was originally developed ten years ago on SQL 6.5. But is it a mashup? Is it an &#8220;<a href=\"http:\/\/en.wikipedia.org\/wiki\/Mashup_%28web_application_hybrid%29\">application that combines content from more than one source into an integrated experience<\/a>&#8220;? Yep. Is it easy to work with? No, but guess why I&#8217;m involved? We&#8217;re looking at ways to &#8220;modernize&#8221; the system. Am I going to build RPC style services as part of this modernization? Hell, no.  <\/p>\n<p>So John, am I right or wrong about that beer?<\/p>\n","excerpt":"<p>John Heintz responded to my serendipitous reuse post. Nice to see I misunderstood his opinions about how easy RESTful systems are to integrate: I didn&#8217;t mean to imply that building RESTful system would lead to magical integration without any hard work. I can see how that came across in my post, and I guess I [&hellip;]<\/p>\n","date":"2007-08-02 14:26:27","modified":"2007-08-02 14:26:27","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":181,"slug":"rest","title":"REST","description":"","post_count":18},{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2559,"name":"Erik Johnson","url":"http:\/\/appside.blogspot.com","date":"2007-08-03 11:08:54","content":"<p>Those mashups are stuffed into a shoebox along with our web services.  Four years ago, weren&#8217;t there meant to be *millions* of web services thriving in a new market?  What happened (hint &#8212; it had nothing to do with WS-*)?  <\/p>\n<p>It&#8217;s one thing to show a mashup, quite another to commercially rely on a mashup, and yet another to profit when mashups use your content.  <\/p>\n<p>Viable, cross-enterprise, commercial mashups have startup with large commodity\/service companies like FedEx content embedded in an eCommerce site (where&#8217;s my stuff?).  But beyond that, it will be vertical applications that are further automating a specific business chain.  I think you&#8217;ll find web services have submerged similarly to industry-specific applications.<\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["328fb172-dc3a-4fc4-84a8-0ad8634e71ed"],"dasblog_compressedtitle":["Where+Have+All+The+SOA+Mashups+Gone"],"dasblog_compressedtitleunique":["2007\/08\/02\/Where+Have+All+The+SOA+Mashups+Gone"]}},"previous_url":"http:\/\/devhawk.net\/2007\/08\/02\/morning-coffee-107\/","next_url":"http:\/\/devhawk.net\/2007\/08\/03\/morning-coffee\/"}