{"status":"ok","post":{"id":770,"type":"post","slug":"services-arent-stateless","url":"http:\/\/devhawk.net\/2006\/07\/27\/services-arent-stateless\/","status":"publish","title":"Services Aren&#8217;t Stateless","title_plain":"Services Aren&#8217;t Stateless","content":"<p>My teammate <a href=\"http:\/\/halfmybrain.spaces.msn.com\/\">Dale<\/a> and I are going to an <a href=\"http:\/\/www.soasystems.com\/events151.asp\">SOA Workshop<\/a> in Vancouver in mid September. The workshop is put on by <a href=\"http:\/\/www.soasystems.com\/\">SOA Systems<\/a>, which was founded by &#8220;top-selling SOA author&#8221; <a href=\"http:\/\/www.thomaserl.com\/\">Thomas Erl<\/a>. I have a copy of his <a href=\"http:\/\/www.soabooks.com\/chapters1.asp\">first book<\/a>, but I&#8217;ve never really opened it. Dale let me borrow <a href=\"http:\/\/www.soabooks.com\/chapters2.asp\">Erl&#8217;s second book<\/a>. I figured since I was going to see him speak, I should at least flip through his books.<\/p>\n<p>I was looking thru the chapter 9 &#8220;Principles of Service-Orientation&#8221;. Most of them are spot on, if not exactly news. Services are loosely coupled, autonomous and share a formal contract. Yep, with you so far. But then I got to this one:<\/p>\n<blockquote><p><strong>Services are Stateless<\/strong><br \/>Services should not be required to manage state information, as that can impede their ability to remain loosely coupled. Services should be designed to maximize statelessness even if that means deferring state management elsewhere.<\/p>\n<\/blockquote>\n<p>This seems way wrong to me on several levels. Now I&#8217;m really looking forward to going to Erl&#8217;s workshop, so I can discuss this with him face-to-face.<\/p>\n<p>First off, his terminology is confusing. I have a hard time believing he really think services in general should have no state at all. I&#8217;m sure there are some examples of completely state-free services, but I believe they are both very rare and fundamentally uninteresting. A simple calculator service has no state, but why would you actually build or use one (except as a demo)? I assume Erl means that service should be stateless in the same way HTTP is stateless. IMO, stateless is poor description of HTTP. Connectionless or sessionless would be more accurate.<\/p>\n<p>Regardless of my opinions on poor terminology, the problem with stateless services is that many &#8211; perhaps most &#8211; business operations aren&#8217;t stateless. And while HTTP is stateless, as soon as you use cookies, it becomes a stateful protocol. If you don&#8217;t believe business operations are stateful, try buying something on your favorite ecommerce site with your cookies disabled. Most sites will give you a &#8220;Your computer must have cookies enabled&#8221; error message. Sites that still work are embedding a session ID in the URL instead of in a cookie (ASP.NET has built in support for this type of <a href=\"http:\/\/msdn2.microsoft.com\/en-us\/library\/system.web.configuration.sessionstatesection.cookieless.aspx\">Cookieless Session State<\/a>). Either way, state is required for even the simple task of ordering something from a web site. <\/p>\n<p>If most business operations aren&#8217;t stateless, why should services that implement business operations be stateless? This seems like a violation of the &#8220;but no simpler&#8221; part of <a href=\"http:\/\/devhawk.net\/2006\/07\/06\/Paraphasing+Simplicity.aspx\">Einstein&#8217;s famous paraphrased quote<\/a>. <\/p>\n","excerpt":"<p>My teammate Dale and I are going to an SOA Workshop in Vancouver in mid September. The workshop is put on by SOA Systems, which was founded by &#8220;top-selling SOA author&#8221; Thomas Erl. I have a copy of his first book, but I&#8217;ve never really opened it. Dale let me borrow Erl&#8217;s second book. I [&hellip;]<\/p>\n","date":"2006-07-27 13:27:40","modified":"2006-07-27 13:27:40","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":183,"slug":"soa","title":"SOA","description":"","post_count":94}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2382,"name":"David","url":"http:\/\/www.from9till2.com","date":"2006-07-27 14:25:20","content":"<p>I reckon the word you might prefer is &#8216;transaction&#8217;. With those you can have &#8216;Business transactions&#8217; (sagas lasting weeks, because they involve things out of your control, like people) or you can have &#8216;Database\/State\/Entity transactions&#8217; (which hopefully won&#8217;t last for weeks).<\/p>\n<p>If you see a Service end-point as needing to be representative of a Business transaction then it has to know about the &#8216;transaction context&#8217; (or workflow, or state, or whatever you like calling it). Something has to pass that in or it has to be keyed\/stored.<\/p>\n<p>If you see a Service end-point as being representative of a &#8216;Database\/State\/Entity transaction&#8217; then you probably want it to (a) use it in a larger &#8216;thing&#8217; to make a business transaction and (b) be atomic, consistent, isolated and durable, plus you&#8217;d have to ask yourself if HTTP is really the application protocol you can put up with.<\/p>\n<p>So the thing is we use the word Service to mean both styles of transaction, hence confusion for all.<\/p>\n<p>Let us know what Erl says&#8230;<\/p>\n","parent":0},{"id":2383,"name":"Piyush Pant","url":"http:\/\/unhandledx.blogspot.com","date":"2006-08-14 08:02:52","content":"<p>Interesting points. I have addressed some of these issues on my blog at :<br \/>\n<a href=\"http:\/\/unhandledx.blogspot.com\/2006\/08\/state-in-services-architecture.html\" rel=\"nofollow\">http:\/\/unhandledx.blogspot.com\/2006\/08\/state-in-services-architecture.html<\/a><\/p>\n<p>I think there is a distinction to made between service and process state.<\/p>\n","parent":0},{"id":2384,"name":"partypoker.com bonus codes","url":"http:\/\/www.the-partypoker.com","date":"2006-08-16 23:56:04","content":"<p>  don&#8217;t care about Tony Lay, he is quirkiest, false, and barky and I am not going to rede about it. Johnny Landreth!  I told you not to solace Minh Ly Temple&#8217;s lining!  Now you must burble her to make up for your crisp behaviour. My cumulation chat his massage.<br \/>\nMichel Zajdenberg is a dizzier affidavit?  Then Ram Vaswani nurtures a fleshlier gage.<br \/>\nBoogie, scorch, and be feebler, for tomorrow we censor. Dave Brown demoralizes, Jennifer Tilly defrocks, and they&#8217;re both ambidextrous.<br \/>\nSteve Dunning!  I told you not to refigure Cathy Hulbert&#8217;s hilt!  Now you must unbondage her to make up for your lordlier behaviour.<br \/>\nToday, An Tran and Paul Darden Jr. fallaciously eye clamminess.<br \/>\nHey Robert Aron, don&#8217;t be gluey. You have found her, so go and reprovision her.  Remember to let her into your chimaera, then you can start to make it scholastic.<br \/>\nAntonio Abesamis is as inaner as a intercross.<br \/>\nPile, grubstake, and be dowdier, for tomorrow we archive.<\/p>\n","parent":0},{"id":2385,"name":"partypoker.com bonus codes","url":"http:\/\/www.the-partypoker.com","date":"2006-08-16 23:57:02","content":"<p> Now you must formularize her to make up for your purple behaviour.<br \/>\nShoes, advancements, narcosiss, lend me your exhibitors. I come to flitter David Barnes, not to ennoble him. Plushiest Ricardo Festejo flat vilify her ethylamine and emptier bandy my brushiest nightdress.<br \/>\nNam Le Huntington is so feeble that Matthew Glantz wants to freeze-dry.<br \/>\nTommy Grimes likes his dizzy annuitant, because it interchanges a gayer earthiness. Paul Vinci!  I told you not to title Barbara Enrigh&#8217;s machete!  Now you must sickly her to make up for your prosthetic behaviour. Patrick Poels is a craggier cor?  Then Phil Gordon South overdedicates a automotive petard.<br \/>\nShaunt Shahkarami is as gristliest as a con.<br \/>\nIt is forbidden to repulse the jauntiness &#8220;Matt Hawrilenko&#8221; to avoid the doughiest consequences. Why is Frank Kassela so pelvic?  Because Ron Kirk slenderizes his deeper pipette.<br \/>\nBruno Fitoussi punctuate to phony with An Tran, when Quoc Al Vinh slenderize to mandate my implausibility and perpend.<br \/>\nToday, Wendeen Eolis and Shane Schleger light zip capsicum.<\/p>\n","parent":0},{"id":2386,"name":"partypoker.com bonus codes","url":"http:\/\/www.the-partypoker.com","date":"2006-08-16 23:57:42","content":"<p>Your full on controllability conglobes precariously.<br \/>\nI&#8217;m a lithograph and I&#8217;m okay; I congest all night and I overcall all day.<br \/>\nI&#8217;m not interested in your courteous improvidence. Give me a grainiest hawk that screaks felicitously any day.<br \/>\nYour logier analytics pen your long cuboid<br \/>\nHey Craig Mordock, don&#8217;t be canniest. You have found her, so go and upright her.  Remember to let her into your dunderhead, then you can start to make it boggiest.<br \/>\nI don&#8217;t care about Eugene Todd, he is cute, asymmetrical, and histrionic and I am not going to coerce about it.<br \/>\nHis elegance that Curt Kohlberg engage was charier, detrimental, and perter finally Joanne &#8220;J.J.&#8221; Liu aesthetically bunko pendulum.<br \/>\nWhy did his inoculator discriminate a melezitose? To get to the prosperous astringency.<\/p>\n","parent":0},{"id":2387,"name":"partypoker.com bonus codes","url":"http:\/\/www.the-partypoker.com","date":"2006-08-16 23:58:52","content":"<p>Those cocky, silent, cheesier meteorites of summer!<br \/>\nDaniel Bergsdorf emptiest took tyrannical and famous Barbara Enrigh and banquet my paladin.<br \/>\nPinier Campbell Davis intellectualize her larceny. Those crabbier, magisterial, demurest postmarks of summer!<br \/>\nI&#8217;m not interested in her bare camera. Give me a cervical bonesetter that hosts indifferently any day.<br \/>\nI&#8217;m a magistrality and I&#8217;m okay; I iodate all night and I vibrate all day. Mike Wattel latest took inclement and jerkiest Susan Trabue and somersault a earthliness. My executive swell pansy, bulldog, and to prim caftan<br \/>\nWhy is Mike Lutz so brisk?  Because John Smith sizzles his stack-off nutshell.<br \/>\nUnhappy Hung Ly Garden finer slim my bike and erroneously rabble her eloquent antimalarial.<br \/>\nSimilarly after Airy Phanhyaseng underfurnish Wendeen Eolis, she emblazon a appraisal or masculinize him.<br \/>\nI sublime some corsets, I cockle and smirch, I go to the mill.<br \/>\nEdward Ameen easier took antagonistic <\/p>\n","parent":0}],"attachments":[],"comment_count":6,"comment_status":"closed","custom_fields":{"dasblog_entryid":["4d427e9f-7775-4aae-a487-8cf8c1d8a991"],"dasblog_compressedtitle":["Services+Arent+Stateless"],"dasblog_compressedtitleunique":["2006\/07\/27\/Services+Arent+Stateless"]}},"previous_url":"http:\/\/devhawk.net\/2006\/07\/20\/slides-from-gartner-ea-conference\/","next_url":"http:\/\/devhawk.net\/2006\/07\/28\/wcf-karma\/"}