{"status":"ok","post":{"id":551,"type":"post","slug":"24-does-use-a-three-act-structure","url":"http:\/\/devhawk.net\/2005\/02\/23\/24-does-use-a-three-act-structure\/","status":"publish","title":"24 Does Use A Three Act Structure","title_plain":"24 Does Use A Three Act Structure","content":"<p>Sunday, I said that I didn&#8217;t think that 24 has a well defined three act structure. On further reflection, I&#8217;m not sure I was correct. I&#8217;m used to seeing these three act structure within a single episode and I don&#8217;t think most episodes of 24 follow that model. However, if you look at the season as a whole, it follows the three act structure pretty closely<\/p>\n<p>[Note - as with Sunday, there some first season spoilers here - but again I'm avoiding the big ones. I also talk about the current season a bit at the end]<\/p>\n<p>Typically, the <a href=\"http:\/\/www.cod.edu\/people\/faculty\/pruter\/film\/threeact.htm\">three act structure<\/a> divides the story into three parts &#8211; Setup, Confrontaion and Resolution. Each of these parts is deliniated with a plot point &#8211; some type of major reversal in the story. In a story as long as a season of 24, these reversals take a much more screen time than I&#8217;m used to. To take Star Wars as an example, the first reversal is when Luke discovers his parents have been murdered and he decides to go with Obi-Wan. That&#8217;s one scene &#8211; takes up a couple of minutes of screen time at most. But in 24, the first reversal is the last 20 minutes of Episode 6: Jack is comproised by the bad guys who have his daughter, it&#8217;s revealed that his wife is with one of the bad guys, the guy that kidnapped Jack&#8217;s daughter realizes what a bad situation he&#8217;s in and Palmer decides to tell the world about the death of his daughter&#8217;s rapist at the hands of his son that been covered up for seven years. <\/p>\n<p>The second act is typically a series of cycles &#8211; alternating between story exposition and action. For example, the first cycle of the second act builds towards the attempt on Palmer&#8217;s life at the morning press conference. This goes on typically for half of the overall length of the story and ends in another reversal. To use Star Wars as an example again, the second act ends with our heroes returning to the rebel base with the Death Star&#8217;s plans while being tracked by the Empire. In 24, while the end of the first act ends is very clear and occurs exactly at the one quarter mark, act two runs a little long and has a muddier ending. Personally, I&#8217;d say it ends in the middle of episode 19, with Jack in the underground prison, realizing who the prisoner being kept there is while Palmer is realizing that he can&#8217;t trust his wife anymore. <\/p>\n<p>Of course, the third act is where everything is resolved &#8211; typically running the final quarter of screen time. You can really see here the major difference between a format like 24 and a two hour movie. I don&#8217;t think you could reveal a twist as big as the one at the end of the next to last episode of 24&#8242;s first season in the last five minutes of a 2 hours movie and make it work. But that&#8217;s the time ratio &#8211; every minute of a two hours movie equals 12 minutes of a season of 24. <\/p>\n<p>If you apply this same structure to the current season of 24, you realize that the we&#8217;re in the middle of act two right now.  The kidnapping and trial of the secretary of defense was act one &#8211; and again act one ends right at the end of episode 6. Jack and CTU realizes the &#8220;real&#8221; target is melting down nuclear power plant via the override device, Behrooz kills the man his father sent to kill him, Jack&#8217;s girlfriend&#8217;s estranged husband shows up and we realize there&#8217;s a mole inside CTU (I get the feeling this is a running plot point &#8211; the CTU spy. I&#8217;m guessing that if they&#8217;ve used that every season it&#8217;s gotta be pretty old by now). I put &#8220;real&#8221; in quotes because assuming this season follows the same pattern as season one, there will need to be some new &#8220;real&#8221; target in act three. <\/p>\n","excerpt":"<p>Sunday, I said that I didn&#8217;t think that 24 has a well defined three act structure. On further reflection, I&#8217;m not sure I was correct. I&#8217;m used to seeing these three act structure within a single episode and I don&#8217;t think most episodes of 24 follow that model. However, if you look at the season [&hellip;]<\/p>\n","date":"2005-02-23 00:06:40","modified":"2005-02-23 00:06:40","categories":[],"tags":[{"id":218,"slug":"movies","title":"Movies","description":"","post_count":23}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["c7ff5e66-1517-4a38-bc2b-17b6c245dd65"],"dasblog_compressedtitle":["24+Does+Use+A+Three+Act+Structure"],"dasblog_compressedtitleunique":["2005\/02\/23\/24+Does+Use+A+Three+Act+Structure"]}},"previous_url":"http:\/\/devhawk.net\/2005\/02\/20\/but-i-dont-think-18-is-a-catchy-title\/","next_url":"http:\/\/devhawk.net\/2005\/02\/23\/nhl-hdtv\/"}