[
  {
    "author-name": "Jonathan Aquino",
    "author-email": "jon@ninginc.com",
    "author-url": "http://jonathanaquino.com",
    "date": "2006-03-16T22:56:24-08:00",
    "content": "Hi Harry - Thanks for highlighting the beauty of the Ning content store. Right on!"
  },
  {
    "author-name": "Bob English",
    "author-email": "bob_english@hotmail.com",
    "author-url": "",
    "date": "2006-03-17T15:01:09-08:00",
    "content": "Well, it seems you've just discovered the language impedence mismatch (between databases and programming) C#3 is all about?\nSolutions of diverse kinds have been around for some time, and a some interest into the Java community would help you grasp the ideas...\nHave a look at db4objects and see for yourself!\n\nTo me, and to the knowledge I have so far with C#3 and LINQ, these are just going back to the goo' ol' days of Visual FoxPro and embedded SQL. If its true, then it's a backwards step. Forward step is, as you reckon, into direct object graphs persistence.\n\nCheers,\nBob"
  },
  {
    "author-name": "Chris Sterling",
    "author-email": "csterling@solutionsiq.com",
    "author-url": "http://jroller.com/page/csterwa",
    "date": "2006-03-26T22:58:21-08:00",
    "content": "This subject is probably what I find to be the most interesting problem we are dealing with today.  Ruby, Python, C#3, and other models for dealing with this problem don't seem to be solutions in my opinion.  I tend to agree with your second comenter, Bob, in regards to direct object graph persistence but I also see that we must deal with the duplication and communication channels within our organizations, as well.  This will take more than a better persistence mechanism.  It will take systems which can merge data and dynamically relate data based upon context.  My current understanding of this would be done using agents and well defined heuristics.\n\nI posted my thoughts on this subject with a link back to this entry at http://jroller.com/page/csterwa?entry=data_our_technological_debt."
  }
]