{"status":"ok","post":{"id":419,"type":"post","slug":"more-msft-architect-bloggers-a-standard-rant","url":"http:\/\/devhawk.net\/2004\/08\/19\/more-msft-architect-bloggers-a-standard-rant\/","status":"publish","title":"More MSFT Architect Bloggers + a Standard Rant","title_plain":"More MSFT Architect Bloggers + a Standard Rant","content":"<p>We keep getting more and more field architects and architecture strategy team members blogging. Remember, I <a href=\"http:\/\/devhawk.net\/neat.opml.aspx\">keep a list<\/a> (I am becoming the Scoble of Microsoft Architecture). <a href=\"http:\/\/blogs.msdn.com\/annali\">Anna Liu<\/a> is a field architect evangelist who <a href=\"http:\/\/blogs.msdn.com\/annali\/archive\/2004\/08\/05.aspx\">presented at TechEd Australia<\/a> (but we didn&#8217;t get a chance to hang out). Anna&#8217;s also been thinking about <a href=\"http:\/\/blogs.msdn.com\/annali\/archive\/2004\/08\/11.aspx\">software development as an engineering discipline<\/a>.<\/p>\n<p>In addition to Anna, two of my teammates are blogging: <a href=\"http:\/\/blogs.msdn.com\/chriskeyser\">Chris Keyser<\/a> and <a href=\"http:\/\/blogs.msdn.com\/dave_welsh\">Dave Welsh<\/a>. Chris is a solution architect who&#8217;s doing some awesome next gen SOA work. He&#8217;s been <a href=\"http:\/\/blogs.msdn.com\/chriskeyser\/archive\/2004\/08\/18\/216640.aspx\">blogging<\/a><a href=\"http:\/\/blogs.msdn.com\/chriskeyser\/archive\/2004\/08\/19\/217525.aspx\">about<\/a> using WSE2 to manage Security Context Tokens. Chris, like <a href=\"http:\/\/blogs.msdn.com\/jdevados\">John deVadoss<\/a> (who has relapsed into silence), is very pragmatic so it&#8217;s great to run radical ideas past him.<\/p>\n<p>Earlier this year, our team &#8220;inherited&#8221; a group of awesome vertical architects &#8211; I&#8217;ve blogged about <a href=\"http:\/\/blogs.msdn.com\/jevdemon\">John Evdemon<\/a> before who&#8217;s from that group. <a href=\"http:\/\/blogs.msdn.com\/dave_welsh\">Dave<\/a> is also from that group. Like many of our vertical architects, Dave is heavily involved in standards bodies &#8211; in Dave&#8217;s case it&#8217;s <a href=\"http:\/\/www.unece.org\/cefact\/\">UN\/CEFACT<\/a>. He&#8217;s got an <a href=\"http:\/\/blogs.msdn.com\/dave_welsh\/archive\/2004\/08\/16\/215428.aspx\">great article<\/a> on how Standards Development Organizations traditionally work and <a href=\"http:\/\/blogs.msdn.com\/dave_welsh\/archive\/2004\/08\/17\/216038.aspx\">another<\/a> on how MSFT (and our specification partners) is improving on that process. He&#8217;s shining a light on the dark corners of the standard process, which is a good thing since so many people act like standards are a silver bullet solution. I love Dave&#8217;s description of the traditional standards process:<\/p>\n<blockquote><p>[L]aunch a committee, politically pick a chair, generate lots of hype and expectation on how this spec will solve world hunger, stack the new committee with people who may be able to contribute, host conference calls and arm wrestle the original idea down to some compromise that seems to make sense, then hope someone’s got a number of free weekends over to write up a draft of the new spec.<\/p>\n<\/blockquote>\n<p>You want an example of the results of a traditional standards process? How about XSD? I think XSD is the ugliest widely-used spec around.  <a href=\"http:\/\/www.gotdotnet.com\/team\/dbox\/\">Don<\/a> agrees, according to his <a href=\"http:\/\/msdn.microsoft.com\/msdntv\/episode.aspx?xml=episodes\/en\/20030827SOAPDB\/manifest.xml\">comments<\/a> from last years <a href=\"http:\/\/www.sellsbrothers.com\/conference\/\">SellsCon<\/a>:<\/p>\n<blockquote><p>Nothing illustrates [the cost of standardization] more than XML schema. XML schema is the quintessential example of what happens with a design by standards body specification. Rather than taking something that worked and something that was done and that there was experience with and effectively dotting the i’s and crossing the t’s you had two from every company off doing wanton innovation and invention without implementation experience. It was a train wreck in the making, especially when you consider the fact that you had people who vehemently disagreed about what they were building. Some people thought they were bringing object orientation to XML. Some people thought they were bringing database schema concepts to XML. Some people thought they were just, you know, reliving the SGML dream. So what do we get? We get a Frankenstein’s monster that is dumber than the dumbest person in the committee. No one person on that committee could have produced something this bad. It took an army of people to work hard day and night to build something that is not good. It’s not terrible – can we make it work? Yes. But it’s going to take a lot of work from a lot of plumbers and a lot of tool vendors to make XML schema palatable to the average developer. <\/p>\n<p>A great example of the opposite approach is RELAX NG. It is widely believed at this point in time that RELAX NG is a better schema language for XML than XML schema. Why? Because two guys who were really smart said why don’t we go do this and let’s get it working and let’s build it while we do it and let’s iterate it and see what works and what doesn’t work. And then when we’re done we will take it to the rubber stamp – I’m sorry, Oasis – where they will carefully vet every decision and bless it and give it UN status. <\/p>\n<\/blockquote>\n<p>I&#8217;m with Don and <a href=\"http:\/\/pluralsight.com\/blogs\/tewald\/archive\/2004\/08\/16\/1892.aspx\">Tim<\/a>: I want <a href=\"http:\/\/www.relaxng.org\/\">RelaxNG<\/a>. More importantly, I want standards that are built like WS-* and RelaxNG.<\/p>\n","excerpt":"<p>We keep getting more and more field architects and architecture strategy team members blogging. Remember, I keep a list (I am becoming the Scoble of Microsoft Architecture). Anna Liu is a field architect evangelist who presented at TechEd Australia (but we didn&#8217;t get a chance to hang out). Anna&#8217;s also been thinking about software development [&hellip;]<\/p>\n","date":"2004-08-19 23:26:27","modified":"2004-08-19 23:26:27","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":184,"slug":"blogging","title":"Blogging","description":"","post_count":122},{"id":213,"slug":"community","title":"Community","description":"","post_count":81}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["9354d570-8a56-4470-8330-8c03636224d7"],"dasblog_compressedtitle":["More+MSFT+Architect+Bloggers+A+Standard+Rant"],"dasblog_compressedtitleunique":["2004\/08\/20\/More+MSFT+Architect+Bloggers+A+Standard+Rant"]}},"previous_url":"http:\/\/devhawk.net\/2004\/08\/19\/the-incredible-shrinking-inbox\/","next_url":"http:\/\/devhawk.net\/2004\/08\/20\/weird-vpc-issue\/"}