{"status":"ok","post":{"id":1175,"type":"post","slug":"dlr-namespace-change-fire-drill","url":"http:\/\/devhawk.net\/2008\/09\/17\/dlr-namespace-change-fire-drill\/","status":"publish","title":"DLR Namespace Change Fire Drill","title_plain":"DLR Namespace Change Fire Drill","content":"<p><strong>UPDATE<\/strong>: This approach <span style=\"text-decoration: underline;\"><em>doesn&#8217;t work<\/em><\/span>. Please see the <a href=\"http:\/\/devhawk.net\/2008\/10\/21\/the-fifth-assembly\/\">followup article<\/a> for the gory details.<\/p>\n<p>[Ed. Note – This long post is about changes we made in the DLR to avoid type collisions with System.Core. The short version of this post is “You can safely ignore the CS1685 warning you’ll get if you embed IPy 2.0 Beta 5 or later in your C# 3.0 application”. The long version below has the gory details of what we did, why we did it, a little about how extension methods work and why you can ignore warning CS1685.]<\/p>\n<p>[Author note – I don’t really have an editor.]<\/p>\n<p>Between Beta 3 and Beta 4 of IronPython 2.0, the DLR team made a very significant change to Microsoft.Scripting.Core.dll. As <a href=\"http:\/\/evain.net\/blog\/articles\/2008\/07\/29\/net-4-c-4-and-the-dlr\">JB noticed<\/a>, the DLR expression trees have merged with the LINQ expression trees. As part of this effort, they moved the newly merged expression tree types in Microsoft.Scripting.Core.dll into the System.Linq.Expressions namespace – the same namespace where those types live in System.Core.dll in .NET Framework 3.5.<\/p>\n<p>This change caused <a href=\"http:\/\/lists.ironpython.com\/pipermail\/users-ironpython.com\/2008-August\/thread.html#8036\">quite a few issues<\/a> with our users. Basically, because of the expression tree merge and the namespace change, the beta 4 version of Microsoft.Scripting.Core.dll had type collisions with System.Core.dll all over the place, making it hard or impossible to use them together. If you&#8217;re using C# you could get around these type collisions by using an <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/yabyz3h4.aspx\">assembly reference alias<\/a>. However, assembly reference aliases aren’t supported for Web Sites projects or in Visual Basic.<\/p>\n<p>To fix this, we&#8217;re changing the top level namespace in Microsoft.Scripting.Core.dll from System to Microsoft. We&#8217;re not going back to the namespaces as they were in Beta 3 &#8211; for example, DLR expression trees were originally in the Microsoft.Scripting.Ast namespace but now they&#8217;ll be in Microsoft.Linq.Expressions. We don&#8217;t think this change will be much of an issue because most people don&#8217;t use types from Microsoft.Scripting.Core.dll directly. Unless you&#8217;re building your own DLR language, this namespace change shouldn&#8217;t affect you at all except to solve the type collision problem.<\/p>\n<p>However, we did hit a small snag.<\/p>\n<p>The LINQ expression tree code, having been written for .NET 3.5, is a heavy user of extension methods. This means IronPython is now also a heavy user of extension methods. However, unlike LINQ, IronPython has to run against .NET 2.0 SP1. That means we can&#8217;t reference System.Core.dll in IPy or DLR. If you try to compile C# code with extension methods but without a reference System.Core.dll, you get a <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/bb384020.aspx\">compiler error<\/a> complaining that it can&#8217;t find the required <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/system.runtime.compilerservices.extensionattribute.aspx\">ExtensionAttribute<\/a> type, which is defined in System.Core.dll.<\/p>\n<p>This might appear to be an unsolvable problem, but it turns out the C# compiler doesn&#8217;t actually care <em>where<\/em> the ExtensionAttribute type comes from. You can actually define your own copy of ExtensionAttribute (in the <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/system.runtime.compilerservices.aspx\">right namespace<\/a>) and C# will happily compile extension methods without complaint. Furthermore, ExtensionAttribute is only used as a marker &#8211; there&#8217;s <a href=\"code:\/\/System.Core:3.5.0.0\/System.Runtime.CompilerServices.ExtensionAttribute\">no real code in it<\/a> &#8211; so implementing your own copy is trivial. In the DLR source, you&#8217;ll find they have defined their own copy of <a href=\"http:\/\/www.codeplex.com\/IronPython\/SourceControl\/FileView.aspx?itemId=478318&amp;changeSetId=39144\">ExtensionAttribute<\/a> so they can use extension methods and remain .NET 2.0 SP1 compatible. Since we were using them in Microsoft.Scripting.Core.dll, we started using extension methods in Microsoft.Scripting.dll and IronPython.dll as well.<\/p>\n<p>If you&#8217;ll recall back to the start of this post, we&#8217;re changing namespaces in order to eliminate type collisions. The snag we hit was that we couldn’t change the ExtensionAttribute namespace without breaking all the extension methods. But we couldn’t leave it the same without having a type collision with the ExtensionAttribute defined in System.Core.dll. If you had a project including both copies of ExtensionAttribute, C# would generate a multiple type definition warning and VB would generate a multiple type definition error.<\/p>\n<p>We&#8217;ve looked at a several possible solutions to this. One idea was to ship two completely different sets of binaries &#8211; one for .NET 2.0 and one for .NET 3.5. But the upgrade story for that stinks &#8211; you want to upgrade your app to .NET 3.5 you have to swap out all your IPy and DLR dlls. Yuck. We considered having separate copies of just Microsoft.Scripting.Core.dll &#8211; one defining ExtensionAttribute and the other linked to System.Core.dll and using <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/system.runtime.compilerservices.typeforwardedtoattribute.aspx\">TypeForwardedTo<\/a> &#8211; but since the assemblies are strongly typed they&#8217;d have to same exact version number in order to be swappable. Double yuck.<\/p>\n<p>In the end, we decided to put an internal copy of ExtensionAttribute in each assembly that needs it. As previously indicated, that&#8217;s IronPython.dll and Microsoft.Scripting.dll as well as making the copy already in Microsoft.Scripting.Core.dll internal. For <a href=\"http:\/\/www.ironruby.com\/\">IronRuby<\/a> fans reading this, we also added a copy of ExtensionAttribute to IronRuby.dll and IronRuby.Libraries.Scanner.dll as well.<\/p>\n<p>It seems counterintuitive, doesn&#8217;t it? To solve a multiple type definition problem, we defined even more copies of the type in question.<\/p>\n<p>The key thing is that all these copies of ExtensionAttribute (except the one in System.Core.dll) are internal rather than public types. If you build a VB app that references System.Core.dll and Microsoft.Scripting.Core.dll (beta 4), you end up with multiple <em>public<\/em> copies of ExtensionAttribute and are rewarded with a VB compiler error. However, as long as there&#8217;s only one public copy of ExtensionAttribute &#8211; regardless of the number of internal copies of that type &#8211; VB is happy. So if you&#8217;re building a VB app against Microsoft.Scripting.Core.dll (beta 5) and System.Core, you should be golden.<\/p>\n<p>In C# 3.0, on the other hand, continues to throw a warning. If ExtensionAttribute was a user-defined type, we&#8217;d be fine. However, since Extension attribute is a &#8220;predefined system type&#8221;, you get <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/8xys0hxk.aspx\">C# warning 1685<\/a> even though the copies of ExtensionAttribute are all internal. Furthermore, since there are multiple internal copies of ExtensionAttribute in the IPy dlls, you&#8217;ll get this warning even if you&#8217;re not referencing System.Core. It seems here that C# 3.0 considers ExtensionAttribute a predefined system type while VB doesn&#8217;t.<\/p>\n<p>I realize that always having a warning in C# 3.0 &#8211; even if you&#8217;re not referencing System.Core.dll &#8211; doesn&#8217;t feel particularly clean. Given our desire to support both .NET v2 and v3.5 with the same binaries, it was the only choice. Remember that ExtensionAttribute has literally no code and is only used to signal the compiler for extension methods, so we decided it was fairly ignorable as warnings go.<\/p>\n<p>If you&#8217;re willing to compile from source yourself, it&#8217;s fairly easy to build a set of binaries for a specific version .NET that doesn&#8217;t have the warning. If you&#8217;re building for v3.5, you need to remove Extension.cs from the three projects that have a copy of it (Microsoft.Scripting.Core, Microsoft.Scripting, IronPython) and add a reference to System.Core.dll. If you&#8217;re building for v2.0, remove the Extension.cs from Microsoft.Scripting and IronPython then change the visibility in the Microsoft.Scripting.Core version from internal to public. Note, we <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/microsoft.build.tasks.managedcompiler.treatwarningsaserrors.aspx\">treat warnings as errors<\/a> in IPy, but we did add CS1685 to the list of <a href=\"http:\/\/msdn.microsoft.com\/en-us\/library\/microsoft.build.tasks.csc.warningsnotaserrors.aspx\">WarningsNotAsErrors<\/a> so the code still compiles. Of course, if you’re defining a framework specific version, you won’t get the warning anyway.<\/p>\n<p>As usual, we appreciate all feedback from our community so hammer on this build as much as you can &#8211; esp. if you&#8217;ve been having type conflict errors with Beta 4. As I <a href=\"http:\/\/devhawk.net\/2008\/09\/17\/IronPython+Beta+5.aspx\">said in an earlier post<\/a>, this is our last planned beta, so now’s the time put it thru the paces to make sure there’s nothing blocking you before we get to 2.0.<\/p>\n<p>Finally, major props to Curt&#8230;aka <a href=\"http:\/\/blogs.msdn.com\/curth\/\">IRON CURT<\/a>&#8230;for driving these dev changes and putting up with the constant barrage of &#8220;where are we now?&#8221; status requests from yours truly. I&#8217;m sure he now regrets sitting across the hall within easy earshot.<\/p>\n","excerpt":"<p>UPDATE: This approach doesn&#8217;t work. Please see the followup article for the gory details. [Ed. Note – This long post is about changes we made in the DLR to avoid type collisions with System.Core. The short version of this post is “You can safely ignore the CS1685 warning you’ll get if you embed IPy 2.0 Beta [&hellip;]<\/p>\n","date":"2008-09-17 16:46:18","modified":"2012-06-19 22:38:59","categories":[{"id":252,"slug":"ironpython","title":"IronPython","description":"","parent":0,"post_count":99}],"tags":[{"id":231,"slug":"dlr","title":"DLR","description":"","post_count":25},{"id":253,"slug":"ironruby","title":"IronRuby","description":"","post_count":16}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2123,"name":"Domonyi","url":"http:\/\/arieshu.blogspot.com","date":"2008-09-27 23:19:12","content":"<p>Hi,<\/p>\n<p>Your site is one of my favorites seen around blog explosion. Keep up the good work.<br \/>\nI enjoy reading your blog. It is great to find someone who can find the fun things in life!<br \/>\nI wish you all the best in all years. Please take a look at my websites and increase your page rank,<br \/>\ntraffic as well. I look forward to developing a friendship and networking with you. Let me know if there<br \/>\nis something I can do to assist you with your business free.<\/p>\n<p>With Regards,<br \/>\nKaroly Domonyi<br \/>\n<a href=\"http:\/\/www.ariestrade.com\" rel=\"nofollow\">http:\/\/www.ariestrade.com<\/a><\/p>\n","parent":0}],"attachments":[],"comment_count":1,"comment_status":"closed","custom_fields":{"dasblog_entryid":["d36d596b-e086-49dd-a05e-2a83fa790bdf"],"dasblog_compressedtitle":["DLR+Namespace+Change+Fire+Drill"],"dasblog_compressedtitleunique":["2008\/09\/17\/DLR+Namespace+Change+Fire+Drill"]}},"previous_url":"http:\/\/devhawk.net\/2008\/09\/17\/ironpython-beta-5\/","next_url":"http:\/\/devhawk.net\/2008\/10\/19\/the-pdc-prep-death-march-its-almost-over\/"}