{"status":"ok","post":{"id":653,"type":"post","slug":"i-hate-the-term-mashup","url":"http:\/\/devhawk.net\/2005\/11\/22\/i-hate-the-term-mashup\/","status":"publish","title":"I Hate The Term Mashup","title_plain":"I Hate The Term Mashup","content":"<p>Wikipedia has two definitions of <a href=\"http:\/\/en.wikipedia.org\/wiki\/Mashup\">mashup<\/a>:<\/p>\n<ul>\n<li><a href=\"http:\/\/en.wikipedia.org\/wiki\/Mashup_(music)\">Mashup (music)<\/a>: a musical genre consisting of the combination of the parts of more than one song\n<\/li>\n<li><a href=\"http:\/\/en.wikipedia.org\/wiki\/Mashup_(web_application_hybrid)\">Mashup (web application hybrid)<\/a>: a website or web application that combines content from more than one source<\/li>\n<\/ul>\n<p>I was originally introduced to the term mashup in the musical sense by <a href=\"http:\/\/www.dailysourcecode.com\/\">Daily Source Code<\/a>. In this usage, mashup implies mixing songs together. Given that songs are typically stand along entities designed to be enjoyed as is, mashup means (to me anyway) combining stuff <i>that was never meant to be combined in the first place<\/i>. Even Wikipedia includes musical mashup under the general heading of <a href=\"http:\/\/en.wikipedia.org\/wiki\/BastardPop\">Bastard Pop<\/a>.<\/p>\n<p>So given that, by definition, mashups combine stuff that wasn&#8217;t designed to be combined, I don&#8217;t understand why an application like <a href=\"http:\/\/www.zvents.com\/\">Zvents<\/a> or <a href=\"http:\/\/apps.nikhilk.net\/VirtualPlaces\">Virtual Places<\/a> is considered a mashup. Apps like these use browser based components (<a href=\"http:\/\/scobleizer.wordpress.com\/\">Scoble<\/a> calls them <a href=\"http:\/\/scobleizer.wordpress.com\/2005\/11\/07\/what-do-you-call-things-like-flickr-microsoft-gadgets-google-maps-amazon-affiliate-parts\/\">Internet Connected Components<\/a>) that are well defined, have public APIs and are designed to be used together. Not exactly &#8220;bastard pop&#8221; now is it?<\/p>\n<p>In reality, a site like Zvents could have used a server side mapping component and provided a similar experience. Of course, a client side mapping solution is both sexier and more practical (no need for dedicated map data files or assemblies on your own machines) but semantically they provide the same information. Same thing goes for Virtual Places, except that Virtual Places is also pulling both functionality (i.e. the mapping component) as well as data (i.e. blogs and photos) from other sites across the Internet. Could that be done on the server side? You betcha. Would it be as cool or functional? No. Does that make it a completely different type of application that deserves a new name. IMO, no. These are component based apps &#8211; they just use the browser as the platform and the components are coming across the web (as you would expect when you use the browser as a platform).<\/p>\n<p>The higher order bit for me is who controls the experience. For apps like Zvents and VirtualPlaces, it&#8217;s the application developer. For something like <a href=\"http:\/\/live.com\/\">Live.com<\/a>, it&#8217;s me. I decide what to put on my Live page. Not that one is more important than the other or that they aren&#8217;t compatible experiences &#8211; I could easily imagine a Zvents <a href=\"http:\/\/microsoftgadgets.com\/\">gadget<\/a> that lived in Live.com. Or consuming the RSS feed from Zvents in Live.com. Or a generic iCal gadget that could consume a Zvents iCal feed. But the point is that there are large differences between browser component based application like Zvents and a user managed composite browser application like Live.com. <\/p>\n<p>To me, composite apps like Live.com fit better to the original definition of mashup than something like Zvents or Virtual Places. They both have their place and their value, but I like to call things that are different by different names in order to reduce confusion.<\/p>\n<p>Of course, composite apps aren&#8217;t limited to the browser. <a href=\"http:\/\/msdn.microsoft.com\/practices\/\">p&amp;p<\/a> just shipped their <a href=\"http:\/\/www.gotdotnet.com\/codegallery\/codegallery.aspx?id=22f72167-af95-44ce-a6ca-f2eafbf2653c\">Composite UI Application Block<\/a> last week. I dug into it a bit last week and it&#8217;s awesome. More on that later.<\/p>\n","excerpt":"<p>Wikipedia has two definitions of mashup: Mashup (music): a musical genre consisting of the combination of the parts of more than one song Mashup (web application hybrid): a website or web application that combines content from more than one source I was originally introduced to the term mashup in the musical sense by Daily Source [&hellip;]<\/p>\n","date":"2005-11-22 13:14:46","modified":"2005-11-22 13:14:46","categories":[{"id":177,"slug":"architecture","title":"Architecture","description":"","parent":0,"post_count":296}],"tags":[{"id":188,"slug":"web-2-0","title":"Web 2.0","description":"","post_count":67}],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[],"attachments":[],"comment_count":0,"comment_status":"closed","custom_fields":{"dasblog_entryid":["bef3c7c3-a137-4359-ab32-2d724f9a50da"],"dasblog_compressedtitle":["I+Hate+The+Term+Mashup"],"dasblog_compressedtitleunique":["2005\/11\/22\/I+Hate+The+Term+Mashup"]}},"previous_url":"http:\/\/devhawk.net\/2005\/11\/14\/what-is-up-with-the-three-amigos\/","next_url":"http:\/\/devhawk.net\/2005\/11\/23\/thoughts-on-cab\/"}