{"status":"ok","post":{"id":431,"type":"post","slug":"long-cold-winter-without-hockey","url":"http:\/\/devhawk.net\/2004\/09\/10\/long-cold-winter-without-hockey\/","status":"publish","title":"Long Cold Winter Without Hockey","title_plain":"Long Cold Winter Without Hockey","content":"<p><a href=\"http:\/\/blogs.msdn.com\/jevdemon\">John Evdemon<\/a> and I were chatting about making time to &#8220;get our hands dirty&#8221; on some code. After the last meeting between hockey owners and players, it looks like we&#8217;ll both have plenty of time on our hands since there won&#8217;t be any hockey to watch. <\/p>\n<p>I agree with <a href=\"http:\/\/sports.espn.go.com\/nhl\/columns\/story?columnist=hradek_ej&amp;id=1878413\">this ESPN.com article<\/a> that there is plenty of blame to go around, but it looks to me that most of it sits with the players on this one. The players 12th-hour proposal apparently included a luxury tax\/revenue sharing system and a salary rollback that would come to about $100 million dollars. The problem is the league as a whole is losing around $200-$300 million a year (<a href=\"http:\/\/www.nhlcbanews.com\/levitt\/index.html\">according to<\/a> former SEC Commission Chair Arthur Levitt). So great, with the player&#8217;s proposal, the league continues to hemorrhage over $100 million a year while the luxury tax system spreads it around so everyone feels the pain.<\/p>\n<p>Maybe these guys have been checked into the boards a few too many times, but the numbers are very simple: According to <a href=\"http:\/\/www.nhlcbanews.com\/levitt_transcript021204.html\">the league<\/a>, their revenue is around $2 billion, with around 75% going to player salaries. Furthermore, in the past decade, revenue has grown 173% but player salaries have grown 261%. Mess around with those numbers in Excel and you&#8217;ll discover that revenue is growing about 5.6% year while salaries are growing 10% a year. Assuming those numbers stay constant and you have salaries equaling revenue in 2011 &#8211; only 7 years away. Now, if you include the 5% salary rollback that the players are proposing, assuming the model doesn&#8217;t change much (and it shouldn&#8217;t &#8211; my understanding of the rest of the player proposal deals with revenue sharing, but I&#8217;m using the overall league revenue and salaries in this analysis) then that date pushes back just one entire season before the player salaries equal revenue. I&#8217;m not sure how anyone in the player&#8217;s union can say the current system is working with a straight face.<\/p>\n<p>It&#8217;s going to be a long cold winter if you&#8217;re a hockey fan. I&#8217;m guessing the players are assuming they owners will cave like they did during the &#8217;94-&#8217;95 season. Memo to the players, in 1994, the owners were only paying about half of league revenues to player salaries. In other words, they made more money playing than not playing. This time, with the owners losing less money by not playing, they don&#8217;t have much incentive to cave.<\/p>\n","excerpt":"<p>John Evdemon and I were chatting about making time to &#8220;get our hands dirty&#8221; on some code. After the last meeting between hockey owners and players, it looks like we&#8217;ll both have plenty of time on our hands since there won&#8217;t be any hockey to watch. I agree with this ESPN.com article that there is [&hellip;]<\/p>\n","date":"2004-09-10 14:27:44","modified":"2004-09-10 14:27:44","categories":[{"id":234,"slug":"sports","title":"Sports","description":"","parent":0,"post_count":50}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2678,"name":"sean@unboxedsolutions.com (Sean Chase)","url":"http:\/\/www.unboxedsolutions.com\/sean","date":"2004-09-10 15:07:35","content":"<p>Dammit!!!!!! This is the first I&#8217;ve heard of this and now I won&#8217;t be having a nice weekend. Harsh news.<\/p>\n","parent":0},{"id":2679,"name":"Mike Walsh Helsinki","url":"","date":"2004-09-14 03:58:38","content":"<p>It&#8217;s been reported in the Finnish press that if the strike happens then only four of the Finnish NHL players will be playing for their old Finnish clubs until the dispute is over. (This compares with a much greater percentage last time there was a strike).<\/p>\n<p>One reason given was the need for hefty insurance payments together with the lack of money in Finnish hockey (unlikely seeing what they can still pay to some foreign players here together with the high charges for season tickets and normal entrance). <\/p>\n<p>However my feeling is that then the players needed the money and nowadays with the NHL salaries way up they no longer do and so are just taking the time off.<\/p>\n","parent":0}],"attachments":[],"comment_count":2,"comment_status":"closed","custom_fields":{"dasblog_entryid":["82882e47-cc0a-4b26-b795-779aa6c19265"],"dasblog_compressedtitle":["Long+Cold+Winter+Without+Hockey"],"dasblog_compressedtitleunique":["2004\/09\/10\/Long+Cold+Winter+Without+Hockey"]}},"previous_url":"http:\/\/devhawk.net\/2004\/09\/10\/more-on-my-new-voip-service\/","next_url":"http:\/\/devhawk.net\/2004\/09\/10\/quick-architecture-takes\/"}