[
  {
    "id": 2593,
    "author-name": "Darrel Miller",
    "author-email": "darrel@tavis.ca",
    "author-url": "",
    "date": "2004-04-27T04:32:12-07:00",
    "content": "I can't quote you the exact statistics but I think I can safely say 90% of North American companies are less 100 employees.  With that size of company you should easily be able to host a ERP, SCM or CRM type of app on a single server.\nA disproportionate amount of media space is consumed by trying to resolve the scalability issues of Amazon and Google!\nInterestingly enough, horizontally partitioned departmental applications, each installed on seperate servers starts to make large companies look like many smaller interoperating companies.\n",
    "parent-id": 355,
    "RowKey": "20040427-043212"
  },
  {
    "id": 2594,
    "author-name": "Tom Vande Stouwe, MCT, MCSD",
    "author-email": "tomv@conpro.net",
    "author-url": "http://www.conpro.net",
    "date": "2004-05-11T13:41:06-07:00",
    "content": "While I agree with Darrel on the numbrer of 'small' companies, I disagree with the conclusion. While these companies have low scalability need now, as the quantity and quality og 'network enabled applications' and the use of Web Services et al, will make scalability and reusability very important topics for the small enterprise.\n\nlarge organizations are already architecting to scale, but the small company is ignoring it, and they will be the ones that will get caught short. We live in a global economy, and the well connected mud hut in lower Slobinia will take business from Main Street if they present a better electronic face.\n\nMy Conclusion? Architecting and scalability is MORE important to the under 100 member comnpanies then to the Fortune 100 companies.  The fact that this represents 90% of American companies just points to the importance to our National economy not to ignore these 'not so low hanging fruit' companies. \n\nWe need to look at small company architecture as more of a structured approach, where processes will more likely impact the companies processes then in big companies where we try to make the systems work like the users, rather then the other way around. We need to start looking at Small enterprises as nothing more then small node on the larger network, and position ourselves and our clients to capitalize on that.\n\nIn any case we can be sure that the needs of our small business will be met, either by us, or by our (international and national) competition.",
    "parent-id": 355,
    "RowKey": "20040511-134106"
  },
  {
    "id": 2595,
    "author-name": "Darrel Miller",
    "author-email": "darrel@tavis.ca",
    "author-url": "",
    "date": "2004-05-14T15:58:21-07:00",
    "content": "\"While these companies have low scalability need now, as the quantity and quality og 'network enabled applications' and the use of Web Services et al, will make scalability and reusability very important topics for the small enterprise. \"\n\nI'm confused!  Why would the quantity or quality of network enabled applications affect the scalabilty requirements of a small business?\n\nScalability is about the number of transactions, the number of users, the number of clients a company has.\n\nThe majority of small companies are not small because they are budding Ebay's that are just waiting for their big break.  Many are small because that's how the like it, some are small because they don't have the management capacity to grow, some are in a business that just naturally doesn't scale.\n\nMost companies don't fail to grow because their IT infrastructure can't handle it.  \nDon't get me wrong, some startups have every intention of becoming big, quickly and need to plan for that.  But that is a small percentage of companies.\n\nTrust me when I say that I will not be ordering pizza over the web from a 10 man outfit in lower Slobenia any time soon!\n",
    "parent-id": 355,
    "RowKey": "20040514-155821"
  }
]