{"status":"ok","post":{"id":686,"type":"post","slug":"dennis-miller-has-jumped-the-shark","url":"http:\/\/devhawk.net\/2006\/02\/11\/dennis-miller-has-jumped-the-shark\/","status":"publish","title":"Dennis Miller Has Jumped the Shark","title_plain":"Dennis Miller Has Jumped the Shark","content":"<p>I was so excited to see the Dennis Miller&#8217;s <a href=\"http:\/\/www.hbo.com\/events\/dmiller\/\">latest HBO special<\/a>, but it was such let down. He spent the first half sucking wind and the second half sucking up to the Republicans. I mean, he used to have such a sharp policital wit, but now he&#8217;s just another partisan hack. It&#8217;s pretty sad. <\/p>\n<p>At least <a href=\"http:\/\/www.hbo.com\/billmaher\/\">Bill Maher<\/a> is back next week. <\/p>\n","excerpt":"<p>I was so excited to see the Dennis Miller&#8217;s latest HBO special, but it was such let down. He spent the first half sucking wind and the second half sucking up to the Republicans. I mean, he used to have such a sharp policital wit, but now he&#8217;s just another partisan hack. It&#8217;s pretty sad. [&hellip;]<\/p>\n","date":"2006-02-11 23:36:21","modified":"2006-02-11 23:36:21","categories":[{"id":219,"slug":"politics","title":"Politics","description":"","parent":0,"post_count":41}],"tags":[],"author":{"id":1,"slug":"admin","name":"DevHawk","first_name":"Harry","last_name":"Pierson","nickname":"DevHawk","url":"","description":""},"comments":[{"id":2890,"name":"Matt T.","url":"","date":"2006-02-13 06:52:31","content":"<p>Because Bill Maher isn&#8217;t another partisan hack. :rollseyes:<\/p>\n","parent":0},{"id":2891,"name":"CJ","url":"","date":"2006-02-13 11:13:23","content":"<p>Would you still consider Dennis Miller to be a partisan hack if you agreed with him?<\/p>\n","parent":0},{"id":2892,"name":"DevHawk","url":"","date":"2006-02-13 12:49:20","content":"<p>If Dennis Miller was critical of both democrats and republicans, then I wouldn&#8217;t consider him a partisan hack. But when you repurpose Karl Rove&#8217;s talking points into unfunny jokes, that makes you a partisan hack in my book. Even with the massive amount of corruption and ineptitude in this administration as fodder, the best Dennis could come up with was to make fun of John Kerry and Howard Dean in the presidential election from two years ago. Calling President &#8220;Sit For Seven Minutes While My Country Is Under Attack&#8221; Bush &#8220;decisive might be funny, if it wasn&#8217;t so sad.<\/p>\n<p>However, I do have to give Dennis small props for coming out in favor of gay marriage. <\/p>\n<p>As for Bill Maher, one of the reasons I like him is because he frequently criticizes both sides of the aisle. Of course, if you watched him, you&#8217;d know that. <\/p>\n","parent":0},{"id":2893,"name":"Steve","url":"","date":"2006-02-14 12:25:34","content":"<p>I used to watch Bill Maher&#8217;s show occasionally and I certainly don&#8217;t think anyone is going to accuse him of being ballanced.  I might agree that he occasionally makes jokes about liberals there are far more times that he trashes conservatives and\/or Christians.<\/p>\n<p>We&#8217;re all more sensitive to jokes about things we hold dear.<\/p>\n","parent":0},{"id":2894,"name":"CJ","url":"","date":"2006-02-15 11:23:52","content":"<p>I don&#8217;t watch Bill Maher because he strikes me as rather pompous, all politics aside.  <\/p>\n<p>I remember Miller going after Reagan and Bush Sr. in the 80s &#8212; not exactly the m.o. of a diehard Republican.  What changed?  Miller claims that his turning point was 9\/11; if so, how can a man so previously &#8220;sharp witted&#8221; become such a dunce?<\/p>\n<p>This sounds just like the charges leveled at Bush: he&#8217;s a moron and a rube&#8230;but he&#8217;s the most SINISTER and BRILLIANT simpleton in the world, who managed to lead a massive conspiracy to steal at least one U.S. election and lead the country into war.<\/p>\n<p>Hey, you can&#8217;t have it both ways.<\/p>\n<p>And since we&#8217;re on the topic of 9\/11 and you mentioned Bush sitting in that classroom: what ELSE was he supposed to do?  Dive into a coat closet, throw on his Superman costume, and fly to the rescue?  Stand up, race out of the classroom and alarm the kids?  Or assume that the first reponders and the military are on it and that ten more minutes in a school won&#8217;t change a thing?<\/p>\n<p>What could have Bush done on that day that would have changed ANYTHING?<\/p>\n<p>Kerry and Dean are easy targets for comedians like Miller: the former is a cold, robotic relic from the 60s who spends more time posing and talking about his few months in Vietnam than in the Senate, and the second is a delusional windbag who currently is spending more of the Democratic party&#8217;s money than they can raise.<\/p>\n<p>Steve is right: we&#8217;re all more sensitive to jokes about things we hold dear.  But that doesn&#8217;t mean we can&#8217;t recognize our own partisan preferences and admit that the other side is right once in a while.<\/p>\n","parent":0},{"id":2895,"name":"DevHawk","url":"","date":"2006-02-16 10:41:46","content":"<p>As soon as the other side is right again, I&#8217;ll be sure to admit it! <img src=\"http:\/\/devhawk.net\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/> <\/p>\n","parent":0}],"attachments":[],"comment_count":6,"comment_status":"closed","custom_fields":{"dasblog_entryid":["1a9e0102-c263-4226-b1cb-e076c94cf6bc"],"dasblog_compressedtitle":["Dennis+Miller+Has+Jumped+The+Shark"],"dasblog_compressedtitleunique":["2006\/02\/12\/Dennis+Miller+Has+Jumped+The+Shark"]}},"previous_url":"http:\/\/devhawk.net\/2006\/02\/11\/latest-architecture-journal\/","next_url":"http:\/\/devhawk.net\/2006\/02\/13\/web-2-0-evolution\/"}